$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.4',
          'Headers' => {
                         'chksum.h' => 1,
                         'cpumask_types.h' => 1,
                         'eth.h' => 1,
                         'init_types.h' => 1,
                         'ip.h' => 1,
                         'linux.h' => 1,
                         'packet_types.h' => 1,
                         'thread.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libodphelper-linux.so.110.1.1',
          'LibraryVersion' => '1.12.0.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'chksum.c' => 1,
                         'eth.c' => 1,
                         'ip.c' => 1,
                         'linux.c' => 1
                       },
          'SymbolInfo' => {
                            '10295' => {
                                         'Header' => 'linux.h',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'pthread_tbl',

                                                              '_fini' => 1,
                                                              '_init' => 1,
                                                              'odp_hashnode_give' => 1,
                                                              'odp_hashnode_take' => 1,
                                                              'odp_key_hash' => 1,
                                                              'odph_eth_addr_parse' => 1,
                                                              'odph_hash_get_value' => 1,
                                                              'odph_hash_put_value' => 1,
                                                              'odph_hash_remove_value' => 1,
                                                              'odph_hash_table_create' => 1,
                                                              'odph_hash_table_destroy' => 1,
                                                              'odph_hash_table_lookup' => 1,
                                                              'odph_hash_table_ops' => -48,
                                                              'odph_ipv4_addr_parse' => 1,
                                                              'odph_linear_table_create' => 1,
                                                              'odph_linear_table_destroy' => 1,
                                                              'odph_linear_table_lookup' => 1,
                                                              'odph_linear_table_ops' => -48,
                                                              'odph_lineartable_get_value' => 1,
                                                              'odph_lineartable_put_value' => 1,
                                                              'odph_linux_process_fork' => 1,
                                                              'odph_linux_process_fork_n' => 1,
                                                              'odph_linux_process_wait_n' => 1,
                                                              'odph_linux_pthread_create' => 1,
                                                              'odph_linux_pthread_join' => 1,
                                                              'odph_merge_getopt_options' => 1,
                                                              'odph_odpthread_getaffinity' => 1,
                                                              'odph_odpthread_setaffinity' => 1,
                                                              'odph_odpthreads_create' => 1,
                                                              'odph_odpthreads_join' => 1,
                                                              'odph_parse_options' => 1,
                                                              'odph_udp_tcp_chksum' => 1
                                                            }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '105' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '11067' => {
                                       'BaseType' => '7373',
                                       'Name' => 'odph_linux_pthread_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11073' => {
                                       'BaseType' => '11079',
                                       'Name' => 'odph_linux_thr_params_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11079' => {
                                       'BaseType' => '7305',
                                       'Name' => 'odph_linux_thr_params_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '1138' => {
                                      'BaseType' => '98',
                                      'Header' => 'stdint.h',
                                      'Line' => '51',
                                      'Name' => 'uint32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '119' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '12350' => {
                                       'BaseType' => '7429',
                                       'Name' => 'odph_linux_process_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '126' => {
                                     'BaseType' => '132',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '132' => {
                                     'BaseType' => '119',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '137' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '139' => {
                                     'BaseType' => '119',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '15893' => {
                                       'BaseType' => '139',
                                       'Name' => 'char**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15899' => {
                                       'BaseType' => '15905',
                                       'Name' => 'struct option**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15905' => {
                                       'BaseType' => '7166',
                                       'Name' => 'struct option*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1967' => {
                                      'BaseType' => '1138',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '199' => {
                                     'BaseType' => '73',
                                     'Name' => 'uint8_t[6]',
                                     'Size' => '6',
                                     'Type' => 'Array'
                                   },
                          '2131' => {
                                      'BaseType' => '91',
                                      'Header' => 'stdint.h',
                                      'Line' => '49',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '215' => {
                                     'Header' => 'eth.h',
                                     'Line' => '55',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'addr',
                                                          'offset' => '0',
                                                          'type' => '199'
                                                        }
                                               },
                                     'Name' => 'struct odph_ethaddr_t',
                                     'Size' => '6',
                                     'Type' => 'Struct'
                                   },
                          '2271' => {
                                      'Header' => 'packet_types.h',
                                      'Line' => '29',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '73'
                                                         }
                                                },
                                      'Name' => 'anon-struct-packet_types.h-29',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '2292' => {
                                      'BaseType' => '2303',
                                      'Header' => 'packet_types.h',
                                      'Line' => '29',
                                      'Name' => 'odp_packet_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2303' => {
                                      'BaseType' => '2271',
                                      'Name' => 'anon-struct-packet_types.h-29*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2403' => {
                                      'Header' => 'chksum.h',
                                      'Line' => '35',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ODPH_CHKSUM_GENERATE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ODPH_CHKSUM_VERIFY',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'ODPH_CHKSUM_RETURN',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum odph_chksum_op_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3468' => {
                                      'BaseType' => '2131',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '59' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '6042' => {
                                      'BaseType' => '59',
                                      'Header' => 'types.h',
                                      'Line' => '133',
                                      'Name' => '__pid_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '6097' => {
                                      'BaseType' => '6042',
                                      'Header' => 'sched.h',
                                      'Line' => '35',
                                      'Name' => 'pid_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '6179' => {
                                      'BaseType' => '105',
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '60',
                                      'Name' => 'pthread_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6190' => {
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '63',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__size',
                                                           'offset' => '0',
                                                           'type' => '6225'
                                                         },
                                                  '1' => {
                                                           'name' => '__align',
                                                           'offset' => '0',
                                                           'type' => '66'
                                                         }
                                                },
                                      'Name' => 'union pthread_attr_t',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Type' => 'Union'
                                    },
                          '6225' => {
                                      'BaseType' => '119',
                                      'Name' => 'char[56]',
                                      'Size' => '56',
                                      'Type' => 'Array'
                                    },
                          '6241' => {
                                      'BaseType' => '6190',
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '69',
                                      'Name' => 'pthread_attr_t',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Type' => 'Typedef'
                                    },
                          '6324' => {
                                      'BaseType' => '59',
                                      'Name' => 'int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6465' => {
                                      'BaseType' => '59',
                                      'Name' => 'int const',
                                      'Size' => '4',
                                      'Type' => 'Const'
                                    },
                          '66' => {
                                    'Name' => 'long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '7008' => {
                                      'BaseType' => '105',
                                      'Header' => 'stdint.h',
                                      'Line' => '55',
                                      'Name' => 'uint64_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7019' => {
                                      'Header' => 'cpumask_types.h',
                                      'Line' => '37',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_u8',
                                                           'offset' => '0',
                                                           'type' => '7044'
                                                         }
                                                },
                                      'Name' => 'struct odp_cpumask_t',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '7044' => {
                                      'BaseType' => '73',
                                      'Name' => 'uint8_t[128]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '7060' => {
                                      'BaseType' => '7019',
                                      'Header' => 'cpumask_types.h',
                                      'Line' => '44',
                                      'Name' => 'odp_cpumask_t',
                                      'Size' => '128',
                                      'Type' => 'Typedef'
                                    },
                          '7071' => {
                                      'BaseType' => '7008',
                                      'Header' => 'init_types.h',
                                      'Line' => '22',
                                      'Name' => 'odp_instance_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7082' => {
                                      'Header' => 'thread.h',
                                      'Line' => '36',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ODP_THREAD_WORKER',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ODP_THREAD_CONTROL',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum odp_thread_type_e',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7107' => {
                                      'BaseType' => '7082',
                                      'Header' => 'thread.h',
                                      'Line' => '58',
                                      'Name' => 'odp_thread_type_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '7118' => {
                                      'BaseType' => '7124',
                                      'Name' => 'odp_cpumask_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7124' => {
                                      'BaseType' => '7060',
                                      'Name' => 'odp_cpumask_t const',
                                      'Size' => '128',
                                      'Type' => 'Const'
                                    },
                          '7166' => {
                                      'Header' => 'getopt.h',
                                      'Line' => '104',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '126'
                                                         },
                                                  '1' => {
                                                           'name' => 'has_arg',
                                                           'offset' => '8',
                                                           'type' => '59'
                                                         },
                                                  '2' => {
                                                           'name' => 'flag',
                                                           'offset' => '16',
                                                           'type' => '6324'
                                                         },
                                                  '3' => {
                                                           'name' => 'val',
                                                           'offset' => '24',
                                                           'type' => '59'
                                                         }
                                                },
                                      'Name' => 'struct option',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '7299' => {
                                      'Name' => 'void*(*)(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '137',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '73' => {
                                    'BaseType' => '84',
                                    'Header' => 'stdint.h',
                                    'Line' => '48',
                                    'Name' => 'uint8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '7305' => {
                                      'Header' => 'linux.h',
                                      'Line' => '41',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'start',
                                                           'offset' => '0',
                                                           'type' => '7299'
                                                         },
                                                  '1' => {
                                                           'name' => 'arg',
                                                           'offset' => '8',
                                                           'type' => '137'
                                                         },
                                                  '2' => {
                                                           'name' => 'thr_type',
                                                           'offset' => '16',
                                                           'type' => '7107'
                                                         },
                                                  '3' => {
                                                           'name' => 'instance',
                                                           'offset' => '24',
                                                           'type' => '7071'
                                                         }
                                                },
                                      'Name' => 'struct odph_linux_thr_params_t',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '7373' => {
                                      'Header' => 'linux.h',
                                      'Line' => '50',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'thread',
                                                           'offset' => '0',
                                                           'type' => '6179'
                                                         },
                                                  '1' => {
                                                           'name' => 'attr',
                                                           'offset' => '8',
                                                           'type' => '6241'
                                                         },
                                                  '2' => {
                                                           'name' => 'cpu',
                                                           'offset' => '64',
                                                           'type' => '59'
                                                         },
                                                  '3' => {
                                                           'name' => 'thr_params',
                                                           'offset' => '72',
                                                           'type' => '7305'
                                                         }
                                                },
                                      'Name' => 'struct odph_linux_pthread_t',
                                      'Size' => '104',
                                      'Type' => 'Struct'
                                    },
                          '7429' => {
                                      'Header' => 'linux.h',
                                      'Line' => '57',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pid',
                                                           'offset' => '0',
                                                           'type' => '6097'
                                                         },
                                                  '1' => {
                                                           'name' => 'cpu',
                                                           'offset' => '4',
                                                           'type' => '59'
                                                         },
                                                  '2' => {
                                                           'name' => 'status',
                                                           'offset' => '8',
                                                           'type' => '59'
                                                         }
                                                },
                                      'Name' => 'struct odph_linux_process_t',
                                      'Size' => '12',
                                      'Type' => 'Struct'
                                    },
                          '7440' => {
                                      'Header' => 'linux.h',
                                      'Line' => '60',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ODPTHREAD_NOT_STARTED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ODPTHREAD_PROCESS',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'ODPTHREAD_PTHREAD',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum odph_odpthread_linuxtype_e',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7471' => {
                                      'BaseType' => '7440',
                                      'Header' => 'linux.h',
                                      'Line' => '64',
                                      'Name' => 'odph_odpthread_linuxtype_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '7539' => {
                                      'Name' => 'int(*)(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7545' => {
                                      'Header' => 'linux.h',
                                      'Line' => '72',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'start',
                                                           'offset' => '0',
                                                           'type' => '7539'
                                                         },
                                                  '1' => {
                                                           'name' => 'arg',
                                                           'offset' => '8',
                                                           'type' => '137'
                                                         },
                                                  '2' => {
                                                           'name' => 'thr_type',
                                                           'offset' => '16',
                                                           'type' => '7107'
                                                         },
                                                  '3' => {
                                                           'name' => 'instance',
                                                           'offset' => '24',
                                                           'type' => '7071'
                                                         }
                                                },
                                      'Name' => 'struct odph_odpthread_params_t',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '7589' => {
                                      'Header' => 'linux.h',
                                      'Line' => '78',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'linuxtype',
                                                           'offset' => '0',
                                                           'type' => '7471'
                                                         },
                                                  '1' => {
                                                           'name' => 'thr_params',
                                                           'offset' => '8',
                                                           'type' => '7545'
                                                         }
                                                },
                                      'Name' => 'struct odph_odpthread_start_args_t',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '7600' => {
                                      'Header' => 'linux.h',
                                      'Line' => '86',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'thread_id',
                                                           'offset' => '0',
                                                           'type' => '6179'
                                                         },
                                                  '1' => {
                                                           'name' => 'attr',
                                                           'offset' => '8',
                                                           'type' => '6241'
                                                         }
                                                },
                                      'Name' => 'anon-struct-linux.h-86',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '7633' => {
                                      'Header' => 'linux.h',
                                      'Line' => '90',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pid',
                                                           'offset' => '0',
                                                           'type' => '6097'
                                                         },
                                                  '1' => {
                                                           'name' => 'status',
                                                           'offset' => '4',
                                                           'type' => '59'
                                                         }
                                                },
                                      'Name' => 'anon-struct-linux.h-90',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '7666' => {
                                      'Header' => 'linux.h',
                                      'Line' => '85',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'thread',
                                                           'offset' => '0',
                                                           'type' => '7600'
                                                         },
                                                  '1' => {
                                                           'name' => 'proc',
                                                           'offset' => '0',
                                                           'type' => '7633'
                                                         }
                                                },
                                      'Name' => 'anon-union-linux.h-85',
                                      'Size' => '64',
                                      'Type' => 'Union'
                                    },
                          '7748' => {
                                      'Header' => 'linux.h',
                                      'Line' => '95',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'start_args',
                                                           'offset' => '0',
                                                           'type' => '7589'
                                                         },
                                                  '1' => {
                                                           'name' => 'cpu',
                                                           'offset' => '40',
                                                           'type' => '59'
                                                         },
                                                  '2' => {
                                                           'name' => 'last',
                                                           'offset' => '44',
                                                           'type' => '59'
                                                         },
                                                  '3' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '48',
                                                           'type' => '7666'
                                                         }
                                                },
                                      'Name' => 'struct odph_odpthread_t',
                                      'Size' => '112',
                                      'Type' => 'Struct'
                                    },
                          '8061' => {
                                      'BaseType' => '8067',
                                      'Name' => 'struct option const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8067' => {
                                      'BaseType' => '7166',
                                      'Name' => 'struct option const',
                                      'Size' => '32',
                                      'Type' => 'Const'
                                    },
                          '84' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '8469' => {
                                      'BaseType' => '7748',
                                      'Name' => 'odph_odpthread_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8475' => {
                                      'BaseType' => '8481',
                                      'Name' => 'odph_odpthread_params_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8481' => {
                                      'BaseType' => '7545',
                                      'Name' => 'odph_odpthread_params_t const',
                                      'Size' => '32',
                                      'Type' => 'Const'
                                    },
                          '91' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '978' => {
                                     'BaseType' => '215',
                                     'Name' => 'odph_ethaddr_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '98' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libodphelper-linux.so.110.1.1' => {
                                                                       '_ITM_deregisterTMCloneTable' => 0,
                                                                       '_ITM_registerTMCloneTable' => 0,
                                                                       '_Jv_RegisterClasses' => 0,
                                                                       '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                                       '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                                       '__gmon_start__' => 0,
                                                                       '__isoc99_sscanf@GLIBC_2.7' => 0,
                                                                       '__printf_chk@GLIBC_2.3.4' => 0,
                                                                       '__sched_cpucount@GLIBC_2.6' => 0,
                                                                       '__stack_chk_fail@GLIBC_2.4' => 0,
                                                                       '_exit@GLIBC_2.2.5' => 0,
                                                                       'fork@GLIBC_2.2.5' => 0,
                                                                       'free@GLIBC_2.2.5' => 0,
                                                                       'getopt_long@GLIBC_2.2.5' => 0,
                                                                       'getpid@GLIBC_2.2.5' => 0,
                                                                       'getppid@GLIBC_2.2.5' => 0,
                                                                       'kill@GLIBC_2.2.5' => 0,
                                                                       'malloc@GLIBC_2.2.5' => 0,
                                                                       'memcmp@GLIBC_2.2.5' => 0,
                                                                       'memcpy@GLIBC_2.14' => 0,
                                                                       'memset@GLIBC_2.2.5' => 0,
                                                                       'odp_be_to_cpu_16' => 0,
                                                                       'odp_cpu_count' => 0,
                                                                       'odp_cpumask_count' => 0,
                                                                       'odp_cpumask_first' => 0,
                                                                       'odp_cpumask_next' => 0,
                                                                       'odp_cpumask_set' => 0,
                                                                       'odp_cpumask_zero' => 0,
                                                                       'odp_init_local' => 0,
                                                                       'odp_packet_copy_from_mem' => 0,
                                                                       'odp_packet_copy_to_mem' => 0,
                                                                       'odp_packet_has_ipv4' => 0,
                                                                       'odp_packet_has_ipv6' => 0,
                                                                       'odp_packet_has_tcp' => 0,
                                                                       'odp_packet_has_udp' => 0,
                                                                       'odp_packet_l3_offset' => 0,
                                                                       'odp_packet_l3_ptr' => 0,
                                                                       'odp_packet_l4_offset' => 0,
                                                                       'odp_packet_l4_ptr' => 0,
                                                                       'odp_packet_offset' => 0,
                                                                       'odp_rwlock_init' => 0,
                                                                       'odp_rwlock_read_lock' => 0,
                                                                       'odp_rwlock_read_unlock' => 0,
                                                                       'odp_rwlock_write_lock' => 0,
                                                                       'odp_rwlock_write_unlock' => 0,
                                                                       'odp_shm_addr' => 0,
                                                                       'odp_shm_free' => 0,
                                                                       'odp_shm_lookup' => 0,
                                                                       'odp_shm_reserve' => 0,
                                                                       'odp_term_global' => 0,
                                                                       'odp_term_local' => 0,
                                                                       'optind@GLIBC_2.2.5' => 0,
                                                                       'prctl@GLIBC_2.2.5' => 0,
                                                                       'pthread_attr_destroy@GLIBC_2.2.5' => 0,
                                                                       'pthread_attr_init@GLIBC_2.2.5' => 0,
                                                                       'pthread_attr_setaffinity_np@GLIBC_2.3.4' => 0,
                                                                       'pthread_create@GLIBC_2.2.5' => 0,
                                                                       'pthread_getaffinity_np@GLIBC_2.3.4' => 0,
                                                                       'pthread_join@GLIBC_2.2.5' => 0,
                                                                       'pthread_self@GLIBC_2.2.5' => 0,
                                                                       'pthread_setaffinity_np@GLIBC_2.3.4' => 0,
                                                                       'sched_getaffinity@GLIBC_2.3.4' => 0,
                                                                       'sched_setaffinity@GLIBC_2.3.4' => 0,
                                                                       'stderr@GLIBC_2.2.5' => 0,
                                                                       'strcat@GLIBC_2.2.5' => 0,
                                                                       'strcmp@GLIBC_2.2.5' => 0,
                                                                       'strcpy@GLIBC_2.2.5' => 0,
                                                                       'strncpy@GLIBC_2.2.5' => 0,
                                                                       'strsignal@GLIBC_2.2.5' => 0,
                                                                       'syscall@GLIBC_2.2.5' => 0,
                                                                       'wait@GLIBC_2.2.5' => 0,
                                                                       'waitpid@GLIBC_2.2.5' => 0
                                                                     }
                                },
          'WordSize' => '8'
        };
