$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.4',
          'Headers' => {
                         'atomic.h' => 1,
                         'atomic_types.h' => 1,
                         'barrier.h' => 1,
                         'barrier_types.h' => 1,
                         'buffer.h' => 1,
                         'buffer_types.h' => 1,
                         'classification.h' => 1,
                         'classification_types.h' => 1,
                         'cpu.h' => 1,
                         'cpumask.h' => 1,
                         'cpumask_types.h' => 1,
                         'crypto.h' => 1,
                         'crypto_types.h' => 1,
                         'errno.h' => 1,
                         'event.h' => 1,
                         'event_types.h' => 1,
                         'hash.h' => 1,
                         'init.h' => 1,
                         'init_types.h' => 1,
                         'ip.h' => 1,
                         'packet.h' => 1,
                         'packet_flags.h' => 1,
                         'packet_io.h' => 1,
                         'packet_io_stats.h' => 1,
                         'packet_io_types.h' => 1,
                         'packet_types.h' => 1,
                         'pool.h' => 1,
                         'pool_types.h' => 1,
                         'queue.h' => 1,

                                                        'odp_tm_queue_create' => 1,
                                                        'odp_tm_queue_params_init' => 1,
                                                        'odp_tm_queue_query' => 1,
                                                        'odp_tm_queue_sched_config' => 1,
                                                        'odp_tm_queue_shaper_config' => 1,
                                                        'odp_tm_queue_threshold_config' => 1,
                                                        'odp_tm_queue_wred_config' => 1,
                                                        'odp_tm_sched_create' => 1,
                                                        'odp_tm_sched_lookup' => 1,
                                                        'odp_tm_sched_params_init' => 1,
                                                        'odp_tm_sched_params_read' => 1,
                                                        'odp_tm_sched_params_update' => 1,
                                                        'odp_tm_shaper_create' => 1,
                                                        'odp_tm_shaper_lookup' => 1,
                                                        'odp_tm_shaper_params_init' => 1,
                                                        'odp_tm_shaper_params_read' => 1,
                                                        'odp_tm_shaper_params_update' => 1,
                                                        'odp_tm_stats_print' => 1,
                                                        'odp_tm_threshold_create' => 1,
                                                        'odp_tm_threshold_params_init' => 1,
                                                        'odp_tm_thresholds_lookup' => 1,
                                                        'odp_tm_thresholds_params_read' => 1,
                                                        'odp_tm_thresholds_params_update' => 1,
                                                        'odp_tm_total_query' => 1,
                                                        'odp_tm_total_threshold_config' => 1,
                                                        'odp_tm_wred_create' => 1,
                                                        'odp_tm_wred_lookup' => 1,
                                                        'odp_tm_wred_params_init' => 1,
                                                        'odp_tm_wred_params_read' => 1,
                                                        'odp_tm_wred_params_update' => 1,
                                                        'odp_version_api_str' => 1,
                                                        'odp_version_impl_name' => 1,
                                                        'odp_version_impl_str' => 1
                                                      }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '106390' => {
                                        'BaseType' => '1548',
                                        'Name' => 'odp_buffer_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '106435' => {
                                        'BaseType' => '106441',
                                        'Name' => 'odp_buffer_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '106441' => {
                                        'BaseType' => '1548',
                                        'Name' => 'odp_buffer_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '106925' => {
                                        'Header' => 'packet_types.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_PACKET_GREEN',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_PACKET_YELLOW',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'ODP_PACKET_RED',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'ODP_PACKET_ALL_COLORS',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum odp_packet_color_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '108' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '11173' => {
                                       'Header' => 'packet_io_stats.h',
                                       'Line' => '34',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in_octets',
                                                            'offset' => '0',
                                                            'type' => '1419'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_ucast_pkts',
                                                            'offset' => '8',
                                                            'type' => '1419'
                                                          },
                                                   '2' => {
                                                            'name' => 'in_discards',
                                                            'offset' => '16',
                                                            'type' => '1419'
                                                          },
                                                   '3' => {
                                                            'name' => 'in_errors',
                                                            'offset' => '24',
                                                            'type' => '1419'
                                                          },
                                                   '4' => {
                                                            'name' => 'in_unknown_protos',
                                                            'offset' => '32',
                                                            'type' => '1419'
                                                          },
                                                   '5' => {
                                                            'name' => 'out_octets',
                                                            'offset' => '40',
                                                            'type' => '1419'
                                                          },
                                                   '6' => {
                                                            'name' => 'out_ucast_pkts',
                                                            'offset' => '48',
                                                            'type' => '1419'
                                                          },
                                                   '7' => {
                                                            'name' => 'out_discards',
                                                            'offset' => '56',
                                                            'type' => '1419'
                                                          },
                                                   '8' => {
                                                            'name' => 'out_errors',
                                                            'offset' => '64',
                                                            'type' => '1419'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_stats_t',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '11294' => {
                                       'BaseType' => '11173',
                                       'Header' => 'packet_io_stats.h',
                                       'Line' => '107',
                                       'Name' => 'odp_pktio_stats_t',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '11305' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '71',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PKTIN_MODE_DIRECT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PKTIN_MODE_SCHED',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_PKTIN_MODE_QUEUE',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_PKTIN_MODE_DISABLED',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum odp_pktin_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '11342' => {
                                       'BaseType' => '11305',
                                       'Header' => 'packet_io.h',
                                       'Line' => '80',
                                       'Name' => 'odp_pktin_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '11353' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '85',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PKTOUT_MODE_DIRECT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PKTOUT_MODE_QUEUE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_PKTOUT_MODE_TM',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_PKTOUT_MODE_DISABLED',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum odp_pktout_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '11390' => {
                                       'BaseType' => '11353',
                                       'Header' => 'packet_io.h',
                                       'Line' => '94',
                                       'Name' => 'odp_pktout_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '11401' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '104',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4_udp',
                                                            'offset' => '0',
                                                            'type' => '129'
                                                          },
                                                   '1' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4_tcp',
                                                            'offset' => '0',
                                                            'type' => '129'
                                                          },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4',
                                                            'offset' => '0',
                                                            'type' => '129'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv6_udp',
                                                            'offset' => '0',
                                                            'type' => '129'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv6_tcp',
                                                            'offset' => '0',
                                                            'type' => '129'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv6',
                                                            'offset' => '0',
                                                            'type' => '129'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_io.h-104',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '115' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '11500' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '102',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'proto',
                                                            'offset' => '0',
                                                            'type' => '11401'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '129'
                                                          }
                                                 },
                                       'Name' => 'union odp_pktin_hash_proto_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '11535' => {
                                       'BaseType' => '11500',
                                       'Header' => 'packet_io.h',
                                       'Line' => '121',
                                       'Name' => 'odp_pktin_hash_proto_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '11546' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '126',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PKTIO_OP_MT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PKTIO_OP_MT_UNSAFE',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_pktio_op_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '11571' => {
                                       'BaseType' => '11546',
                                       'Header' => 'packet_io.h',
                                       'Line' => '142',
                                       'Name' => 'odp_pktio_op_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '11582' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '147',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'op_mode',
                                                            'offset' => '0',
                                                            'type' => '11571'
                                                          },
                                                   '1' => {
                                                            'name' => 'hash_enable',
                                                            'offset' => '4',
                                                            'type' => '7096'
                                                          },
                                                   '2' => {
                                                            'name' => 'hash_proto',
                                                            'offset' => '8',
                                                            'type' => '11535'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_queues',
                                                            'offset' => '12',
                                                            'type' => '80'
                                                          },
                                                   '4' => {
                                                            'name' => 'queue_param',
                                                            'offset' => '16',
                                                            'type' => '8180'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktin_queue_param_t',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '11655' => {
                                       'BaseType' => '11582',
                                       'Header' => 'packet_io.h',
                                       'Line' => '176',
                                       'Name' => 'odp_pktin_queue_param_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '11666' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '184',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'op_mode',
                                                            'offset' => '0',
                                                            'type' => '11571'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_queues',
                                                            'offset' => '4',
                                                            'type' => '80'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktout_queue_param_t',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '11703' => {
                                       'BaseType' => '11666',
                                       'Header' => 'packet_io.h',
                                       'Line' => '196',
                                       'Name' => 'odp_pktout_queue_param_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11714' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in_mode',
                                                            'offset' => '0',
                                                            'type' => '11342'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_mode',
                                                            'offset' => '4',
                                                            'type' => '11390'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_param_t',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '11751' => {
                                       'BaseType' => '11714',
                                       'Header' => 'packet_io.h',
                                       'Line' => '213',
                                       'Name' => 'odp_pktio_param_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11762' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '222',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'promisc_mode',
                                                            'offset' => '0',
                                                            'type' => '129'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_io.h-222',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '11786' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '220',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'op',
                                                            'offset' => '0',
                                                            'type' => '11762'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '129'
                                                          }
                                                 },
                                       'Name' => 'union odp_pktio_set_op_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '11820' => {
                                       'BaseType' => '11786',
                                       'Header' => 'packet_io.h',
                                       'Line' => '230',
                                       'Name' => 'odp_pktio_set_op_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '11831' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '235',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_input_queues',
                                                            'offset' => '0',
                                                            'type' => '80'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_output_queues',
                                                            'offset' => '4',
                                                            'type' => '80'
                                                          },
                                                   '2' => {
                                                            'name' => 'set_op',
                                                            'offset' => '8',
                                                            'type' => '11820'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_capability_t',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '11880' => {
                                       'BaseType' => '11831',
                                       'Header' => 'packet_io.h',
                                       'Line' => '245',
                                       'Name' => 'odp_pktio_capability_t',
                                       'Size' => '12',
                                       'Type' => 'Typedef'
                                     },
                          '11930' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '224',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_NONE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_DATA_SIZE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_KEY_SIZE',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_ICV_CHECK',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_IV_INVALID',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum odp_crypto_alg_err_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '11968' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '236',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_CRYPTO_HW_ERR_NONE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_CRYPTO_HW_ERR_DMA',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_CRYPTO_HW_ERR_BP_DEPLETED',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum odp_crypto_hw_err_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '11979' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '241',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'alg_err',
                                                            'offset' => '0',
                                                            'type' => '11930'
                                                          },
                                                   '1' => {
                                                            'name' => 'hw_err',
                                                            'offset' => '4',
                                                            'type' => '11968'
                                                          }
                                                 },
                                       'Name' => 'struct odp_crypto_compl_status',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '12016' => {
                                       'BaseType' => '11979',
                                       'Header' => 'crypto.h',
                                       'Line' => '244',
                                       'Name' => 'odp_crypto_compl_status_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12027' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '249',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ok',
                                                            'offset' => '0',
                                                            'type' => '7096'
                                                          },
                                                   '1' => {
                                                            'name' => 'ctx',
                                                            'offset' => '8',
                                                            'type' => '2498'
                                                          },
                                                   '2' => {
                                                            'name' => 'pkt',
                                                            'offset' => '16',
                                                            'type' => '7339'
                                                          },
                                                   '3' => {
                                                            'name' => 'cipher_status',
                                                            'offset' => '24',
                                                            'type' => '12016'
                                                          },
                                                   '4' => {
                                                            'name' => 'auth_status',
                                                            'offset' => '32',
                                                            'type' => '12016'
                                                          }
                                                 },
                                       'Name' => 'struct odp_crypto_op_result',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '12099' => {
                                       'BaseType' => '12027',
                                       'Header' => 'crypto.h',
                                       'Line' => '255',
                                       'Name' => 'odp_crypto_op_result_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '12126' => {
                                       'BaseType' => '1397',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '122' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '125951' => {
                                        'Header' => 'packet_io.h',
                                        'Line' => '718',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '1848'
                                                           },
                                                    '1' => {
                                                             'name' => 'pool',
                                                             'offset' => '8',
                                                             'type' => '1586'
                                                           },
                                                    '2' => {
                                                             'name' => 'param',
                                                             'offset' => '16',
                                                             'type' => '11751'
                                                           }
                                                  },
                                        'Name' => 'struct odp_pktio_info_t',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '126004' => {
                                        'BaseType' => '125951',
                                        'Header' => 'packet_io.h',
                                        'Line' => '722',
                                        'Name' => 'odp_pktio_info_t',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '129' => {
                                     'BaseType' => '80',
                                     'Header' => 'stdint.h',
                                     'Line' => '51',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '13197' => {
                                       'Header' => 'spinlock_types.h',
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'lock',
                                                            'offset' => '0',
                                                            'type' => '122'
                                                          }
                                                 },
                                       'Name' => 'struct odp_spinlock_s',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '13222' => {
                                       'BaseType' => '13197',
                                       'Header' => 'spinlock_types.h',
                                       'Line' => '28',
                                       'Name' => 'odp_spinlock_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '1344' => {
                                      'BaseType' => '122',
                                      'Name' => 'char*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1368' => {
                                      'BaseType' => '1374',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1374' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '1375' => {
                                      'BaseType' => '45',
                                      'Header' => 'stdint.h',
                                      'Line' => '36',
                                      'Name' => 'int8_t',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '139175' => {
                                        'BaseType' => '139181',
                                        'Name' => 'odp_pktio_param_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '139181' => {
                                        'BaseType' => '11751',
                                        'Name' => 'odp_pktio_param_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '1397' => {
                                      'BaseType' => '52',
                                      'Header' => 'stdint.h',
                                      'Line' => '48',
                                      'Name' => 'uint8_t',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '140' => {
                                     'Header' => 'atomic.h',
                                     'Line' => '579',
                                     'Memb' => {
                                                 '0' => {
                                                          'bitfield' => '1',
                                                          'name' => 'init',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        },
                                                 '1' => {
                                                          'bitfield' => '1',
                                                          'name' => 'load',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        },
                                                 '10' => {
                                                           'bitfield' => '1',
                                                           'name' => 'dec',
                                                           'offset' => '0',
                                                           'type' => '129'
                                                         },
                                                 '11' => {
                                                           'bitfield' => '1',
                                                           'name' => 'min',
                                                           'offset' => '0',
                                                           'type' => '129'
                                                         },
                                                 '12' => {
                                                           'bitfield' => '1',
                                                           'name' => 'max',
                                                           'offset' => '0',
                                                           'type' => '129'
                                                         },
                                                 '13' => {
                                                           'bitfield' => '1',
                                                           'name' => 'cas',
                                                           'offset' => '0',
                                                           'type' => '129'
                                                         },
                                                 '14' => {
                                                           'bitfield' => '1',
                                                           'name' => 'xchg',
                                                           'offset' => '0',
                                                           'type' => '129'
                                                         },
                                                 '2' => {
                                                          'bitfield' => '1',
                                                          'name' => 'store',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        },
                                                 '3' => {
                                                          'bitfield' => '1',
                                                          'name' => 'fetch_add',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        },
                                                 '4' => {
                                                          'bitfield' => '1',
                                                          'name' => 'add',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        },
                                                 '5' => {
                                                          'bitfield' => '1',
                                                          'name' => 'fetch_sub',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        },
                                                 '6' => {
                                                          'bitfield' => '1',
                                                          'name' => 'sub',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        },
                                                 '7' => {
                                                          'bitfield' => '1',
                                                          'name' => 'fetch_inc',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        },
                                                 '8' => {
                                                          'bitfield' => '1',
                                                          'name' => 'inc',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        },
                                                 '9' => {
                                                          'bitfield' => '1',
                                                          'name' => 'fetch_dec',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        }
                                               },
                                     'Name' => 'anon-struct-atomic.h-579',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '1419' => {
                                      'BaseType' => '108',
                                      'Header' => 'stdint.h',
                                      'Line' => '55',
                                      'Name' => 'uint64_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '141941' => {
                                        'BaseType' => '11751',
                                        'Name' => 'odp_pktio_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '142067' => {
                                        'BaseType' => '11655',
                                        'Name' => 'odp_pktin_queue_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '142118' => {
                                        'BaseType' => '11703',
                                        'Name' => 'odp_pktout_queue_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '142411' => {
                                        'BaseType' => '126004',
                                        'Name' => 'odp_pktio_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1441' => {
                                      'Header' => 'event_types.h',
                                      'Line' => '29',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '1397'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_types.h-29',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '145243' => {
                                        'BaseType' => '7511',
                                        'Name' => 'odp_queue_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '145490' => {
                                        'BaseType' => '7431',
                                        'Name' => 'odp_pktin_queue_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '145978' => {
                                        'BaseType' => '7479',
                                        'Name' => 'odp_pktout_queue_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1462' => {
                                      'BaseType' => '1473',
                                      'Header' => 'event_types.h',
                                      'Line' => '29',
                                      'Name' => 'odp_event_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1473' => {
                                      'BaseType' => '1441',
                                      'Name' => 'anon-struct-event_types.h-29*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1479' => {
                                      'Header' => 'event_types.h',
                                      'Line' => '36',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ODP_EVENT_BUFFER',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'ODP_EVENT_PACKET',
                                                           'value' => '2'
                                                         },
                                                  '2' => {
                                                           'name' => 'ODP_EVENT_TIMEOUT',
                                                           'value' => '3'
                                                         },
                                                  '3' => {
                                                           'name' => 'ODP_EVENT_CRYPTO_COMPL',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum odp_event_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '1516' => {
                                      'BaseType' => '1479',
                                      'Header' => 'event_types.h',
                                      'Line' => '41',
                                      'Name' => 'odp_event_type_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '152085' => {
                                        'BaseType' => '8180',
                                        'Name' => 'odp_queue_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '152231' => {
                                        'BaseType' => '152237',
                                        'Name' => 'odp_queue_param_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '152237' => {
                                        'BaseType' => '8180',
                                        'Name' => 'odp_queue_param_t const',
                                        'Size' => '40',
                                        'Type' => 'Const'
                                      },
                          '1527' => {
                                      'Header' => 'buffer_types.h',
                                      'Line' => '24',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '1397'
                                                         }
                                                },
                                      'Name' => 'anon-struct-buffer_types.h-24',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '1548' => {
                                      'BaseType' => '1559',
                                      'Header' => 'buffer_types.h',
                                      'Line' => '24',
                                      'Name' => 'odp_buffer_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1559' => {
                                      'BaseType' => '1527',
                                      'Name' => 'anon-struct-buffer_types.h-24*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1565' => {
                                      'Header' => 'pool_types.h',
                                      'Line' => '29',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '1397'
                                                         }
                                                },
                                      'Name' => 'anon-struct-pool_types.h-29',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '1586' => {
                                      'BaseType' => '1597',
                                      'Header' => 'pool_types.h',
                                      'Line' => '29',
                                      'Name' => 'odp_pool_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1597' => {
                                      'BaseType' => '1565',
                                      'Name' => 'anon-struct-pool_types.h-29*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1603' => {
                                      'Header' => 'shared_memory_types.h',
                                      'Line' => '29',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '1397'
                                                         }
                                                },
                                      'Name' => 'anon-struct-shared_memory_types.h-29',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '1624' => {
                                      'BaseType' => '1635',
                                      'Header' => 'shared_memory_types.h',
                                      'Line' => '29',
                                      'Name' => 'odp_shm_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1635' => {
                                      'BaseType' => '1603',
                                      'Name' => 'anon-struct-shared_memory_types.h-29*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1641' => {
                                      'Header' => 'pool.h',
                                      'Line' => '54',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'num',
                                                           'offset' => '0',
                                                           'type' => '129'
                                                         },
                                                  '1' => {
                                                           'name' => 'size',
                                                           'offset' => '4',
                                                           'type' => '129'
                                                         },
                                                  '2' => {
                                                           'name' => 'align',
                                                           'offset' => '8',
                                                           'type' => '129'
                                                         }
                                                },
                                      'Name' => 'anon-struct-pool.h-54',
                                      'Size' => '12',
                                      'Type' => 'Struct'
                                    },
                          '1686' => {
                                      'Header' => 'pool.h',
                                      'Line' => '67',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'num',
                                                           'offset' => '0',
                                                           'type' => '129'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '4',
                                                           'type' => '129'
                                                         },
                                                  '2' => {
                                                           'name' => 'seg_len',
                                                           'offset' => '8',
                                                           'type' => '129'
                                                         },
                                                  '3' => {
                                                           'name' => 'uarea_size',
                                                           'offset' => '12',
                                                           'type' => '129'
                                                         }
                                                },
                                      'Name' => 'anon-struct-pool.h-67',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '17105' => {
                                       'BaseType' => '11294',
                                       'Name' => 'odp_pktio_stats_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17142' => {
                                       'BaseType' => '7339',
                                       'Name' => 'odp_packet_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17247' => {
                                       'BaseType' => '11880',
                                       'Name' => 'odp_pktio_capability_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17279' => {
                                       'BaseType' => '17285',
                                       'Name' => 'odp_pktin_queue_param_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17285' => {
                                       'BaseType' => '11655',
                                       'Name' => 'odp_pktin_queue_param_t const',
                                       'Size' => '56',
                                       'Type' => 'Const'
                                     },
                          '17316' => {
                                       'BaseType' => '17322',
                                       'Name' => 'odp_pktout_queue_param_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17322' => {
                                       'BaseType' => '11703',
                                       'Name' => 'odp_pktout_queue_param_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '1743' => {
                                      'Header' => 'pool.h',
                                      'Line' => '88',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'num',
                                                           'offset' => '0',
                                                           'type' => '129'
                                                         }
                                                },
                                      'Name' => 'anon-struct-pool.h-88',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '1764' => {
                                      'Header' => 'pool.h',
                                      'Line' => '53',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'buf',
                                                           'offset' => '0',
                                                           'type' => '1641'
                                                         },
                                                  '1' => {
                                                           'name' => 'pkt',
                                                           'offset' => '0',
                                                           'type' => '1686'
                                                         },
                                                  '2' => {
                                                           'name' => 'tmo',
                                                           'offset' => '0',
                                                           'type' => '1743'
                                                         }
                                                },
                                      'Name' => 'anon-union-pool.h-53',
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '1806' => {
                                      'Header' => 'pool.h',
                                      'Line' => '49',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '73'
                                                         },
                                                  '1' => {
                                                           'name' => 'unnamed0',
                                                           'offset' => '4',
                                                           'type' => '1764'
                                                         }
                                                },
                                      'Name' => 'struct odp_pool_param_t',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '1837' => {
                                      'BaseType' => '1806',
                                      'Header' => 'pool.h',
                                      'Line' => '93',
                                      'Name' => 'odp_pool_param_t',
                                      'Size' => '20',
                                      'Type' => 'Typedef'
                                    },
                          '1848' => {
                                      'BaseType' => '1854',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1854' => {
                                      'BaseType' => '122',
                                      'Name' => 'char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '1859' => {
                                      'Header' => 'atomic_types.h',
                                      'Line' => '28',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'v',
                                                           'offset' => '0',
                                                           'type' => '1419'
                                                         }
                                                },
                                      'Name' => 'struct odp_atomic_u64_s',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '1905' => {
                                      'BaseType' => '1859',
                                      'Header' => 'atomic_types.h',
                                      'Line' => '81',
                                      'Name' => 'odp_atomic_u64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '20536' => {
                                       'BaseType' => '20542',
                                       'Name' => 'odp_pmr_match_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20542' => {
                                       'BaseType' => '7872',
                                       'Name' => 'odp_pmr_match_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '21787' => {
                                       'BaseType' => '7647',
                                       'Name' => 'odp_cls_cos_param_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2498' => {
                                      'BaseType' => '1',
                                      'Name' => 'void*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '25550' => {
                                       'BaseType' => '7252',
                                       'Name' => 'odp_cos_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2591' => {
                                      'BaseType' => '73',
                                      'Header' => 'types.h',
                                      'Line' => '133',
                                      'Name' => '__pid_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '270364' => {
                                        'Header' => 'pool.h',
                                        'Line' => '153',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '1848'
                                                           },
                                                    '1' => {
                                                             'name' => 'params',
                                                             'offset' => '8',
                                                             'type' => '1837'
                                                           }
                                                  },
                                        'Name' => 'struct odp_pool_info_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '270412' => {
                                        'BaseType' => '270364',
                                        'Header' => 'pool.h',
                                        'Line' => '156',
                                        'Name' => 'odp_pool_info_t',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '2724' => {
                                      'Header' => 'ticketlock_types.h',
                                      'Line' => '24',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next_ticket',
                                                           'offset' => '0',
                                                           'type' => '656'
                                                         },
                                                  '1' => {
                                                           'name' => 'cur_ticket',
                                                           'offset' => '4',
                                                           'type' => '656'
                                                         }
                                                },
                                      'Name' => 'struct odp_ticketlock_s',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '274020' => {
                                        'BaseType' => '129',
                                        'Header' => 'timer_types.h',
                                        'Line' => '31',
                                        'Name' => 'odp_timer_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '2761' => {
                                      'BaseType' => '2724',
                                      'Header' => 'ticketlock_types.h',
                                      'Line' => '29',
                                      'Name' => 'odp_ticketlock_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '279580' => {
                                        'BaseType' => '1837',
                                        'Name' => 'odp_pool_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '279967' => {
                                        'BaseType' => '270412',
                                        'Name' => 'odp_pool_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '286535' => {
                                        'Header' => 'queue.h',
                                        'Line' => '351',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '1848'
                                                           },
                                                    '1' => {
                                                             'name' => 'param',
                                                             'offset' => '8',
                                                             'type' => '8180'
                                                           }
                                                  },
                                        'Name' => 'struct odp_queue_info_t',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '286586' => {
                                        'BaseType' => '286535',
                                        'Header' => 'queue.h',
                                        'Line' => '354',
                                        'Name' => 'odp_queue_info_t',
                                        'Size' => '48',
                                        'Type' => 'Typedef'
                                      },
                          '290140' => {
                                        'BaseType' => '1419',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '115',
                                        'Name' => 'odp_tm_handle_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '290151' => {
                                        'BaseType' => '290140',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '127',
                                        'Name' => 'odp_tm_queue_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '296207' => {
                                        'BaseType' => '296213',
                                        'Name' => 'odp_event_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '296213' => {
                                        'BaseType' => '1462',
                                        'Name' => 'odp_event_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '300683' => {
                                        'BaseType' => '1462',
                                        'Name' => 'odp_event_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '305204' => {
                                        'BaseType' => '286586',
                                        'Name' => 'odp_queue_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '306036' => {
                                        'Header' => 'rwlock_types.h',
                                        'Line' => '24',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cnt',
                                                             'offset' => '0',
                                                             'type' => '656'
                                                           }
                                                  },
                                        'Name' => 'struct odp_rwlock_s',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '306061' => {
                                        'BaseType' => '306036',
                                        'Header' => 'rwlock_types.h',
                                        'Line' => '31',
                                        'Name' => 'odp_rwlock_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '306365' => {
                                        'BaseType' => '306061',
                                        'Name' => 'odp_rwlock_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '307357' => {
                                        'Header' => 'rwlock_recursive_types.h',
                                        'Line' => '25',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'lock',
                                                             'offset' => '0',
                                                             'type' => '306061'
                                                           },
                                                    '1' => {
                                                             'name' => 'wr_owner',
                                                             'offset' => '4',
                                                             'type' => '73'
                                                           },
                                                    '2' => {
                                                             'name' => 'wr_cnt',
                                                             'offset' => '8',
                                                             'type' => '129'
                                                           },
                                                    '3' => {
                                                             'name' => 'rd_cnt',
                                                             'offset' => '12',
                                                             'type' => '307418'
                                                           }
                                                  },
                                        'Name' => 'struct odp_rwlock_recursive_s',
                                        'Size' => '140',
                                        'Type' => 'Struct'
                                      },
                          '307418' => {
                                        'BaseType' => '1397',
                                        'Name' => 'uint8_t[128]',
                                        'Size' => '128',
                                        'Type' => 'Array'
                                      },
                          '307434' => {
                                        'BaseType' => '307357',
                                        'Header' => 'rwlock_recursive_types.h',
                                        'Line' => '32',
                                        'Name' => 'odp_rwlock_recursive_t',
                                        'Size' => '140',
                                        'Type' => 'Typedef'
                                      },
                          '307611' => {
                                        'BaseType' => '307434',
                                        'Name' => 'odp_rwlock_recursive_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '308562' => {
                                        'BaseType' => '115',
                                        'Header' => 'stdint.h',
                                        'Line' => '40',
                                        'Name' => 'int64_t',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '309228' => {
                                        'Header' => 'thrmask_types.h',
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'm',
                                                             'offset' => '0',
                                                             'type' => '4126'
                                                           }
                                                  },
                                        'Name' => 'struct odp_thrmask_t',
                                        'Size' => '128',
                                        'Type' => 'Struct'
                                      },
                          '309251' => {
                                        'BaseType' => '309228',
                                        'Header' => 'thrmask_types.h',
                                        'Line' => '38',
                                        'Name' => 'odp_thrmask_t',
                                        'Size' => '128',
                                        'Type' => 'Typedef'
                                      },
                          '312571' => {
                                        'Header' => 'time_types.h',
                                        'Line' => '28',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tv_sec',
                                                             'offset' => '0',
                                                             'type' => '308562'
                                                           },
                                                    '1' => {
                                                             'name' => 'tv_nsec',
                                                             'offset' => '8',
                                                             'type' => '308562'
                                                           }
                                                  },
                                        'Name' => 'struct odp_time_t',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '312608' => {
                                        'BaseType' => '312571',
                                        'Header' => 'time_types.h',
                                        'Line' => '31',
                                        'Name' => 'odp_time_t',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '317313' => {
                                        'BaseType' => '309251',
                                        'Name' => 'odp_thrmask_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '32425' => {
                                       'BaseType' => '13222',
                                       'Name' => 'odp_spinlock_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '324803' => {
                                        'BaseType' => '324809',
                                        'Name' => 'odp_thrmask_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '324809' => {
                                        'BaseType' => '309251',
                                        'Name' => 'odp_thrmask_t const',
                                        'Size' => '128',
                                        'Type' => 'Const'
                                      },
                          '327594' => {
                                        'Header' => 'shared_memory.h',
                                        'Line' => '56',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '1848'
                                                           },
                                                    '1' => {
                                                             'name' => 'addr',
                                                             'offset' => '8',
                                                             'type' => '2498'
                                                           },
                                                    '2' => {
                                                             'name' => 'size',
                                                             'offset' => '16',
                                                             'type' => '1419'
                                                           },
                                                    '3' => {
                                                             'name' => 'page_size',
                                                             'offset' => '24',
                                                             'type' => '1419'
                                                           },
                                                    '4' => {
                                                             'name' => 'flags',
                                                             'offset' => '32',
                                                             'type' => '129'
                                                           }
                                                  },
                                        'Name' => 'struct odp_shm_info_t',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '327667' => {
                                        'BaseType' => '327594',
                                        'Header' => 'shared_memory.h',
                                        'Line' => '62',
                                        'Name' => 'odp_shm_info_t',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '331418' => {
                                        'BaseType' => '327667',
                                        'Name' => 'odp_shm_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '33303' => {
                                       'BaseType' => '73',
                                       'Header' => 'types.h',
                                       'Line' => '196',
                                       'Name' => 'int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '33479' => {
                                       'Header' => 'init.h',
                                       'Line' => '117',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'num_worker',
                                                            'offset' => '0',
                                                            'type' => '73'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_control',
                                                            'offset' => '4',
                                                            'type' => '73'
                                                          },
                                                   '2' => {
                                                            'name' => 'worker_cpus',
                                                            'offset' => '8',
                                                            'type' => '33564'
                                                          },
                                                   '3' => {
                                                            'name' => 'control_cpus',
                                                            'offset' => '16',
                                                            'type' => '33564'
                                                          },
                                                   '4' => {
                                                            'name' => 'log_fn',
                                                            'offset' => '24',
                                                            'type' => '4187'
                                                          },
                                                   '5' => {
                                                            'name' => 'abort_fn',
                                                            'offset' => '32',
                                                            'type' => '4225'
                                                          }
                                                 },
                                       'Name' => 'struct odp_init_t',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '33564' => {
                                       'BaseType' => '33570',
                                       'Name' => 'odp_cpumask_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '33570' => {
                                       'BaseType' => '4126',
                                       'Name' => 'odp_cpumask_t const',
                                       'Size' => '128',
                                       'Type' => 'Const'
                                     },
                          '33575' => {
                                       'BaseType' => '33479',
                                       'Header' => 'init.h',
                                       'Line' => '156',
                                       'Name' => 'odp_init_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '336111' => {
                                        'Header' => 'spinlock_recursive_types.h',
                                        'Line' => '24',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'lock',
                                                             'offset' => '0',
                                                             'type' => '13222'
                                                           },
                                                    '1' => {
                                                             'name' => 'owner',
                                                             'offset' => '4',
                                                             'type' => '73'
                                                           },
                                                    '2' => {
                                                             'name' => 'cnt',
                                                             'offset' => '8',
                                                             'type' => '129'
                                                           }
                                                  },
                                        'Name' => 'struct odp_spinlock_recursive_s',
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '336160' => {
                                        'BaseType' => '336111',
                                        'Header' => 'spinlock_recursive_types.h',
                                        'Line' => '30',
                                        'Name' => 'odp_spinlock_recursive_t',
                                        'Size' => '12',
                                        'Type' => 'Typedef'
                                      },
                          '336236' => {
                                        'BaseType' => '336160',
                                        'Name' => 'odp_spinlock_recursive_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '3441' => {
                                      'BaseType' => '122',
                                      'Name' => 'char[32]',
                                      'Size' => '32',
                                      'Type' => 'Array'
                                    },
                          '3457' => {
                                      'BaseType' => '1397',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '34645' => {
                                       'BaseType' => '4126',
                                       'Name' => 'odp_cpumask_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '352439' => {
                                        'BaseType' => '2498',
                                        'Header' => 'types.h',
                                        'Line' => '150',
                                        'Name' => '__timer_t',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '352533' => {
                                        'BaseType' => '352439',
                                        'Header' => 'time.h',
                                        'Line' => '103',
                                        'Name' => 'timer_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '352673' => {
                                        'BaseType' => '108',
                                        'Header' => 'pthreadtypes.h',
                                        'Line' => '60',
                                        'Name' => 'pthread_t',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '356698' => {
                                        'BaseType' => '356709',
                                        'Header' => 'timer_types.h',
                                        'Line' => '27',
                                        'Name' => 'odp_timer_pool_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '356709' => {
                                        'BaseType' => '356715',
                                        'Name' => 'struct odp_timer_pool_s*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '356715' => {
                                        'Line' => '158',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cur_tick',
                                                             'offset' => '0',
                                                             'type' => '1905'
                                                           },
                                                    '1' => {
                                                             'name' => 'min_rel_tck',
                                                             'offset' => '8',
                                                             'type' => '1419'
                                                           },
                                                    '10' => {
                                                              'name' => 'param',
                                                              'offset' => '64',
                                                              'type' => '357112'
                                                            },
                                                    '11' => {
                                                              'name' => 'name',
                                                              'offset' => '104',
                                                              'type' => '3441'
                                                            },
                                                    '12' => {
                                                              'name' => 'shm',
                                                              'offset' => '136',
                                                              'type' => '1624'
                                                            },
                                                    '13' => {
                                                              'name' => 'timerid',
                                                              'offset' => '144',
                                                              'type' => '352533'
                                                            },
                                                    '14' => {
                                                              'name' => 'notify_overrun',
                                                              'offset' => '152',
                                                              'type' => '73'
                                                            },
                                                    '15' => {
                                                              'name' => 'timer_thread',
                                                              'offset' => '160',
                                                              'type' => '352673'
                                                            },
                                                    '16' => {
                                                              'name' => 'timer_thread_id',
                                                              'offset' => '168',
                                                              'type' => '4031'
                                                            },
                                                    '17' => {
                                                              'name' => 'timer_thread_exit',
                                                              'offset' => '172',
                                                              'type' => '73'
                                                            },
                                                    '2' => {
                                                             'name' => 'max_rel_tck',
                                                             'offset' => '16',
                                                             'type' => '1419'
                                                           },
                                                    '3' => {
                                                             'name' => 'tick_buf',
                                                             'offset' => '24',
                                                             'type' => '357355'
                                                           },
                                                    '4' => {
                                                             'name' => 'timers',
                                                             'offset' => '32',
                                                             'type' => '357361'
                                                           },
                                                    '5' => {
                                                             'name' => 'high_wm',
                                                             'offset' => '40',
                                                             'type' => '656'
                                                           },
                                                    '6' => {
                                                             'name' => 'lock',
                                                             'offset' => '44',
                                                             'type' => '13222'
                                                           },
                                                    '7' => {
                                                             'name' => 'num_alloc',
                                                             'offset' => '48',
                                                             'type' => '129'
                                                           },
                                                    '8' => {
                                                             'name' => 'first_free',
                                                             'offset' => '52',
                                                             'type' => '129'
                                                           },
                                                    '9' => {
                                                             'name' => 'tp_idx',
                                                             'offset' => '56',
                                                             'type' => '129'
                                                           }
                                                  },
                                        'Name' => 'struct odp_timer_pool_s',
                                        'PrivateABI' => 1,
                                        'Size' => '176',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Struct'
                                      },
                          '356987' => {
                                        'Header' => 'timer.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_CLOCK_CPU',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_CLOCK_EXT',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum odp_timer_clk_src_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '357112' => {
                                        'Header' => 'timer.h',
                                        'Line' => '106',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'res_ns',
                                                             'offset' => '0',
                                                             'type' => '1419'
                                                           },
                                                    '1' => {
                                                             'name' => 'min_tmo',
                                                             'offset' => '8',
                                                             'type' => '1419'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_tmo',
                                                             'offset' => '16',
                                                             'type' => '1419'
                                                           },
                                                    '3' => {
                                                             'name' => 'num_timers',
                                                             'offset' => '24',
                                                             'type' => '129'
                                                           },
                                                    '4' => {
                                                             'name' => 'priv',
                                                             'offset' => '28',
                                                             'type' => '73'
                                                           },
                                                    '5' => {
                                                             'name' => 'clk_src',
                                                             'offset' => '32',
                                                             'type' => '356987'
                                                           }
                                                  },
                                        'Name' => 'struct odp_timer_pool_param_t',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '357180' => {
                                        'Header' => 'timer.h',
                                        'Line' => '179',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'param',
                                                             'offset' => '0',
                                                             'type' => '357112'
                                                           },
                                                    '1' => {
                                                             'name' => 'cur_timers',
                                                             'offset' => '40',
                                                             'type' => '129'
                                                           },
                                                    '2' => {
                                                             'name' => 'hwm_timers',
                                                             'offset' => '44',
                                                             'type' => '129'
                                                           },
                                                    '3' => {
                                                             'name' => 'name',
                                                             'offset' => '48',
                                                             'type' => '1848'
                                                           }
                                                  },
                                        'Name' => 'struct odp_timer_pool_info_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '357259' => {
                                        'Line' => '98',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'exp_tck',
                                                             'offset' => '0',
                                                             'type' => '1905'
                                                           },
                                                    '1' => {
                                                             'name' => 'tmo_buf',
                                                             'offset' => '8',
                                                             'type' => '1548'
                                                           }
                                                  },
                                        'Name' => 'struct tick_buf_s',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Struct'
                                      },
                          '357296' => {
                                        'BaseType' => '357259',
                                        'Line' => '104',
                                        'Name' => 'tick_buf_t',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Typedef'
                                      },
                          '357307' => {
                                        'Line' => '112',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'user_ptr',
                                                             'offset' => '0',
                                                             'type' => '2498'
                                                           },
                                                    '1' => {
                                                             'name' => 'queue',
                                                             'offset' => '8',
                                                             'type' => '7511'
                                                           }
                                                  },
                                        'Name' => 'struct odp_timer_s',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Struct'
                                      },
                          '357344' => {
                                        'BaseType' => '357307',
                                        'Line' => '115',
                                        'Name' => 'odp_timer',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Typedef'
                                      },
                          '357355' => {
                                        'BaseType' => '357296',
                                        'Name' => 'tick_buf_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '357361' => {
                                        'BaseType' => '357344',
                                        'Name' => 'odp_timer*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '363375' => {
                                        'BaseType' => '363381',
                                        'Name' => 'odp_timer_pool_param_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '363381' => {
                                        'BaseType' => '357112',
                                        'Name' => 'odp_timer_pool_param_t const',
                                        'Size' => '40',
                                        'Type' => 'Const'
                                      },
                          '363662' => {
                                        'BaseType' => '357180',
                                        'Name' => 'odp_timer_pool_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '369996' => {
                                        'BaseType' => '7052',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '110',
                                        'Name' => 'odp_tm_percent_t',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '370739' => {
                                        'BaseType' => '129',
                                        'Name' => 'uint32_t[8]',
                                        'Size' => '32',
                                        'Type' => 'Array'
                                      },
                          '370755' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '267',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_tm_queues',
                                                             'offset' => '0',
                                                             'type' => '129'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_fanin_per_level',
                                                             'offset' => '4',
                                                             'type' => '370739'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_priority',
                                                             'offset' => '36',
                                                             'type' => '1397'
                                                           },
                                                    '3' => {
                                                             'name' => 'max_levels',
                                                             'offset' => '37',
                                                             'type' => '1397'
                                                           },
                                                    '4' => {
                                                             'name' => 'tm_queue_shaper_supported',
                                                             'offset' => '40',
                                                             'type' => '7096'
                                                           },
                                                    '5' => {
                                                             'name' => 'tm_node_shaper_supported',
                                                             'offset' => '44',
                                                             'type' => '7096'
                                                           },
                                                    '6' => {
                                                             'name' => 'red_supported',
                                                             'offset' => '48',
                                                             'type' => '7096'
                                                           },
                                                    '7' => {
                                                             'name' => 'hierarchical_red_supported',
                                                             'offset' => '52',
                                                             'type' => '7096'
                                                           },
                                                    '8' => {
                                                             'name' => 'weights_supported',
                                                             'offset' => '56',
                                                             'type' => '7096'
                                                           },
                                                    '9' => {
                                                             'name' => 'fair_queuing_supported',
                                                             'offset' => '60',
                                                             'type' => '7096'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_capability_t',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '370767' => {
                                        'BaseType' => '370779',
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '274',
                                        'Name' => 'odp_tm_egress_fcn_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '370779' => {
                                        'Name' => 'void(*)(odp_packet_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '7339'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '370818' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '285',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_TM_EGRESS_PKT_IO',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_TM_EGRESS_FN',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum odp_tm_egress_kind_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '370830' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '294',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pktout',
                                                             'offset' => '0',
                                                             'type' => '7479'
                                                           },
                                                    '1' => {
                                                             'name' => 'egress_fcn',
                                                             'offset' => '0',
                                                             'type' => '370767'
                                                           }
                                                  },
                                        'Name' => 'anon-union-traffic_mngr.h-294',
                                        'Size' => '16',
                                        'Type' => 'Union'
                                      },
                          '370893' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '298',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'egress_kind',
                                                             'offset' => '0',
                                                             'type' => '370818'
                                                           },
                                                    '1' => {
                                                             'name' => 'unnamed0',
                                                             'offset' => '8',
                                                             'type' => '370830'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_egress_t',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '370927' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '543',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_TM_BYTE_BASED_WEIGHTS',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_TM_FRAME_BASED_WEIGHTS',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum odp_tm_sched_mode_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '370939' => {
                                        'BaseType' => '370927',
                                        'Name' => 'odp_tm_sched_mode_t[16]',
                                        'Size' => '64',
                                        'Type' => 'Array'
                                      },
                          '371043' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '773',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'min_threshold',
                                                             'offset' => '0',
                                                             'type' => '369996'
                                                           },
                                                    '1' => {
                                                             'name' => 'med_threshold',
                                                             'offset' => '2',
                                                             'type' => '369996'
                                                           },
                                                    '2' => {
                                                             'name' => 'med_drop_prob',
                                                             'offset' => '4',
                                                             'type' => '369996'
                                                           },
                                                    '3' => {
                                                             'name' => 'max_drop_prob',
                                                             'offset' => '6',
                                                             'type' => '369996'
                                                           },
                                                    '4' => {
                                                             'name' => 'enable_wred',
                                                             'offset' => '8',
                                                             'type' => '7096'
                                                           },
                                                    '5' => {
                                                             'name' => 'use_byte_fullness',
                                                             'offset' => '12',
                                                             'type' => '7096'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_wred_params_t',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '373640' => {
                                        'BaseType' => '371043',
                                        'Name' => 'odp_tm_wred_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '37866' => {
                                       'BaseType' => '37872',
                                       'Name' => 'odp_init_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37872' => {
                                       'BaseType' => '33575',
                                       'Name' => 'odp_init_t const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '382422' => {
                                        'BaseType' => '290140',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '122',
                                        'Name' => 'odp_tm_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '382444' => {
                                        'BaseType' => '290140',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '132',
                                        'Name' => 'odp_tm_node_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '382455' => {
                                        'BaseType' => '290140',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '138',
                                        'Name' => 'odp_tm_shaper_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '382466' => {
                                        'BaseType' => '290140',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '144',
                                        'Name' => 'odp_tm_sched_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '382477' => {
                                        'BaseType' => '290140',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '151',
                                        'Name' => 'odp_tm_threshold_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '382488' => {
                                        'BaseType' => '290140',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '157',
                                        'Name' => 'odp_tm_wred_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '383477' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '310',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'capability',
                                                             'offset' => '0',
                                                             'type' => '370755'
                                                           },
                                                    '1' => {
                                                             'name' => 'egress',
                                                             'offset' => '64',
                                                             'type' => '370893'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_params_t',
                                        'Size' => '88',
                                        'Type' => 'Struct'
                                      },
                          '383617' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '465',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'commit_bps',
                                                             'offset' => '0',
                                                             'type' => '1419'
                                                           },
                                                    '1' => {
                                                             'name' => 'peak_bps',
                                                             'offset' => '8',
                                                             'type' => '1419'
                                                           },
                                                    '2' => {
                                                             'name' => 'commit_burst',
                                                             'offset' => '16',
                                                             'type' => '129'
                                                           },
                                                    '3' => {
                                                             'name' => 'peak_burst',
                                                             'offset' => '20',
                                                             'type' => '129'
                                                           },
                                                    '4' => {
                                                             'name' => 'shaper_len_adjust',
                                                             'offset' => '24',
                                                             'type' => '1375'
                                                           },
                                                    '5' => {
                                                             'name' => 'dual_rate',
                                                             'offset' => '28',
                                                             'type' => '7096'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_shaper_params_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '383731' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '566',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'sched_modes',
                                                             'offset' => '0',
                                                             'type' => '370939'
                                                           },
                                                    '1' => {
                                                             'name' => 'sched_weights',
                                                             'offset' => '64',
                                                             'type' => '12126'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_sched_params_t',
                                        'Size' => '80',
                                        'Type' => 'Struct'
                                      },
                          '383805' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '643',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_pkts',
                                                             'offset' => '0',
                                                             'type' => '1419'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_bytes',
                                                             'offset' => '8',
                                                             'type' => '1419'
                                                           },
                                                    '2' => {
                                                             'name' => 'enable_max_pkts',
                                                             'offset' => '16',
                                                             'type' => '7096'
                                                           },
                                                    '3' => {
                                                             'name' => 'enable_max_bytes',
                                                             'offset' => '20',
                                                             'type' => '7096'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_threshold_params_t',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '383992' => {
                                        'BaseType' => '382488',
                                        'Name' => 'odp_tm_wred_t[3]',
                                        'Size' => '24',
                                        'Type' => 'Array'
                                      },
                          '384008' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '879',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_fanin',
                                                             'offset' => '0',
                                                             'type' => '129'
                                                           },
                                                    '1' => {
                                                             'name' => 'shaper_profile',
                                                             'offset' => '8',
                                                             'type' => '382455'
                                                           },
                                                    '2' => {
                                                             'name' => 'threshold_profile',
                                                             'offset' => '16',
                                                             'type' => '382477'
                                                           },
                                                    '3' => {
                                                             'name' => 'wred_profile',
                                                             'offset' => '24',
                                                             'type' => '383992'
                                                           },
                                                    '4' => {
                                                             'name' => 'level',
                                                             'offset' => '48',
                                                             'type' => '1397'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_node_params_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '384082' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1014',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'shaper_profile',
                                                             'offset' => '0',
                                                             'type' => '382455'
                                                           },
                                                    '1' => {
                                                             'name' => 'threshold_profile',
                                                             'offset' => '8',
                                                             'type' => '382477'
                                                           },
                                                    '2' => {
                                                             'name' => 'wred_profile',
                                                             'offset' => '16',
                                                             'type' => '383992'
                                                           },
                                                    '3' => {
                                                             'name' => 'priority',
                                                             'offset' => '40',
                                                             'type' => '1397'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_queue_params_t',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '384221' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1244',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'total_pkt_cnt',
                                                             'offset' => '0',
                                                             'type' => '1419'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_pkt_cnt',
                                                             'offset' => '8',
                                                             'type' => '1419'
                                                           },
                                                    '2' => {
                                                             'name' => 'total_byte_cnt',
                                                             'offset' => '16',
                                                             'type' => '1419'
                                                           },
                                                    '3' => {
                                                             'name' => 'max_byte_cnt',
                                                             'offset' => '24',
                                                             'type' => '1419'
                                                           },
                                                    '4' => {
                                                             'name' => 'total_pkt_cnt_valid',
                                                             'offset' => '32',
                                                             'type' => '7096'
                                                           },
                                                    '5' => {
                                                             'name' => 'max_pkt_cnt_valid',
                                                             'offset' => '36',
                                                             'type' => '7096'
                                                           },
                                                    '6' => {
                                                             'name' => 'total_byte_cnt_valid',
                                                             'offset' => '40',
                                                             'type' => '7096'
                                                           },
                                                    '7' => {
                                                             'name' => 'max_byte_cnt_valid',
                                                             'offset' => '44',
                                                             'type' => '7096'
                                                           },
                                                    '8' => {
                                                             'name' => 'approx_byte_cnt',
                                                             'offset' => '48',
                                                             'type' => '7096'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_queue_info_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '390' => {
                                     'Header' => 'atomic.h',
                                     'Line' => '577',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'op',
                                                          'offset' => '0',
                                                          'type' => '140'
                                                        },
                                                 '1' => {
                                                          'name' => 'all_bits',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        }
                                               },
                                     'Name' => 'union odp_atomic_op_t',
                                     'Size' => '4',
                                     'Type' => 'Union'
                                   },
                          '393585' => {
                                        'BaseType' => '383731',
                                        'Name' => 'odp_tm_sched_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '394031' => {
                                        'BaseType' => '383617',
                                        'Name' => 'odp_tm_shaper_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '396200' => {
                                        'BaseType' => '384221',
                                        'Name' => 'odp_tm_queue_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '4031' => {
                                      'BaseType' => '2591',
                                      'Header' => 'sched.h',
                                      'Line' => '35',
                                      'Name' => 'pid_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '4042' => {
                                      'BaseType' => '108',
                                      'Header' => 'sched.h',
                                      'Line' => '118',
                                      'Name' => '__cpu_mask',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '40422' => {
                                       'BaseType' => '1419',
                                       'Header' => 'crypto_types.h',
                                       'Line' => '27',
                                       'Name' => 'odp_crypto_session_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '40433' => {
                                       'Header' => 'crypto_types.h',
                                       'Line' => '28',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unused_dummy_var',
                                                            'offset' => '0',
                                                            'type' => '1397'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-crypto_types.h-28',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '40454' => {
                                       'BaseType' => '40465',
                                       'Header' => 'crypto_types.h',
                                       'Line' => '28',
                                       'Name' => 'odp_crypto_compl_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '40465' => {
                                       'BaseType' => '40433',
                                       'Name' => 'anon-struct-crypto_types.h-28*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40705' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '50',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_CRYPTO_SYNC',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_CRYPTO_ASYNC',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_crypto_op_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '407123' => {
                                        'BaseType' => '370755',
                                        'Name' => 'odp_tm_capability_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '407218' => {
                                        'BaseType' => '383477',
                                        'Name' => 'odp_tm_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '40737' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '60',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_CRYPTO_OP_ENCODE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_CRYPTO_OP_DECODE',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_crypto_op_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '4074' => {
                                      'BaseType' => '4042',
                                      'Name' => '__cpu_mask[16]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '40787' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '76',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_CIPHER_ALG_NULL',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_CIPHER_ALG_DES',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_CIPHER_ALG_3DES_CBC',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_CIPHER_ALG_AES128_CBC',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'ODP_CIPHER_ALG_AES128_GCM',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum odp_cipher_alg_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '40831' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '90',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_AUTH_ALG_NULL',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_AUTH_ALG_MD5_96',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_AUTH_ALG_SHA256_128',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_AUTH_ALG_AES128_GCM',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum odp_auth_alg_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '40842' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '95',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data',
                                                            'offset' => '0',
                                                            'type' => '3457'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '129'
                                                          }
                                                 },
                                       'Name' => 'struct odp_crypto_key',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '40885' => {
                                       'BaseType' => '40842',
                                       'Header' => 'crypto.h',
                                       'Line' => '98',
                                       'Name' => 'odp_crypto_key_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '40896' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '103',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data',
                                                            'offset' => '0',
                                                            'type' => '3457'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '129'
                                                          }
                                                 },
                                       'Name' => 'struct odp_crypto_iv',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '4090' => {
                                      'Header' => 'sched.h',
                                      'Line' => '128',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__bits',
                                                           'offset' => '0',
                                                           'type' => '4074'
                                                         }
                                                },
                                      'Name' => 'struct cpu_set_t',
                                      'PrivateABI' => 1,
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '40933' => {
                                       'BaseType' => '40896',
                                       'Header' => 'crypto.h',
                                       'Line' => '106',
                                       'Name' => 'odp_crypto_iv_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '40944' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '111',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'offset',
                                                            'offset' => '0',
                                                            'type' => '129'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '4',
                                                            'type' => '129'
                                                          }
                                                 },
                                       'Name' => 'struct odp_crypto_data_range',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '40981' => {
                                       'BaseType' => '40944',
                                       'Header' => 'crypto.h',
                                       'Line' => '114',
                                       'Name' => 'odp_crypto_data_range_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '40992' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '121',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'op',
                                                            'offset' => '0',
                                                            'type' => '40737'
                                                          },
                                                   '1' => {
                                                            'name' => 'auth_cipher_text',
                                                            'offset' => '4',
                                                            'type' => '7096'
                                                          },
                                                   '2' => {
                                                            'name' => 'pref_mode',
                                                            'offset' => '8',
                                                            'type' => '40705'
                                                          },
                                                   '3' => {
                                                            'name' => 'cipher_alg',
                                                            'offset' => '12',
                                                            'type' => '40787'
                                                          },
                                                   '4' => {
                                                            'name' => 'cipher_key',
                                                            'offset' => '16',
                                                            'type' => '40885'
                                                          },
                                                   '5' => {
                                                            'name' => 'iv',
                                                            'offset' => '32',
                                                            'type' => '40933'
                                                          },
                                                   '6' => {
                                                            'name' => 'auth_alg',
                                                            'offset' => '48',
                                                            'type' => '40831'
                                                          },
                                                   '7' => {
                                                            'name' => 'auth_key',
                                                            'offset' => '56',
                                                            'type' => '40885'
                                                          },
                                                   '8' => {
                                                            'name' => 'compl_queue',
                                                            'offset' => '72',
                                                            'type' => '7511'
                                                          },
                                                   '9' => {
                                                            'name' => 'output_pool',
                                                            'offset' => '80',
                                                            'type' => '1586'
                                                          }
                                                 },
                                       'Name' => 'struct odp_crypto_session_params',
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '4101' => {
                                      'Header' => 'cpumask_types.h',
                                      'Line' => '36',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'set',
                                                           'offset' => '0',
                                                           'type' => '4090'
                                                         }
                                                },
                                      'Name' => 'struct odp_cpumask_t',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '410325' => {
                                        'BaseType' => '383805',
                                        'Name' => 'odp_tm_threshold_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '41123' => {
                                       'BaseType' => '40992',
                                       'Header' => 'crypto.h',
                                       'Line' => '132',
                                       'Name' => 'odp_crypto_session_params_t',
                                       'Size' => '88',
                                       'Type' => 'Typedef'
                                     },
                          '41134' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '161',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'session',
                                                            'offset' => '0',
                                                            'type' => '40422'
                                                          },
                                                   '1' => {
                                                            'name' => 'ctx',
                                                            'offset' => '8',
                                                            'type' => '2498'
                                                          },
                                                   '2' => {
                                                            'name' => 'pkt',
                                                            'offset' => '16',
                                                            'type' => '7339'
                                                          },
                                                   '3' => {
                                                            'name' => 'out_pkt',
                                                            'offset' => '24',
                                                            'type' => '7339'
                                                          },
                                                   '4' => {
                                                            'name' => 'override_iv_ptr',
                                                            'offset' => '32',
                                                            'type' => '3457'
                                                          },
                                                   '5' => {
                                                            'name' => 'hash_result_offset',
                                                            'offset' => '40',
                                                            'type' => '129'
                                                          },
                                                   '6' => {
                                                            'name' => 'cipher_range',
                                                            'offset' => '44',
                                                            'type' => '40981'
                                                          },
                                                   '7' => {
                                                            'name' => 'auth_range',
                                                            'offset' => '52',
                                                            'type' => '40981'
                                                          }
                                                 },
                                       'Name' => 'struct odp_crypto_op_params',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '411565' => {
                                        'BaseType' => '384008',
                                        'Name' => 'odp_tm_node_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '41243' => {
                                       'BaseType' => '41134',
                                       'Header' => 'crypto.h',
                                       'Line' => '170',
                                       'Name' => 'odp_crypto_op_params_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '4126' => {
                                      'BaseType' => '4101',
                                      'Header' => 'cpumask_types.h',
                                      'Line' => '38',
                                      'Name' => 'odp_cpumask_t',
                                      'Size' => '128',
                                      'Type' => 'Typedef'
                                    },
                          '41287' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '208',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_CRYPTO_SES_CREATE_ERR_NONE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_CRYPTO_SES_CREATE_ERR_ENOMEM',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_CRYPTO_SES_CREATE_ERR_INV_CIPHER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_CRYPTO_SES_CREATE_ERR_INV_AUTH',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum odp_crypto_ses_create_err_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '413508' => {
                                        'BaseType' => '384082',
                                        'Name' => 'odp_tm_queue_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '4176' => {
                                      'Header' => 'init.h',
                                      'Line' => '54',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ODP_LOG_DBG',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ODP_LOG_ERR',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'ODP_LOG_UNIMPLEMENTED',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'ODP_LOG_ABORT',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'ODP_LOG_PRINT',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum odp_log_level_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '4187' => {
                                      'BaseType' => '4198',
                                      'Header' => 'init.h',
                                      'Line' => '103',
                                      'Name' => 'odp_log_func_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4198' => {
                                      'Name' => 'int(*)(odp_log_level_t, char const*, ...)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4176'
                                                          },
                                                   '1' => {
                                                            'type' => '1848'
                                                          },
                                                   '2' => {
                                                            'type' => '-1'
                                                          }
                                                 },
                                      'Return' => '73',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4225' => {
                                      'BaseType' => '4236',
                                      'Header' => 'init.h',
                                      'Line' => '106',
                                      'Name' => 'odp_abort_func_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4236' => {
                                      'BaseType' => '4242',
                                      'Name' => 'void() volatile*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4242' => {
                                      'BaseType' => '4247',
                                      'Name' => 'void() volatile',
                                      'Type' => 'Volatile'
                                    },
                          '4247' => {
                                      'Name' => 'void()',
                                      'Return' => '1',
                                      'Type' => 'Func'
                                    },
                          '427' => {
                                     'BaseType' => '390',
                                     'Header' => 'atomic.h',
                                     'Line' => '602',
                                     'Name' => 'odp_atomic_op_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '44000' => {
                                       'BaseType' => '41243',
                                       'Name' => 'odp_crypto_op_params_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '486' => {
                                     'BaseType' => '427',
                                     'Name' => 'odp_atomic_op_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '48964' => {
                                       'BaseType' => '41123',
                                       'Name' => 'odp_crypto_session_params_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '54113' => {
                                       'BaseType' => '40422',
                                       'Name' => 'odp_crypto_session_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54119' => {
                                       'BaseType' => '41287',
                                       'Name' => 'odp_crypto_ses_create_err_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55031' => {
                                       'BaseType' => '7096',
                                       'Name' => 'odp_bool_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55037' => {
                                       'BaseType' => '12099',
                                       'Name' => 'odp_crypto_op_result_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59813' => {
                                       'BaseType' => '2498',
                                       'Header' => 'timer_types.h',
                                       'Line' => '35',
                                       'Name' => 'odp_timeout_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '633' => {
                                     'Header' => 'atomic_types.h',
                                     'Line' => '41',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'v',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        }
                                               },
                                     'Name' => 'struct odp_atomic_u32_s',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '64676' => {
                                       'BaseType' => '1419',
                                       'Header' => 'init_types.h',
                                       'Line' => '22',
                                       'Name' => 'odp_instance_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '64687' => {
                                       'Header' => 'init_types.h',
                                       'Line' => '27',
                                       'Name' => 'struct odp_platform_init_t',
                                       'Size' => '0',
                                       'Type' => 'Struct'
                                     },
                          '64695' => {
                                       'BaseType' => '64687',
                                       'Header' => 'init_types.h',
                                       'Line' => '28',
                                       'Name' => 'odp_platform_init_t',
                                       'Type' => 'Typedef'
                                     },
                          '64706' => {
                                       'Header' => 'thread.h',
                                       'Line' => '36',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_THREAD_WORKER',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_THREAD_CONTROL',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_thread_type_e',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '64731' => {
                                       'BaseType' => '64706',
                                       'Header' => 'thread.h',
                                       'Line' => '58',
                                       'Name' => 'odp_thread_type_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '656' => {
                                     'BaseType' => '633',
                                     'Header' => 'atomic_types.h',
                                     'Line' => '83',
                                     'Name' => 'odp_atomic_u32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '66' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '667' => {
                                     'Header' => 'barrier_types.h',
                                     'Line' => '28',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'count',
                                                          'offset' => '0',
                                                          'type' => '129'
                                                        },
                                                 '1' => {
                                                          'name' => 'bar',
                                                          'offset' => '4',
                                                          'type' => '656'
                                                        }
                                               },
                                     'Name' => 'struct odp_barrier_s',
                                     'Size' => '8',
                                     'Type' => 'Struct'
                                   },
                          '68396' => {
                                       'BaseType' => '64676',
                                       'Name' => 'odp_instance_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68413' => {
                                       'BaseType' => '68419',
                                       'Name' => 'odp_platform_init_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68419' => {
                                       'BaseType' => '64695',
                                       'Name' => 'odp_platform_init_t const',
                                       'Type' => 'Const'
                                     },
                          '704' => {
                                     'BaseType' => '667',
                                     'Header' => 'barrier_types.h',
                                     'Line' => '33',
                                     'Name' => 'odp_barrier_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '7052' => {
                                      'BaseType' => '66',
                                      'Header' => 'stdint.h',
                                      'Line' => '49',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '7096' => {
                                      'BaseType' => '73',
                                      'Header' => 'std_types.h',
                                      'Line' => '34',
                                      'Name' => 'odp_bool_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '7231' => {
                                      'Header' => 'classification_types.h',
                                      'Line' => '26',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '1397'
                                                         }
                                                },
                                      'Name' => 'anon-struct-classification_types.h-26',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '7252' => {
                                      'BaseType' => '7263',
                                      'Header' => 'classification_types.h',
                                      'Line' => '26',
                                      'Name' => 'odp_cos_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7263' => {
                                      'BaseType' => '7231',
                                      'Name' => 'anon-struct-classification_types.h-26*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7280' => {
                                      'Header' => 'classification_types.h',
                                      'Line' => '34',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '1397'
                                                         }
                                                },
                                      'Name' => 'anon-struct-classification_types.h-34',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '73' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '7301' => {
                                      'BaseType' => '7312',
                                      'Header' => 'classification_types.h',
                                      'Line' => '34',
                                      'Name' => 'odp_pmr_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '73028' => {
                                       'BaseType' => '129',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '7312' => {
                                      'BaseType' => '7280',
                                      'Name' => 'anon-struct-classification_types.h-34*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7318' => {
                                      'Header' => 'packet_types.h',
                                      'Line' => '29',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '1397'
                                                         }
                                                },
                                      'Name' => 'anon-struct-packet_types.h-29',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '7339' => {
                                      'BaseType' => '7350',
                                      'Header' => 'packet_types.h',
                                      'Line' => '29',
                                      'Name' => 'odp_packet_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7350' => {
                                      'BaseType' => '7318',
                                      'Name' => 'anon-struct-packet_types.h-29*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7356' => {
                                      'Header' => 'packet_io_types.h',
                                      'Line' => '29',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '1397'
                                                         }
                                                },
                                      'Name' => 'anon-struct-packet_io_types.h-29',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '7377' => {
                                      'BaseType' => '7388',
                                      'Header' => 'packet_io_types.h',
                                      'Line' => '29',
                                      'Name' => 'odp_pktio_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7388' => {
                                      'BaseType' => '7356',
                                      'Name' => 'anon-struct-packet_io_types.h-29*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7394' => {
                                      'Header' => 'packet_io_types.h',
                                      'Line' => '32',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pktio',
                                                           'offset' => '0',
                                                           'type' => '7377'
                                                         },
                                                  '1' => {
                                                           'name' => 'index',
                                                           'offset' => '8',
                                                           'type' => '73'
                                                         }
                                                },
                                      'Name' => 'struct odp_pktin_queue_t',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7431' => {
                                      'BaseType' => '7394',
                                      'Header' => 'packet_io_types.h',
                                      'Line' => '35',
                                      'Name' => 'odp_pktin_queue_t',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '7442' => {
                                      'Header' => 'packet_io_types.h',
                                      'Line' => '38',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pktio',
                                                           'offset' => '0',
                                                           'type' => '7377'
                                                         },
                                                  '1' => {
                                                           'name' => 'index',
                                                           'offset' => '8',
                                                           'type' => '73'
                                                         }
                                                },
                                      'Name' => 'struct odp_pktout_queue_t',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7479' => {
                                      'BaseType' => '7442',
                                      'Header' => 'packet_io_types.h',
                                      'Line' => '41',
                                      'Name' => 'odp_pktout_queue_t',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '7490' => {
                                      'Header' => 'queue_types.h',
                                      'Line' => '28',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '1397'
                                                         }
                                                },
                                      'Name' => 'anon-struct-queue_types.h-28',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '7511' => {
                                      'BaseType' => '7522',
                                      'Header' => 'queue_types.h',
                                      'Line' => '28',
                                      'Name' => 'odp_queue_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7522' => {
                                      'BaseType' => '7490',
                                      'Name' => 'anon-struct-queue_types.h-28*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7587' => {
                                      'Header' => 'classification.h',
                                      'Line' => '63',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ODP_COS_DROP_POOL',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ODP_COS_DROP_NEVER',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum odp_cls_drop_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7598' => {
                                      'Header' => 'classification.h',
                                      'Line' => '90',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'queue',
                                                           'offset' => '0',
                                                           'type' => '7511'
                                                         },
                                                  '1' => {
                                                           'name' => 'pool',
                                                           'offset' => '8',
                                                           'type' => '1586'
                                                         },
                                                  '2' => {
                                                           'name' => 'drop_policy',
                                                           'offset' => '16',
                                                           'type' => '7587'
                                                         }
                                                },
                                      'Name' => 'struct odp_cls_cos_param',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '7647' => {
                                      'BaseType' => '7598',
                                      'Header' => 'classification.h',
                                      'Line' => '94',
                                      'Name' => 'odp_cls_cos_param_t',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '7781' => {
                                      'Header' => 'classification.h',
                                      'Line' => '268',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ODP_PMR_LEN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ODP_PMR_ETHTYPE_0',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'ODP_PMR_TCP_SPORT',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'ODP_PMR_SIP_ADDR',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'ODP_PMR_DIP_ADDR',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'ODP_PMR_SIP6_ADDR',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'ODP_PMR_DIP6_ADDR',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'ODP_PMR_IPSEC_SPI',
                                                            'value' => '15'
                                                          },
                                                  '16' => {
                                                            'name' => 'ODP_PMR_LD_VNI',
                                                            'value' => '16'
                                                          },
                                                  '17' => {
                                                            'name' => 'ODP_PMR_CUSTOM_FRAME',
                                                            'value' => '17'
                                                          },
                                                  '18' => {
                                                            'name' => 'ODP_PMR_INNER_HDR_OFF',
                                                            'value' => '32'
                                                          },
                                                  '2' => {
                                                           'name' => 'ODP_PMR_ETHTYPE_X',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'ODP_PMR_VLAN_ID_0',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'ODP_PMR_VLAN_ID_X',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'ODP_PMR_DMAC',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'ODP_PMR_IPPROTO',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'ODP_PMR_UDP_DPORT',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'ODP_PMR_TCP_DPORT',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'ODP_PMR_UDP_SPORT',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum odp_pmr_term_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7793' => {
                                      'Header' => 'classification.h',
                                      'Line' => '273',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'term',
                                                           'offset' => '0',
                                                           'type' => '7781'
                                                         },
                                                  '1' => {
                                                           'name' => 'val',
                                                           'offset' => '8',
                                                           'type' => '1368'
                                                         },
                                                  '2' => {
                                                           'name' => 'mask',
                                                           'offset' => '16',
                                                           'type' => '1368'
                                                         },
                                                  '3' => {
                                                           'name' => 'val_sz',
                                                           'offset' => '24',
                                                           'type' => '129'
                                                         },
                                                  '4' => {
                                                           'name' => 'offset',
                                                           'offset' => '28',
                                                           'type' => '129'
                                                         }
                                                },
                                      'Name' => 'struct odp_pmr_match_t',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '78296' => {
                                       'BaseType' => '2761',
                                       'Name' => 'odp_ticketlock_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78706' => {
                                       'Header' => 'packet_types.h',
                                       'Line' => '35',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unused_dummy_var',
                                                            'offset' => '0',
                                                            'type' => '1397'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_types.h-35',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '7872' => {
                                      'BaseType' => '7793',
                                      'Header' => 'classification.h',
                                      'Line' => '281',
                                      'Name' => 'odp_pmr_match_t',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '78727' => {
                                       'BaseType' => '78738',
                                       'Header' => 'packet_types.h',
                                       'Line' => '35',
                                       'Name' => 'odp_packet_seg_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '78738' => {
                                       'BaseType' => '78706',
                                       'Name' => 'anon-struct-packet_types.h-35*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '7922' => {
                                      'BaseType' => '73',
                                      'Header' => 'schedule_types.h',
                                      'Line' => '28',
                                      'Name' => 'odp_schedule_prio_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '7933' => {
                                      'BaseType' => '73',
                                      'Header' => 'schedule_types.h',
                                      'Line' => '38',
                                      'Name' => 'odp_schedule_sync_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '7944' => {
                                      'BaseType' => '73',
                                      'Header' => 'schedule_types.h',
                                      'Line' => '44',
                                      'Name' => 'odp_schedule_group_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '7955' => {
                                      'Header' => 'schedule_types.h',
                                      'Line' => '130',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'prio',
                                                           'offset' => '0',
                                                           'type' => '7922'
                                                         },
                                                  '1' => {
                                                           'name' => 'sync',
                                                           'offset' => '4',
                                                           'type' => '7933'
                                                         },
                                                  '2' => {
                                                           'name' => 'group',
                                                           'offset' => '8',
                                                           'type' => '7944'
                                                         },
                                                  '3' => {
                                                           'name' => 'lock_count',
                                                           'offset' => '12',
                                                           'type' => '80'
                                                         }
                                                },
                                      'Name' => 'struct odp_schedule_param_t',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '80' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '8016' => {
                                      'BaseType' => '7955',
                                      'Header' => 'schedule_types.h',
                                      'Line' => '150',
                                      'Name' => 'odp_schedule_param_t',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '8027' => {
                                      'Header' => 'queue.h',
                                      'Line' => '53',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ODP_QUEUE_TYPE_PLAIN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ODP_QUEUE_TYPE_SCHED',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum odp_queue_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8052' => {
                                      'BaseType' => '8027',
                                      'Header' => 'queue.h',
                                      'Line' => '66',
                                      'Name' => 'odp_queue_type_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8063' => {
                                      'Header' => 'queue.h',
                                      'Line' => '71',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ODP_QUEUE_OP_MT',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ODP_QUEUE_OP_MT_UNSAFE',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'ODP_QUEUE_OP_DISABLED',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum odp_queue_op_mode_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8094' => {
                                      'BaseType' => '8063',
                                      'Header' => 'queue.h',
                                      'Line' => '97',
                                      'Name' => 'odp_queue_op_mode_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8105' => {
                                      'Header' => 'queue.h',
                                      'Line' => '102',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '8052'
                                                         },
                                                  '1' => {
                                                           'name' => 'enq_mode',
                                                           'offset' => '4',
                                                           'type' => '8094'
                                                         },
                                                  '2' => {
                                                           'name' => 'deq_mode',
                                                           'offset' => '8',
                                                           'type' => '8094'
                                                         },
                                                  '3' => {
                                                           'name' => 'sched',
                                                           'offset' => '12',
                                                           'type' => '8016'
                                                         },
                                                  '4' => {
                                                           'name' => 'context',
                                                           'offset' => '32',
                                                           'type' => '2498'
                                                         }
                                                },
                                      'Name' => 'struct odp_queue_param_t',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '8180' => {
                                      'BaseType' => '8105',
                                      'Header' => 'queue.h',
                                      'Line' => '143',
                                      'Name' => 'odp_queue_param_t',
                                      'Size' => '40',
                                      'Type' => 'Typedef'
                                    },
                          '86694' => {
                                       'BaseType' => '86700',
                                       'Name' => 'odp_packet_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '86700' => {
                                       'BaseType' => '7339',
                                       'Name' => 'odp_packet_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '91672' => {
                                       'BaseType' => '78727',
                                       'Name' => 'odp_packet_seg_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '94' => {
                                    'Name' => 'unsigned long long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '958' => {
                                     'BaseType' => '704',
                                     'Name' => 'odp_barrier_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   }
                        },
          'UndefinedSymbols' => {
                                  'libodp-linux.so.109.0.0' => {
                                                                 'AES_cbc_encrypt@OPENSSL_1.0.0' => 0,
                                                                 'AES_set_decrypt_key@OPENSSL_1.0.0' => 0,
                                                                 'AES_set_encrypt_key@OPENSSL_1.0.0' => 0,
                                                                 'DES_ede3_cbc_encrypt@OPENSSL_1.0.0' => 0,
                                                                 'DES_set_key@OPENSSL_1.0.0' => 0,
                                                                 'EVP_CIPHER_CTX_ctrl@OPENSSL_1.0.0' => 0,
                                                                 'EVP_CIPHER_CTX_free@OPENSSL_1.0.0' => 0,
                                                                 'EVP_CIPHER_CTX_new@OPENSSL_1.0.0' => 0,
                                                                 'EVP_DecryptFinal_ex@OPENSSL_1.0.0' => 0,
                                                                 'EVP_DecryptInit_ex@OPENSSL_1.0.0' => 0,
                                                                 'EVP_DecryptUpdate@OPENSSL_1.0.0' => 0,
                                                                 'EVP_EncryptFinal_ex@OPENSSL_1.0.0' => 0,
                                                                 'EVP_EncryptInit_ex@OPENSSL_1.0.0' => 0,
                                                                 'EVP_EncryptUpdate@OPENSSL_1.0.0' => 0,
                                                                 'EVP_aes_128_gcm@OPENSSL_1.0.1' => 0,
                                                                 'EVP_md5@OPENSSL_1.0.0' => 0,
                                                                 'EVP_sha256@OPENSSL_1.0.0' => 0,
                                                                 'HMAC@OPENSSL_1.0.0' => 0,
                                                                 'RAND_bytes@OPENSSL_1.0.0' => 0,
                                                                 '_ITM_deregisterTMCloneTable' => 0,
                                                                 '_ITM_registerTMCloneTable' => 0,
                                                                 '_Jv_RegisterClasses' => 0,
                                                                 '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                                 '__errno_location@GLIBC_2.2.5' => 0,
                                                                 '__gmon_start__' => 0,
                                                                 '__isoc99_sscanf@GLIBC_2.7' => 0,
                                                                 '__memcpy_chk@GLIBC_2.3.4' => 0,
                                                                 '__printf_chk@GLIBC_2.3.4' => 0,
                                                                 '__sched_cpucount@GLIBC_2.6' => 0,
                                                                 '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                                 '__sprintf_chk@GLIBC_2.3.4' => 0,
                                                                 '__stack_chk_fail@GLIBC_2.4' => 0,
                                                                 '__tls_get_addr@GLIBC_2.3' => 0,
                                                                 '__vfprintf_chk@GLIBC_2.3.4' => 0,
                                                                 'abort@GLIBC_2.2.5' => 0,
                                                                 'bind@GLIBC_2.2.5' => 0,
                                                                 'calloc@GLIBC_2.2.5' => 0,
                                                                 'clock_getres@GLIBC_2.2.5' => 0,
                                                                 'clock_gettime@GLIBC_2.2.5' => 0,
                                                                 'close@GLIBC_2.2.5' => 0,
                                                                 'closedir@GLIBC_2.2.5' => 0,
                                                                 'fclose@GLIBC_2.2.5' => 0,
                                                                 'fcntl@GLIBC_2.2.5' => 0,
                                                                 'fgets@GLIBC_2.2.5' => 0,
                                                                 'fopen@GLIBC_2.2.5' => 0,
                                                                 'free@GLIBC_2.2.5' => 0,
                                                                 'ftruncate@GLIBC_2.2.5' => 0,
                                                                 'getenv@GLIBC_2.2.5' => 0,
                                                                 'getpagesize@GLIBC_2.2.5' => 0,
                                                                 'getpid@GLIBC_2.2.5' => 0,
                                                                 'if_nametoindex@GLIBC_2.2.5' => 0,
                                                                 'ioctl@GLIBC_2.2.5' => 0,
                                                                 'malloc@GLIBC_2.2.5' => 0,
                                                                 'memcmp@GLIBC_2.2.5' => 0,
                                                                 'memcpy@GLIBC_2.14' => 0,
                                                                 'memset@GLIBC_2.2.5' => 0,
                                                                 'mmap@GLIBC_2.2.5' => 0,
                                                                 'munmap@GLIBC_2.2.5' => 0,
                                                                 'open@GLIBC_2.2.5' => 0,
                                                                 'opendir@GLIBC_2.2.5' => 0,
                                                                 'pthread_create@GLIBC_2.2.5' => 0,
                                                                 'pthread_join@GLIBC_2.2.5' => 0,
                                                                 'read@GLIBC_2.2.5' => 0,
                                                                 'readdir@GLIBC_2.2.5' => 0,
                                                                 'recvmmsg@GLIBC_2.12' => 0,
                                                                 'sched_getcpu@GLIBC_2.6' => 0,
                                                                 'sched_yield@GLIBC_2.2.5' => 0,
                                                                 'sendto@GLIBC_2.2.5' => 0,
                                                                 'setsockopt@GLIBC_2.2.5' => 0,
                                                                 'shm_open@GLIBC_2.2.5' => 0,
                                                                 'shm_unlink@GLIBC_2.2.5' => 0,
                                                                 'sigaddset@GLIBC_2.2.5' => 0,
                                                                 'sigemptyset@GLIBC_2.2.5' => 0,
                                                                 'sigprocmask@GLIBC_2.2.5' => 0,
                                                                 'sigtimedwait@GLIBC_2.2.5' => 0,
                                                                 'snprintf@GLIBC_2.2.5' => 0,
                                                                 'socket@GLIBC_2.2.5' => 0,
                                                                 'sscanf@GLIBC_2.2.5' => 0,
                                                                 'stderr@GLIBC_2.2.5' => 0,
                                                                 'stdout@GLIBC_2.2.5' => 0,
                                                                 'strchr@GLIBC_2.2.5' => 0,
                                                                 'strcmp@GLIBC_2.2.5' => 0,
                                                                 'strerror@GLIBC_2.2.5' => 0,
                                                                 'strncmp@GLIBC_2.2.5' => 0,
                                                                 'strncpy@GLIBC_2.2.5' => 0,
                                                                 'strstr@GLIBC_2.2.5' => 0,
                                                                 'strtol@GLIBC_2.2.5' => 0,
                                                                 'syscall@GLIBC_2.2.5' => 0,
                                                                 'timer_create@GLIBC_2.3.3' => 0,
                                                                 'timer_delete@GLIBC_2.3.3' => 0,
                                                                 'timer_getoverrun@GLIBC_2.3.3' => 0,
                                                                 'timer_settime@GLIBC_2.3.3' => 0,
                                                                 'write@GLIBC_2.2.5' => 0
                                                               }
                                },
          'WordSize' => '8'
        };
