$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.4',
          'Headers' => {
                         'chksum.h' => 1,
                         'cpumask_types.h' => 1,
                         'eth.h' => 1,
                         'init_types.h' => 1,
                         'ip.h' => 1,
                         'odph_cuckootable.h' => 1,
                         'odph_hashtable.h' => 1,
                         'odph_iplookuptable.h' => 1,
                         'odph_lineartable.h' => 1,
                         'packet.h' => 1,
                         'table.h' => 1,
                         'thread.h' => 1,
                         'threads.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libodphelper.so.112.1.0',
          'LibraryVersion' => '1.15.0.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'chksum.c' => 1,
                         'cuckootable.c' => 1,
                         'eth.c' => 1,
                         'hashtable.c' => 1,
                         'ip.c' => 1,
                         'iplookuptable.c' => 1,
                         'lineartable.c' => 1,
                         'threads.c' => 1

                                                        'odph_cuckoo_table_destroy' => 1,
                                                        'odph_cuckoo_table_get_value' => 1,
                                                        'odph_cuckoo_table_lookup' => 1,
                                                        'odph_cuckoo_table_ops' => -48,
                                                        'odph_cuckoo_table_put_value' => 1,
                                                        'odph_cuckoo_table_remove_value' => 1,
                                                        'odph_eth_addr_parse' => 1,
                                                        'odph_hash_get_value' => 1,
                                                        'odph_hash_put_value' => 1,
                                                        'odph_hash_remove_value' => 1,
                                                        'odph_hash_table_create' => 1,
                                                        'odph_hash_table_destroy' => 1,
                                                        'odph_hash_table_lookup' => 1,
                                                        'odph_hash_table_ops' => -48,
                                                        'odph_iplookup_table_create' => 1,
                                                        'odph_iplookup_table_destroy' => 1,
                                                        'odph_iplookup_table_get_value' => 1,
                                                        'odph_iplookup_table_lookup' => 1,
                                                        'odph_iplookup_table_ops' => -48,
                                                        'odph_iplookup_table_put_value' => 1,
                                                        'odph_iplookup_table_remove_value' => 1,
                                                        'odph_ipv4_addr_parse' => 1,
                                                        'odph_linear_table_create' => 1,
                                                        'odph_linear_table_destroy' => 1,
                                                        'odph_linear_table_lookup' => 1,
                                                        'odph_linear_table_ops' => -48,
                                                        'odph_merge_getopt_options' => 1,
                                                        'odph_odpthread_getaffinity' => 1,
                                                        'odph_odpthread_setaffinity' => 1,
                                                        'odph_odpthreads_create' => 1,
                                                        'odph_odpthreads_join' => 1,
                                                        'odph_parse_options' => 1,
                                                        'odph_udp_tcp_chksum' => 1
                                                      }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '105' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1138' => {
                                      'BaseType' => '98',
                                      'Header' => 'stdint.h',
                                      'Line' => '51',
                                      'Name' => 'uint32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '119' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '126' => {
                                     'BaseType' => '132',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '132' => {
                                     'BaseType' => '119',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '137' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '150' => {
                                     'BaseType' => '119',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1967' => {
                                      'BaseType' => '1138',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '199' => {
                                     'BaseType' => '73',
                                     'Name' => 'uint8_t[6]',
                                     'Size' => '6',
                                     'Type' => 'Array'
                                   },
                          '2131' => {
                                      'BaseType' => '91',
                                      'Header' => 'stdint.h',
                                      'Line' => '49',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '215' => {
                                     'Header' => 'eth.h',
                                     'Line' => '55',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'addr',
                                                          'offset' => '0',
                                                          'type' => '199'
                                                        }
                                               },
                                     'Name' => 'struct odph_ethaddr_t',
                                     'Size' => '6',
                                     'Type' => 'Struct'
                                   },
                          '2292' => {
                                      'Header' => 'packet.h',
                                      'Line' => '17',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'dummy',
                                                           'offset' => '0',
                                                           'type' => '119'
                                                         }
                                                },
                                      'Name' => 'struct _odp_abi_packet_t',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '2335' => {
                                      'BaseType' => '2346',
                                      'Header' => 'packet.h',
                                      'Line' => '26',
                                      'Name' => 'odp_packet_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2346' => {
                                      'BaseType' => '2292',
                                      'Name' => '_odp_abi_packet_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2425' => {
                                      'Header' => 'chksum.h',
                                      'Line' => '35',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ODPH_CHKSUM_GENERATE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ODPH_CHKSUM_VERIFY',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'ODPH_CHKSUM_RETURN',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum odph_chksum_op_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '32044' => {
                                       'BaseType' => '59',
                                       'Header' => 'types.h',
                                       'Line' => '133',
                                       'Name' => '__pid_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '32099' => {
                                       'BaseType' => '32044',
                                       'Header' => 'sched.h',
                                       'Line' => '35',
                                       'Name' => 'pid_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '32181' => {
                                       'BaseType' => '32193',
                                       'Header' => 'siginfo.h',
                                       'Line' => '303',
                                       'Name' => 'pthread_attr_t',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '32193' => {
                                       'Header' => 'pthreadtypes.h',
                                       'Line' => '63',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '__size',
                                                            'offset' => '0',
                                                            'type' => '32259'
                                                          },
                                                   '1' => {
                                                            'name' => '__align',
                                                            'offset' => '0',
                                                            'type' => '66'
                                                          }
                                                 },
                                       'Name' => 'union pthread_attr_t',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Union'
                                     },
                          '32248' => {
                                       'BaseType' => '105',
                                       'Header' => 'pthreadtypes.h',
                                       'Line' => '60',
                                       'Name' => 'pthread_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '32259' => {
                                       'BaseType' => '119',
                                       'Name' => 'char[56]',
                                       'Size' => '56',
                                       'Type' => 'Array'
                                     },
                          '32275' => {
                                       'BaseType' => '59',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '32303' => {
                                       'Header' => 'cpumask_types.h',
                                       'Line' => '37',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_u8',
                                                            'offset' => '0',
                                                            'type' => '32328'
                                                          }
                                                 },
                                       'Name' => 'struct odp_cpumask_t',
                                       'Size' => '128',
                                       'Type' => 'Struct'
                                     },
                          '32328' => {
                                       'BaseType' => '73',
                                       'Name' => 'uint8_t[128]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '32344' => {
                                       'BaseType' => '32303',
                                       'Header' => 'cpumask_types.h',
                                       'Line' => '44',
                                       'Name' => 'odp_cpumask_t',
                                       'Size' => '128',
                                       'Type' => 'Typedef'
                                     },
                          '32355' => {
                                       'BaseType' => '6631',
                                       'Header' => 'init_types.h',
                                       'Line' => '22',
                                       'Name' => 'odp_instance_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '32366' => {
                                       'Header' => 'thread.h',
                                       'Line' => '36',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_THREAD_WORKER',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_THREAD_CONTROL',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_thread_type_e',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '32391' => {
                                       'BaseType' => '32366',
                                       'Header' => 'thread.h',
                                       'Line' => '58',
                                       'Name' => 'odp_thread_type_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '32413' => {
                                       'BaseType' => '32419',
                                       'Name' => 'odp_cpumask_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '32419' => {
                                       'BaseType' => '32344',
                                       'Name' => 'odp_cpumask_t const',
                                       'Size' => '128',
                                       'Type' => 'Const'
                                     },
                          '32461' => {
                                       'BaseType' => '59',
                                       'Name' => 'int const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '32466' => {
                                       'Header' => 'getopt.h',
                                       'Line' => '104',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '126'
                                                          },
                                                   '1' => {
                                                            'name' => 'has_arg',
                                                            'offset' => '8',
                                                            'type' => '59'
                                                          },
                                                   '2' => {
                                                            'name' => 'flag',
                                                            'offset' => '16',
                                                            'type' => '32275'
                                                          },
                                                   '3' => {
                                                            'name' => 'val',
                                                            'offset' => '24',
                                                            'type' => '59'
                                                          }
                                                 },
                                       'Name' => 'struct option',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '32548' => {
                                       'Header' => 'threads.h',
                                       'Line' => '58',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODPTHREAD_NOT_STARTED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODPTHREAD_PROCESS',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODPTHREAD_PTHREAD',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum odph_odpthread_linuxtype_e',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '32579' => {
                                       'BaseType' => '32548',
                                       'Header' => 'threads.h',
                                       'Line' => '62',
                                       'Name' => 'odph_odpthread_linuxtype_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '32662' => {
                                       'Name' => 'int(*)(void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '137'
                                                           }
                                                  },
                                       'Return' => '59',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '32668' => {
                                       'Header' => 'threads.h',
                                       'Line' => '70',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start',
                                                            'offset' => '0',
                                                            'type' => '32662'
                                                          },
                                                   '1' => {
                                                            'name' => 'arg',
                                                            'offset' => '8',
                                                            'type' => '137'
                                                          },
                                                   '2' => {
                                                            'name' => 'thr_type',
                                                            'offset' => '16',
                                                            'type' => '32391'
                                                          },
                                                   '3' => {
                                                            'name' => 'instance',
                                                            'offset' => '24',
                                                            'type' => '32355'
                                                          }
                                                 },
                                       'Name' => 'struct odph_odpthread_params_t',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '32712' => {
                                       'Header' => 'threads.h',
                                       'Line' => '76',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'linuxtype',
                                                            'offset' => '0',
                                                            'type' => '32579'
                                                          },
                                                   '1' => {
                                                            'name' => 'thr_params',
                                                            'offset' => '8',
                                                            'type' => '32668'
                                                          }
                                                 },
                                       'Name' => 'struct odph_odpthread_start_args_t',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '32723' => {
                                       'Header' => 'threads.h',
                                       'Line' => '86',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'thread_id',
                                                            'offset' => '0',
                                                            'type' => '32248'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr',
                                                            'offset' => '8',
                                                            'type' => '32181'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-threads.h-86',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '32756' => {
                                       'Header' => 'threads.h',
                                       'Line' => '91',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pid',
                                                            'offset' => '0',
                                                            'type' => '32099'
                                                          },
                                                   '1' => {
                                                            'name' => 'status',
                                                            'offset' => '4',
                                                            'type' => '59'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-threads.h-91',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '32789' => {
                                       'Header' => 'threads.h',
                                       'Line' => '84',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'thread',
                                                            'offset' => '0',
                                                            'type' => '32723'
                                                          },
                                                   '1' => {
                                                            'name' => 'proc',
                                                            'offset' => '0',
                                                            'type' => '32756'
                                                          }
                                                 },
                                       'Name' => 'anon-union-threads.h-84',
                                       'Size' => '64',
                                       'Type' => 'Union'
                                     },
                          '32871' => {
                                       'Header' => 'threads.h',
                                       'Line' => '96',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'start_args',
                                                            'offset' => '0',
                                                            'type' => '32712'
                                                          },
                                                   '1' => {
                                                            'name' => 'cpu',
                                                            'offset' => '40',
                                                            'type' => '59'
                                                          },
                                                   '2' => {
                                                            'name' => 'last',
                                                            'offset' => '44',
                                                            'type' => '59'
                                                          },
                                                   '3' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '48',
                                                            'type' => '32789'
                                                          }
                                                 },
                                       'Name' => 'struct odph_odpthread_t',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '33685' => {
                                       'BaseType' => '33691',
                                       'Name' => 'struct option const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '33691' => {
                                       'BaseType' => '32466',
                                       'Name' => 'struct option const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '34084' => {
                                       'BaseType' => '32871',
                                       'Name' => 'odph_odpthread_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '34090' => {
                                       'BaseType' => '34096',
                                       'Name' => 'odph_odpthread_params_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '34096' => {
                                       'BaseType' => '32668',
                                       'Name' => 'odph_odpthread_params_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '3490' => {
                                      'BaseType' => '2131',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '37631' => {
                                       'BaseType' => '150',
                                       'Name' => 'char**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37637' => {
                                       'BaseType' => '37643',
                                       'Name' => 'struct option**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37643' => {
                                       'BaseType' => '32466',
                                       'Name' => 'struct option*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '66' => {
                                    'Name' => 'long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '6631' => {
                                      'BaseType' => '105',
                                      'Header' => 'stdint.h',
                                      'Line' => '55',
                                      'Name' => 'uint64_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6642' => {
                                      'Header' => 'table.h',
                                      'Line' => '98',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused_dummy_var',
                                                           'offset' => '0',
                                                           'type' => '73'
                                                         }
                                                },
                                      'Name' => 'anon-struct-table.h-98',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '6663' => {
                                      'BaseType' => '6674',
                                      'Header' => 'table.h',
                                      'Line' => '98',
                                      'Name' => 'odph_table_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6674' => {
                                      'BaseType' => '6642',
                                      'Name' => 'anon-struct-table.h-98*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6680' => {
                                      'BaseType' => '6691',
                                      'Header' => 'table.h',
                                      'Line' => '117',
                                      'Name' => 'odph_table_create',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6691' => {
                                      'Name' => 'odph_table_t(*)(char const*, uint32_t, uint32_t, uint32_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '126'
                                                          },
                                                   '1' => {
                                                            'type' => '1138'
                                                          },
                                                   '2' => {
                                                            'type' => '1138'
                                                          },
                                                   '3' => {
                                                            'type' => '1138'
                                                          }
                                                 },
                                      'Return' => '6663',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6727' => {
                                      'BaseType' => '6738',
                                      'Header' => 'table.h',
                                      'Line' => '134',
                                      'Name' => 'odph_table_lookup',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6738' => {
                                      'Name' => 'odph_table_t(*)(char const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '126'
                                                          }
                                                 },
                                      'Return' => '6663',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6759' => {
                                      'BaseType' => '6770',
                                      'Header' => 'table.h',
                                      'Line' => '148',
                                      'Name' => 'odph_table_destroy',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6770' => {
                                      'Name' => 'int(*)(odph_table_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '6663'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6791' => {
                                      'BaseType' => '6802',
                                      'Header' => 'table.h',
                                      'Line' => '170',
                                      'Name' => 'odph_table_put_value',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6802' => {
                                      'Name' => 'int(*)(odph_table_t, void*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '6663'
                                                          },
                                                   '1' => {
                                                            'type' => '137'
                                                          },
                                                   '2' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6833' => {
                                      'BaseType' => '6844',
                                      'Header' => 'table.h',
                                      'Line' => '199',
                                      'Name' => 'odph_table_get_value',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6844' => {
                                      'Name' => 'int(*)(odph_table_t, void*, void*, uint32_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '6663'
                                                          },
                                                   '1' => {
                                                            'type' => '137'
                                                          },
                                                   '2' => {
                                                            'type' => '137'
                                                          },
                                                   '3' => {
                                                            'type' => '1138'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6880' => {
                                      'BaseType' => '6891',
                                      'Header' => 'table.h',
                                      'Line' => '219',
                                      'Name' => 'odph_table_remove_value',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6891' => {
                                      'Name' => 'int(*)(odph_table_t, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '6663'
                                                          },
                                                   '1' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '59',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6917' => {
                                      'Header' => 'table.h',
                                      'Line' => '224',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'f_create',
                                                           'offset' => '0',
                                                           'type' => '6680'
                                                         },
                                                  '1' => {
                                                           'name' => 'f_lookup',
                                                           'offset' => '8',
                                                           'type' => '6727'
                                                         },
                                                  '2' => {
                                                           'name' => 'f_des',
                                                           'offset' => '16',
                                                           'type' => '6759'
                                                         },
                                                  '3' => {
                                                           'name' => 'f_put',
                                                           'offset' => '24',
                                                           'type' => '6791'
                                                         },
                                                  '4' => {
                                                           'name' => 'f_get',
                                                           'offset' => '32',
                                                           'type' => '6833'
                                                         },
                                                  '5' => {
                                                           'name' => 'f_remove',
                                                           'offset' => '40',
                                                           'type' => '6880'
                                                         }
                                                },
                                      'Name' => 'struct odph_table_ops_t',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7002' => {
                                      'BaseType' => '6917',
                                      'Header' => 'table.h',
                                      'Line' => '234',
                                      'Name' => 'odph_table_ops_t',
                                      'Size' => '48',
                                      'Type' => 'Typedef'
                                    },
                          '73' => {
                                    'BaseType' => '84',
                                    'Header' => 'stdint.h',
                                    'Line' => '48',
                                    'Name' => 'uint8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '84' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '91' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '978' => {
                                     'BaseType' => '215',
                                     'Name' => 'odph_ethaddr_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '98' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libodphelper.so.112.1.0' => {
                                                                 '_ITM_deregisterTMCloneTable' => 0,
                                                                 '_ITM_registerTMCloneTable' => 0,
                                                                 '_Jv_RegisterClasses' => 0,
                                                                 '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                                 '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                                 '__gmon_start__' => 0,
                                                                 '__isoc99_sscanf@GLIBC_2.7' => 0,
                                                                 '__printf_chk@GLIBC_2.3.4' => 0,
                                                                 '__sched_cpucount@GLIBC_2.6' => 0,
                                                                 '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                                 '__sprintf_chk@GLIBC_2.3.4' => 0,
                                                                 '__stack_chk_fail@GLIBC_2.4' => 0,
                                                                 '_exit@GLIBC_2.2.5' => 0,
                                                                 'fork@GLIBC_2.2.5' => 0,
                                                                 'free@GLIBC_2.2.5' => 0,
                                                                 'getopt_long@GLIBC_2.2.5' => 0,
                                                                 'getpid@GLIBC_2.2.5' => 0,
                                                                 'getppid@GLIBC_2.2.5' => 0,
                                                                 'kill@GLIBC_2.2.5' => 0,
                                                                 'malloc@GLIBC_2.2.5' => 0,
                                                                 'memcmp@GLIBC_2.2.5' => 0,
                                                                 'memcpy@GLIBC_2.14' => 0,
                                                                 'memset@GLIBC_2.2.5' => 0,
                                                                 'odp_be_to_cpu_16' => 0,
                                                                 'odp_buffer_addr' => 0,
                                                                 'odp_buffer_alloc' => 0,
                                                                 'odp_buffer_free' => 0,
                                                                 'odp_buffer_from_event' => 0,
                                                                 'odp_buffer_to_event' => 0,
                                                                 'odp_cpu_count' => 0,
                                                                 'odp_cpumask_count' => 0,
                                                                 'odp_cpumask_first' => 0,
                                                                 'odp_cpumask_next' => 0,
                                                                 'odp_hash_crc32c' => 0,
                                                                 'odp_init_local' => 0,
                                                                 'odp_packet_copy_from_mem' => 0,
                                                                 'odp_packet_copy_to_mem' => 0,
                                                                 'odp_packet_has_ipv4' => 0,
                                                                 'odp_packet_has_ipv6' => 0,
                                                                 'odp_packet_has_tcp' => 0,
                                                                 'odp_packet_has_udp' => 0,
                                                                 'odp_packet_l3_offset' => 0,
                                                                 'odp_packet_l3_ptr' => 0,
                                                                 'odp_packet_l4_offset' => 0,
                                                                 'odp_packet_l4_ptr' => 0,
                                                                 'odp_packet_offset' => 0,
                                                                 'odp_pool_create' => 0,
                                                                 'odp_pool_destroy' => 0,
                                                                 'odp_pool_lookup' => 0,
                                                                 'odp_queue_create' => 0,
                                                                 'odp_queue_deq' => 0,
                                                                 'odp_queue_destroy' => 0,
                                                                 'odp_queue_enq' => 0,
                                                                 'odp_queue_param_init' => 0,
                                                                 'odp_rwlock_init' => 0,
                                                                 'odp_rwlock_read_lock' => 0,
                                                                 'odp_rwlock_read_unlock' => 0,
                                                                 'odp_rwlock_write_lock' => 0,
                                                                 'odp_rwlock_write_unlock' => 0,
                                                                 'odp_shm_addr' => 0,
                                                                 'odp_shm_free' => 0,
                                                                 'odp_shm_lookup' => 0,
                                                                 'odp_shm_reserve' => 0,
                                                                 'odp_term_local' => 0,
                                                                 'optind@GLIBC_2.2.5' => 0,
                                                                 'prctl@GLIBC_2.2.5' => 0,
                                                                 'pthread_attr_destroy@GLIBC_2.2.5' => 0,
                                                                 'pthread_attr_init@GLIBC_2.2.5' => 0,
                                                                 'pthread_attr_setaffinity_np@GLIBC_2.3.4' => 0,
                                                                 'pthread_create@GLIBC_2.2.5' => 0,
                                                                 'pthread_getaffinity_np@GLIBC_2.3.4' => 0,
                                                                 'pthread_join@GLIBC_2.2.5' => 0,
                                                                 'pthread_self@GLIBC_2.2.5' => 0,
                                                                 'pthread_setaffinity_np@GLIBC_2.3.4' => 0,
                                                                 'sched_getaffinity@GLIBC_2.3.4' => 0,
                                                                 'sched_setaffinity@GLIBC_2.3.4' => 0,
                                                                 'snprintf@GLIBC_2.2.5' => 0,
                                                                 'stderr@GLIBC_2.2.5' => 0,
                                                                 'strcat@GLIBC_2.2.5' => 0,
                                                                 'strcmp@GLIBC_2.2.5' => 0,
                                                                 'strcpy@GLIBC_2.2.5' => 0,
                                                                 'strncpy@GLIBC_2.2.5' => 0,
                                                                 'strsignal@GLIBC_2.2.5' => 0,
                                                                 'syscall@GLIBC_2.2.5' => 0,
                                                                 'waitpid@GLIBC_2.2.5' => 0
                                                               }
                                },
          'WordSize' => '8'
        };
