$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.4',
          'Headers' => {
                         'atomic.h' => 1,
                         'atomic_inlines.h' => 1,
                         'atomic_types.h' => 1,
                         'barrier.h' => 1,
                         'barrier_types.h' => 1,
                         'buffer.h' => 1,
                         'byteorder_inlines.h' => 1,
                         'byteorder_types.h' => 1,
                         'chksum.h' => 1,
                         'classification.h' => 1,
                         'cpu.h' => 1,
                         'cpumask.h' => 1,
                         'cpumask_types.h' => 1,
                         'crypto.h' => 1,
                         'errno.h' => 1,
                         'event.h' => 1,
                         'feature.h' => 1,
                         'hash.h' => 1,
                         'init.h' => 1,
                         'init_types.h' => 1,
                         'packet.h' => 1,
                         'packet_flag_inlines_api.h' => 1,
                         'packet_flags.h' => 1,
                         'packet_inlines.h' => 1,
                         'packet_inlines_api.h' => 1,
                         'packet_io.h' => 1,
                         'packet_io_stats.h' => 1,
                         'packet_io_types.h' => 1,

                                                        'odp_tm_queue_wred_config' => 1,
                                                        'odp_tm_requirements_init' => 1,
                                                        'odp_tm_sched_create' => 1,
                                                        'odp_tm_sched_destroy' => 1,
                                                        'odp_tm_sched_lookup' => 1,
                                                        'odp_tm_sched_params_init' => 1,
                                                        'odp_tm_sched_params_read' => 1,
                                                        'odp_tm_sched_params_update' => 1,
                                                        'odp_tm_shaper_create' => 1,
                                                        'odp_tm_shaper_destroy' => 1,
                                                        'odp_tm_shaper_lookup' => 1,
                                                        'odp_tm_shaper_params_init' => 1,
                                                        'odp_tm_shaper_params_read' => 1,
                                                        'odp_tm_shaper_params_update' => 1,
                                                        'odp_tm_stats_print' => 1,
                                                        'odp_tm_threshold_create' => 1,
                                                        'odp_tm_threshold_destroy' => 1,
                                                        'odp_tm_threshold_params_init' => 1,
                                                        'odp_tm_thresholds_lookup' => 1,
                                                        'odp_tm_thresholds_params_read' => 1,
                                                        'odp_tm_thresholds_params_update' => 1,
                                                        'odp_tm_total_query' => 1,
                                                        'odp_tm_total_threshold_config' => 1,
                                                        'odp_tm_vlan_marking' => 1,
                                                        'odp_tm_wred_create' => 1,
                                                        'odp_tm_wred_destroy' => 1,
                                                        'odp_tm_wred_lookup' => 1,
                                                        'odp_tm_wred_params_init' => 1,
                                                        'odp_tm_wred_params_read' => 1,
                                                        'odp_tm_wred_params_update' => 1,
                                                        'odp_version_api_str' => 1,
                                                        'odp_version_impl_name' => 1,
                                                        'odp_version_impl_str' => 1
                                                      }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '100691' => {
                                        'Header' => 'timer_types.h',
                                        'Line' => '39',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'unused_dummy_var',
                                                             'offset' => '0',
                                                             'type' => '73'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-timer_types.h-39',
                                        'Size' => '1',
                                        'Type' => 'Struct'
                                      },
                          '100712' => {
                                        'BaseType' => '100723',
                                        'Header' => 'timer_types.h',
                                        'Line' => '39',
                                        'Name' => 'odp_timeout_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '100723' => {
                                        'BaseType' => '100691',
                                        'Name' => 'anon-struct-timer_types.h-39*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '103593' => {
                                        'BaseType' => '105',
                                        'Header' => 'init_types.h',
                                        'Line' => '22',
                                        'Name' => 'odp_instance_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '103604' => {
                                        'Header' => 'init_types.h',
                                        'Line' => '27',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ipc_ns',
                                                             'offset' => '0',
                                                             'type' => '59'
                                                           }
                                                  },
                                        'Name' => 'struct odp_platform_init_t',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '103629' => {
                                        'BaseType' => '103604',
                                        'Header' => 'init_types.h',
                                        'Line' => '29',
                                        'Name' => 'odp_platform_init_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '103799' => {
                                        'Header' => 'thread.h',
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_THREAD_WORKER',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_THREAD_CONTROL',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum odp_thread_type_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '103824' => {
                                        'BaseType' => '103799',
                                        'Header' => 'thread.h',
                                        'Line' => '58',
                                        'Name' => 'odp_thread_type_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '105' => {
                                     'BaseType' => '116',
                                     'Header' => 'stdint.h',
                                     'Line' => '55',
                                     'Name' => 'uint64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '10614' => {
                                       'BaseType' => '98',
                                       'Header' => 'stdint.h',
                                       'Line' => '51',
                                       'Name' => 'uint32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '107005' => {
                                        'BaseType' => '402',
                                        'Name' => 'void**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '107492' => {
                                        'BaseType' => '71950',
                                        'Name' => 'odp_init_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '110118' => {
                                        'BaseType' => '103593',
                                        'Name' => 'odp_instance_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '110135' => {
                                        'BaseType' => '110141',
                                        'Name' => 'odp_platform_init_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '110141' => {
                                        'BaseType' => '103629',
                                        'Name' => 'odp_platform_init_t const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '116' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '123' => {
                                     'Header' => 'spinlock_types.h',
                                     'Line' => '24',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'lock',
                                                          'offset' => '0',
                                                          'type' => '148'
                                                        }
                                               },
                                     'Name' => 'struct odp_spinlock_s',
                                     'Size' => '1',
                                     'Type' => 'Struct'
                                   },
                          '148' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '155' => {
                                     'BaseType' => '123',
                                     'Header' => 'spinlock_types.h',
                                     'Line' => '28',
                                     'Name' => 'odp_spinlock_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '164854' => {
                                        'Header' => 'packet.h',
                                        'Line' => '38',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_PACKET_GREEN',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_PACKET_YELLOW',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'ODP_PACKET_RED',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'ODP_PACKET_ALL_COLORS',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum odp_packet_color_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '166' => {
                                     'Header' => 'cpumask_types.h',
                                     'Line' => '37',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_u8',
                                                          'offset' => '0',
                                                          'type' => '191'
                                                        }
                                               },
                                     'Name' => 'struct odp_cpumask_t',
                                     'Size' => '128',
                                     'Type' => 'Struct'
                                   },
                          '176357' => {
                                        'Header' => 'packet_io.h',
                                        'Line' => '1060',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '313'
                                                           },
                                                    '1' => {
                                                             'name' => 'drv_name',
                                                             'offset' => '8',
                                                             'type' => '313'
                                                           },
                                                    '2' => {
                                                             'name' => 'pool',
                                                             'offset' => '16',
                                                             'type' => '38721'
                                                           },
                                                    '3' => {
                                                             'name' => 'param',
                                                             'offset' => '24',
                                                             'type' => '48319'
                                                           }
                                                  },
                                        'Name' => 'struct odp_pktio_info_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '176423' => {
                                        'BaseType' => '176357',
                                        'Header' => 'packet_io.h',
                                        'Line' => '1065',
                                        'Name' => 'odp_pktio_info_t',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '177166' => {
                                        'Header' => 'pool.h',
                                        'Line' => '280',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '313'
                                                           },
                                                    '1' => {
                                                             'name' => 'params',
                                                             'offset' => '8',
                                                             'type' => '39260'
                                                           }
                                                  },
                                        'Name' => 'struct odp_pool_info_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '177206' => {
                                        'BaseType' => '177166',
                                        'Header' => 'pool.h',
                                        'Line' => '283',
                                        'Name' => 'odp_pool_info_t',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '177556' => {
                                        'BaseType' => '177562',
                                        'Name' => 'odp_queue_param_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '177562' => {
                                        'BaseType' => '45882',
                                        'Name' => 'odp_queue_param_t const',
                                        'Size' => '48',
                                        'Type' => 'Const'
                                      },
                          '177567' => {
                                        'BaseType' => '45882',
                                        'Name' => 'odp_queue_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '178888' => {
                                        'BaseType' => '44749',
                                        'Name' => 'odp_queue_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '191' => {
                                     'BaseType' => '73',
                                     'Name' => 'uint8_t[128]',
                                     'Size' => '128',
                                     'Type' => 'Array'
                                   },
                          '191968' => {
                                        'BaseType' => '48319',
                                        'Name' => 'odp_pktio_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '192094' => {
                                        'BaseType' => '48223',
                                        'Name' => 'odp_pktin_queue_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '192145' => {
                                        'BaseType' => '48271',
                                        'Name' => 'odp_pktout_queue_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '192240' => {
                                        'BaseType' => '48851',
                                        'Name' => 'odp_pktio_config_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '193003' => {
                                        'BaseType' => '193009',
                                        'Name' => 'odp_pktio_param_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '193009' => {
                                        'BaseType' => '48319',
                                        'Name' => 'odp_pktio_param_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '193685' => {
                                        'BaseType' => '176423',
                                        'Name' => 'odp_pktio_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '200313' => {
                                        'BaseType' => '44658',
                                        'Name' => 'odp_pktin_queue_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '200801' => {
                                        'BaseType' => '44706',
                                        'Name' => 'odp_pktout_queue_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '204338' => {
                                        'BaseType' => '204344',
                                        'Name' => 'odp_pktin_queue_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '204344' => {
                                        'BaseType' => '44658',
                                        'Name' => 'odp_pktin_queue_t const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '205283' => {
                                        'BaseType' => '177206',
                                        'Name' => 'odp_pool_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '214' => {
                                     'BaseType' => '166',
                                     'Header' => 'cpumask_types.h',
                                     'Line' => '44',
                                     'Name' => 'odp_cpumask_t',
                                     'Size' => '128',
                                     'Type' => 'Typedef'
                                   },
                          '223015' => {
                                        'Header' => 'shared_memory.h',
                                        'Line' => '72',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '313'
                                                           },
                                                    '1' => {
                                                             'name' => 'addr',
                                                             'offset' => '8',
                                                             'type' => '402'
                                                           },
                                                    '2' => {
                                                             'name' => 'size',
                                                             'offset' => '16',
                                                             'type' => '105'
                                                           },
                                                    '3' => {
                                                             'name' => 'page_size',
                                                             'offset' => '24',
                                                             'type' => '105'
                                                           },
                                                    '4' => {
                                                             'name' => 'flags',
                                                             'offset' => '32',
                                                             'type' => '10614'
                                                           }
                                                  },
                                        'Name' => 'struct odp_shm_info_t',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '223088' => {
                                        'BaseType' => '223015',
                                        'Header' => 'shared_memory.h',
                                        'Line' => '78',
                                        'Name' => 'odp_shm_info_t',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '242625' => {
                                        'BaseType' => '223088',
                                        'Name' => 'odp_shm_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '264' => {
                                     'Header' => 'init.h',
                                     'Line' => '55',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'ODP_LOG_DBG',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'ODP_LOG_ERR',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'ODP_LOG_UNIMPLEMENTED',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'ODP_LOG_ABORT',
                                                          'value' => '3'
                                                        },
                                                 '4' => {
                                                          'name' => 'ODP_LOG_PRINT',
                                                          'value' => '4'
                                                        }
                                               },
                                     'Name' => 'enum odp_log_level_t',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '275' => {
                                     'BaseType' => '286',
                                     'Header' => 'init.h',
                                     'Line' => '104',
                                     'Name' => 'odp_log_func_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '286' => {
                                     'Name' => 'int(*)(odp_log_level_t, char const*, ...)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '264'
                                                         },
                                                  '1' => {
                                                           'type' => '313'
                                                         },
                                                  '2' => {
                                                           'type' => '-1'
                                                         }
                                                },
                                     'Return' => '59',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '29259' => {
                                       'BaseType' => '29265',
                                       'Name' => 'void const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '29265' => {
                                       'BaseType' => '1',
                                       'Name' => 'void const',
                                       'Type' => 'Const'
                                     },
                          '313' => {
                                     'BaseType' => '319',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '31676' => {
                                       'Header' => 'atomic_types.h',
                                       'Line' => '27',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'v',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'struct odp_atomic_u64_s',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '31699' => {
                                       'Header' => 'atomic_types.h',
                                       'Line' => '40',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'v',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          }
                                                 },
                                       'Name' => 'struct odp_atomic_u32_s',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '31722' => {
                                       'BaseType' => '31676',
                                       'Header' => 'atomic_types.h',
                                       'Line' => '80',
                                       'Name' => 'odp_atomic_u64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '31733' => {
                                       'BaseType' => '31699',
                                       'Header' => 'atomic_types.h',
                                       'Line' => '82',
                                       'Name' => 'odp_atomic_u32_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '31744' => {
                                       'Header' => 'atomic.h',
                                       'Line' => '578',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'init',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '1' => {
                                                            'bitfield' => '1',
                                                            'name' => 'load',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '10' => {
                                                             'bitfield' => '1',
                                                             'name' => 'dec',
                                                             'offset' => '0',
                                                             'type' => '10614'
                                                           },
                                                   '11' => {
                                                             'bitfield' => '1',
                                                             'name' => 'min',
                                                             'offset' => '0',
                                                             'type' => '10614'
                                                           },
                                                   '12' => {
                                                             'bitfield' => '1',
                                                             'name' => 'max',
                                                             'offset' => '0',
                                                             'type' => '10614'
                                                           },
                                                   '13' => {
                                                             'bitfield' => '1',
                                                             'name' => 'cas',
                                                             'offset' => '0',
                                                             'type' => '10614'
                                                           },
                                                   '14' => {
                                                             'bitfield' => '1',
                                                             'name' => 'xchg',
                                                             'offset' => '0',
                                                             'type' => '10614'
                                                           },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'store',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'fetch_add',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'add',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'fetch_sub',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '6' => {
                                                            'bitfield' => '1',
                                                            'name' => 'sub',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '7' => {
                                                            'bitfield' => '1',
                                                            'name' => 'fetch_inc',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '8' => {
                                                            'bitfield' => '1',
                                                            'name' => 'inc',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '9' => {
                                                            'bitfield' => '1',
                                                            'name' => 'fetch_dec',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-atomic.h-578',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '319' => {
                                     'BaseType' => '148',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '31994' => {
                                       'Header' => 'atomic.h',
                                       'Line' => '576',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'op',
                                                            'offset' => '0',
                                                            'type' => '31744'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          }
                                                 },
                                       'Name' => 'union odp_atomic_op_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '32031' => {
                                       'BaseType' => '31994',
                                       'Header' => 'atomic.h',
                                       'Line' => '601',
                                       'Name' => 'odp_atomic_op_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '32099' => {
                                       'BaseType' => '31733',
                                       'Name' => 'odp_atomic_u32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '324' => {
                                     'BaseType' => '335',
                                     'Header' => 'init.h',
                                     'Line' => '107',
                                     'Name' => 'odp_abort_func_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '32695' => {
                                       'BaseType' => '10614',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '33077' => {
                                       'BaseType' => '31722',
                                       'Name' => 'odp_atomic_u64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '335' => {
                                     'BaseType' => '341',
                                     'Name' => 'void() volatile*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '341' => {
                                     'BaseType' => '346',
                                     'Name' => 'void() volatile',
                                     'Type' => 'Volatile'
                                   },
                          '346' => {
                                     'Name' => 'void()',
                                     'Return' => '1',
                                     'Type' => 'Func'
                                   },
                          '347' => {
                                     'BaseType' => '116',
                                     'Header' => 'stddef.h',
                                     'Line' => '212',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '347203' => {
                                        'Header' => 'rwlock_types.h',
                                        'Line' => '24',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cnt',
                                                             'offset' => '0',
                                                             'type' => '31733'
                                                           }
                                                  },
                                        'Name' => 'struct odp_rwlock_s',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '347228' => {
                                        'BaseType' => '347203',
                                        'Header' => 'rwlock_types.h',
                                        'Line' => '31',
                                        'Name' => 'odp_rwlock_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '34972' => {
                                       'BaseType' => '32031',
                                       'Name' => 'odp_atomic_op_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '35132' => {
                                       'Header' => 'barrier_types.h',
                                       'Line' => '27',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'count',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '1' => {
                                                            'name' => 'bar',
                                                            'offset' => '4',
                                                            'type' => '31733'
                                                          }
                                                 },
                                       'Name' => 'struct odp_barrier_s',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '35169' => {
                                       'BaseType' => '35132',
                                       'Header' => 'barrier_types.h',
                                       'Line' => '32',
                                       'Name' => 'odp_barrier_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '352702' => {
                                        'BaseType' => '347228',
                                        'Name' => 'odp_rwlock_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '35276' => {
                                       'BaseType' => '35169',
                                       'Name' => 'odp_barrier_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '35743' => {
                                       'BaseType' => '98',
                                       'Name' => 'unsigned int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '357945' => {
                                        'Header' => 'pool.h',
                                        'Line' => '52',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_pools',
                                                             'offset' => '0',
                                                             'type' => '98'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_align',
                                                             'offset' => '4',
                                                             'type' => '10614'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_size',
                                                             'offset' => '8',
                                                             'type' => '10614'
                                                           },
                                                    '3' => {
                                                             'name' => 'max_num',
                                                             'offset' => '12',
                                                             'type' => '10614'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-pool.h-52',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '358002' => {
                                        'Header' => 'pool.h',
                                        'Line' => '73',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_pools',
                                                             'offset' => '0',
                                                             'type' => '98'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_len',
                                                             'offset' => '4',
                                                             'type' => '10614'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_num',
                                                             'offset' => '8',
                                                             'type' => '10614'
                                                           },
                                                    '3' => {
                                                             'name' => 'min_headroom',
                                                             'offset' => '12',
                                                             'type' => '10614'
                                                           },
                                                    '4' => {
                                                             'name' => 'min_tailroom',
                                                             'offset' => '16',
                                                             'type' => '10614'
                                                           },
                                                    '5' => {
                                                             'name' => 'max_segs_per_pkt',
                                                             'offset' => '20',
                                                             'type' => '10614'
                                                           },
                                                    '6' => {
                                                             'name' => 'min_seg_len',
                                                             'offset' => '24',
                                                             'type' => '10614'
                                                           },
                                                    '7' => {
                                                             'name' => 'max_seg_len',
                                                             'offset' => '28',
                                                             'type' => '10614'
                                                           },
                                                    '8' => {
                                                             'name' => 'max_uarea_size',
                                                             'offset' => '32',
                                                             'type' => '10614'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-pool.h-73',
                                        'Size' => '36',
                                        'Type' => 'Struct'
                                      },
                          '358119' => {
                                        'Header' => 'pool.h',
                                        'Line' => '133',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_pools',
                                                             'offset' => '0',
                                                             'type' => '98'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_num',
                                                             'offset' => '4',
                                                             'type' => '10614'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-pool.h-133',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '358152' => {
                                        'Header' => 'pool.h',
                                        'Line' => '47',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_pools',
                                                             'offset' => '0',
                                                             'type' => '98'
                                                           },
                                                    '1' => {
                                                             'name' => 'buf',
                                                             'offset' => '4',
                                                             'type' => '357945'
                                                           },
                                                    '2' => {
                                                             'name' => 'pkt',
                                                             'offset' => '20',
                                                             'type' => '358002'
                                                           },
                                                    '3' => {
                                                             'name' => 'tmo',
                                                             'offset' => '56',
                                                             'type' => '358119'
                                                           }
                                                  },
                                        'Name' => 'struct odp_pool_capability_t',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '358213' => {
                                        'BaseType' => '358152',
                                        'Header' => 'pool.h',
                                        'Line' => '144',
                                        'Name' => 'odp_pool_capability_t',
                                        'Size' => '64',
                                        'Type' => 'Typedef'
                                      },
                          '367510' => {
                                        'BaseType' => '39260',
                                        'Name' => 'odp_pool_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '371837' => {
                                        'BaseType' => '38672',
                                        'Name' => 'odp_buffer_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '372011' => {
                                        'BaseType' => '372017',
                                        'Name' => 'odp_buffer_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '372017' => {
                                        'BaseType' => '38672',
                                        'Name' => 'odp_buffer_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '372133' => {
                                        'BaseType' => '358213',
                                        'Name' => 'odp_pool_capability_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '376183' => {
                                        'Header' => 'queue.h',
                                        'Line' => '118',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_num',
                                                             'offset' => '0',
                                                             'type' => '10614'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_size',
                                                             'offset' => '4',
                                                             'type' => '10614'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-queue.h-118',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '376216' => {
                                        'Header' => 'queue.h',
                                        'Line' => '131',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_num',
                                                             'offset' => '0',
                                                             'type' => '10614'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_size',
                                                             'offset' => '4',
                                                             'type' => '10614'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-queue.h-131',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '376249' => {
                                        'Header' => 'queue.h',
                                        'Line' => '102',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_queues',
                                                             'offset' => '0',
                                                             'type' => '10614'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_ordered_locks',
                                                             'offset' => '4',
                                                             'type' => '98'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_sched_groups',
                                                             'offset' => '8',
                                                             'type' => '98'
                                                           },
                                                    '3' => {
                                                             'name' => 'sched_prios',
                                                             'offset' => '12',
                                                             'type' => '98'
                                                           },
                                                    '4' => {
                                                             'name' => 'plain',
                                                             'offset' => '16',
                                                             'type' => '376183'
                                                           },
                                                    '5' => {
                                                             'name' => 'sched',
                                                             'offset' => '24',
                                                             'type' => '376216'
                                                           }
                                                  },
                                        'Name' => 'struct odp_queue_capability_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '376334' => {
                                        'BaseType' => '376249',
                                        'Header' => 'queue.h',
                                        'Line' => '143',
                                        'Name' => 'odp_queue_capability_t',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '376455' => {
                                        'Header' => 'queue.h',
                                        'Line' => '429',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '313'
                                                           },
                                                    '1' => {
                                                             'name' => 'param',
                                                             'offset' => '8',
                                                             'type' => '45882'
                                                           }
                                                  },
                                        'Name' => 'struct odp_queue_info_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '376506' => {
                                        'BaseType' => '376455',
                                        'Header' => 'queue.h',
                                        'Line' => '432',
                                        'Name' => 'odp_queue_info_t',
                                        'Size' => '56',
                                        'Type' => 'Typedef'
                                      },
                          '377391' => {
                                        'BaseType' => '376334',
                                        'Name' => 'odp_queue_capability_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '377506' => {
                                        'BaseType' => '377512',
                                        'Name' => 'odp_event_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '377512' => {
                                        'BaseType' => '38623',
                                        'Name' => 'odp_event_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '377569' => {
                                        'BaseType' => '38623',
                                        'Name' => 'odp_event_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '377729' => {
                                        'BaseType' => '376506',
                                        'Name' => 'odp_queue_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '38462' => {
                                       'BaseType' => '45',
                                       'Header' => 'stdint.h',
                                       'Line' => '36',
                                       'Name' => 'int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '38519' => {
                                       'BaseType' => '91',
                                       'Header' => 'stdint.h',
                                       'Line' => '49',
                                       'Name' => 'uint16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '38612' => {
                                       'Header' => 'event.h',
                                       'Line' => '17',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_event_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '38623' => {
                                       'BaseType' => '38634',
                                       'Header' => 'event.h',
                                       'Line' => '23',
                                       'Name' => 'odp_event_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '38634' => {
                                       'BaseType' => '38612',
                                       'Name' => '_odp_abi_event_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '38661' => {
                                       'Header' => 'buffer.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_buffer_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '38672' => {
                                       'BaseType' => '38683',
                                       'Header' => 'buffer.h',
                                       'Line' => '21',
                                       'Name' => 'odp_buffer_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '38683' => {
                                       'BaseType' => '38661',
                                       'Name' => '_odp_abi_buffer_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '38710' => {
                                       'Header' => 'pool.h',
                                       'Line' => '17',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_pool_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '38721' => {
                                       'BaseType' => '38732',
                                       'Header' => 'pool.h',
                                       'Line' => '23',
                                       'Name' => 'odp_pool_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '38732' => {
                                       'BaseType' => '38710',
                                       'Name' => '_odp_abi_pool_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '38759' => {
                                       'Header' => 'shared_memory.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_shm_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '38770' => {
                                       'BaseType' => '38781',
                                       'Header' => 'shared_memory.h',
                                       'Line' => '21',
                                       'Name' => 'odp_shm_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '38781' => {
                                       'BaseType' => '38759',
                                       'Name' => '_odp_abi_shm_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '39004' => {
                                       'Header' => 'ticketlock_types.h',
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_ticket',
                                                            'offset' => '0',
                                                            'type' => '31733'
                                                          },
                                                   '1' => {
                                                            'name' => 'cur_ticket',
                                                            'offset' => '4',
                                                            'type' => '31733'
                                                          }
                                                 },
                                       'Name' => 'struct odp_ticketlock_s',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '39041' => {
                                       'BaseType' => '39004',
                                       'Header' => 'ticketlock_types.h',
                                       'Line' => '29',
                                       'Name' => 'odp_ticketlock_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '39052' => {
                                       'Header' => 'pool.h',
                                       'Line' => '172',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'num',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '10614'
                                                          },
                                                   '2' => {
                                                            'name' => 'align',
                                                            'offset' => '8',
                                                            'type' => '10614'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-pool.h-172',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '39097' => {
                                       'Header' => 'pool.h',
                                       'Line' => '187',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'num',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '1' => {
                                                            'name' => 'len',
                                                            'offset' => '4',
                                                            'type' => '10614'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_len',
                                                            'offset' => '8',
                                                            'type' => '10614'
                                                          },
                                                   '3' => {
                                                            'name' => 'seg_len',
                                                            'offset' => '12',
                                                            'type' => '10614'
                                                          },
                                                   '4' => {
                                                            'name' => 'uarea_size',
                                                            'offset' => '16',
                                                            'type' => '10614'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-pool.h-187',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '391' => {
                                     'BaseType' => '59',
                                     'Header' => 'types.h',
                                     'Line' => '133',
                                     'Name' => '__pid_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '39166' => {
                                       'Header' => 'pool.h',
                                       'Line' => '220',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'num',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-pool.h-220',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '39187' => {
                                       'Header' => 'pool.h',
                                       'Line' => '170',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '39052'
                                                          },
                                                   '1' => {
                                                            'name' => 'pkt',
                                                            'offset' => '0',
                                                            'type' => '39097'
                                                          },
                                                   '2' => {
                                                            'name' => 'tmo',
                                                            'offset' => '0',
                                                            'type' => '39166'
                                                          }
                                                 },
                                       'Name' => 'anon-union-pool.h-170',
                                       'Size' => '20',
                                       'Type' => 'Union'
                                     },
                          '39229' => {
                                       'Header' => 'pool.h',
                                       'Line' => '165',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '59'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '4',
                                                            'type' => '39187'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pool_param_t',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '39260' => {
                                       'BaseType' => '39229',
                                       'Header' => 'pool.h',
                                       'Line' => '225',
                                       'Name' => 'odp_pool_param_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '39593' => {
                                       'BaseType' => '148',
                                       'Name' => 'char[32]',
                                       'Size' => '32',
                                       'Type' => 'Array'
                                     },
                          '39658' => {
                                       'BaseType' => '73',
                                       'Name' => 'uint8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '399174' => {
                                        'Header' => 'rwlock_recursive_types.h',
                                        'Line' => '25',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'lock',
                                                             'offset' => '0',
                                                             'type' => '347228'
                                                           },
                                                    '1' => {
                                                             'name' => 'wr_owner',
                                                             'offset' => '4',
                                                             'type' => '59'
                                                           },
                                                    '2' => {
                                                             'name' => 'wr_cnt',
                                                             'offset' => '8',
                                                             'type' => '10614'
                                                           },
                                                    '3' => {
                                                             'name' => 'rd_cnt',
                                                             'offset' => '12',
                                                             'type' => '191'
                                                           }
                                                  },
                                        'Name' => 'struct odp_rwlock_recursive_s',
                                        'Size' => '140',
                                        'Type' => 'Struct'
                                      },
                          '399258' => {
                                        'BaseType' => '399174',
                                        'Header' => 'rwlock_recursive_types.h',
                                        'Line' => '32',
                                        'Name' => 'odp_rwlock_recursive_t',
                                        'Size' => '140',
                                        'Type' => 'Typedef'
                                      },
                          '399453' => {
                                        'BaseType' => '399258',
                                        'Name' => 'odp_rwlock_recursive_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '400916' => {
                                        'Header' => 'thrmask_types.h',
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'm',
                                                             'offset' => '0',
                                                             'type' => '214'
                                                           }
                                                  },
                                        'Name' => 'struct odp_thrmask_t',
                                        'Size' => '128',
                                        'Type' => 'Struct'
                                      },
                          '400939' => {
                                        'BaseType' => '400916',
                                        'Header' => 'thrmask_types.h',
                                        'Line' => '38',
                                        'Name' => 'odp_thrmask_t',
                                        'Size' => '128',
                                        'Type' => 'Typedef'
                                      },
                          '400950' => {
                                        'Header' => 'schedule.h',
                                        'Line' => '305',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '313'
                                                           },
                                                    '1' => {
                                                             'name' => 'thrmask',
                                                             'offset' => '8',
                                                             'type' => '400939'
                                                           }
                                                  },
                                        'Name' => 'struct odp_schedule_group_info_t',
                                        'Size' => '136',
                                        'Type' => 'Struct'
                                      },
                          '400990' => {
                                        'BaseType' => '400950',
                                        'Header' => 'schedule.h',
                                        'Line' => '308',
                                        'Name' => 'odp_schedule_group_info_t',
                                        'Size' => '136',
                                        'Type' => 'Typedef'
                                      },
                          '402' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '403977' => {
                                        'BaseType' => '403983',
                                        'Name' => 'odp_thrmask_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '403983' => {
                                        'BaseType' => '400939',
                                        'Name' => 'odp_thrmask_t const',
                                        'Size' => '128',
                                        'Type' => 'Const'
                                      },
                          '404082' => {
                                        'BaseType' => '400939',
                                        'Name' => 'odp_thrmask_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '404114' => {
                                        'BaseType' => '400990',
                                        'Name' => 'odp_schedule_group_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '415' => {
                                     'BaseType' => '148',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '43029' => {
                                       'BaseType' => '38519',
                                       'Header' => 'byteorder_types.h',
                                       'Line' => '64',
                                       'Name' => 'odp_u16le_t',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '43040' => {
                                       'BaseType' => '38519',
                                       'Header' => 'byteorder_types.h',
                                       'Line' => '65',
                                       'Name' => 'odp_u16be_t',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '43051' => {
                                       'BaseType' => '10614',
                                       'Header' => 'byteorder_types.h',
                                       'Line' => '67',
                                       'Name' => 'odp_u32le_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '43062' => {
                                       'BaseType' => '10614',
                                       'Header' => 'byteorder_types.h',
                                       'Line' => '68',
                                       'Name' => 'odp_u32be_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '43073' => {
                                       'BaseType' => '105',
                                       'Header' => 'byteorder_types.h',
                                       'Line' => '70',
                                       'Name' => 'odp_u64le_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '43084' => {
                                       'BaseType' => '105',
                                       'Header' => 'byteorder_types.h',
                                       'Line' => '71',
                                       'Name' => 'odp_u64be_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '43823' => {
                                       'BaseType' => '59',
                                       'Header' => 'std_types.h',
                                       'Line' => '30',
                                       'Name' => 'odp_bool_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '43841' => {
                                       'Header' => 'event.h',
                                       'Line' => '27',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_EVENT_BUFFER',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_EVENT_PACKET',
                                                            'value' => '2'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_EVENT_TIMEOUT',
                                                            'value' => '3'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_EVENT_CRYPTO_COMPL',
                                                            'value' => '4'
                                                          },
                                                   '4' => {
                                                            'name' => 'ODP_EVENT_IPSEC_RESULT',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum odp_event_type_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '43954' => {
                                       'Header' => 'classification.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_cos_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '43986' => {
                                       'Header' => 'classification.h',
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_pmr_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '43997' => {
                                       'BaseType' => '44008',
                                       'Header' => 'classification.h',
                                       'Line' => '24',
                                       'Name' => 'odp_cos_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '44008' => {
                                       'BaseType' => '43954',
                                       'Name' => '_odp_abi_cos_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44014' => {
                                       'BaseType' => '44025',
                                       'Header' => 'classification.h',
                                       'Line' => '25',
                                       'Name' => 'odp_pmr_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '44025' => {
                                       'BaseType' => '43986',
                                       'Name' => '_odp_abi_pmr_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44063' => {
                                       'Header' => 'packet.h',
                                       'Line' => '17',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_packet_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '44074' => {
                                       'BaseType' => '44085',
                                       'Header' => 'packet.h',
                                       'Line' => '26',
                                       'Name' => 'odp_packet_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '44085' => {
                                       'BaseType' => '44063',
                                       'Name' => '_odp_abi_packet_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44583' => {
                                       'Header' => 'packet_io_types.h',
                                       'Line' => '29',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unused_dummy_var',
                                                            'offset' => '0',
                                                            'type' => '73'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_io_types.h-29',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '44604' => {
                                       'BaseType' => '44615',
                                       'Header' => 'packet_io_types.h',
                                       'Line' => '29',
                                       'Name' => 'odp_pktio_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '44615' => {
                                       'BaseType' => '44583',
                                       'Name' => 'anon-struct-packet_io_types.h-29*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44621' => {
                                       'Header' => 'packet_io_types.h',
                                       'Line' => '32',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pktio',
                                                            'offset' => '0',
                                                            'type' => '44604'
                                                          },
                                                   '1' => {
                                                            'name' => 'index',
                                                            'offset' => '8',
                                                            'type' => '59'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktin_queue_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '44658' => {
                                       'BaseType' => '44621',
                                       'Header' => 'packet_io_types.h',
                                       'Line' => '35',
                                       'Name' => 'odp_pktin_queue_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '44669' => {
                                       'Header' => 'packet_io_types.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pktio',
                                                            'offset' => '0',
                                                            'type' => '44604'
                                                          },
                                                   '1' => {
                                                            'name' => 'index',
                                                            'offset' => '8',
                                                            'type' => '59'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktout_queue_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '44706' => {
                                       'BaseType' => '44669',
                                       'Header' => 'packet_io_types.h',
                                       'Line' => '41',
                                       'Name' => 'odp_pktout_queue_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '44738' => {
                                       'Header' => 'queue.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_queue_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '44749' => {
                                       'BaseType' => '44760',
                                       'Header' => 'queue.h',
                                       'Line' => '21',
                                       'Name' => 'odp_queue_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '44760' => {
                                       'BaseType' => '44738',
                                       'Name' => '_odp_abi_queue_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44766' => {
                                       'Header' => 'classification.h',
                                       'Line' => '64',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'len',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '1' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ethtype_0',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '10' => {
                                                             'bitfield' => '1',
                                                             'name' => 'tcp_sport',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '11' => {
                                                             'bitfield' => '1',
                                                             'name' => 'sip_addr',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '12' => {
                                                             'bitfield' => '1',
                                                             'name' => 'dip_addr',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '13' => {
                                                             'bitfield' => '1',
                                                             'name' => 'sip6_addr',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '14' => {
                                                             'bitfield' => '1',
                                                             'name' => 'dip6_addr',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '15' => {
                                                             'bitfield' => '1',
                                                             'name' => 'ipsec_spi',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '16' => {
                                                             'bitfield' => '1',
                                                             'name' => 'ld_vni',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '17' => {
                                                             'bitfield' => '1',
                                                             'name' => 'custom_frame',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ethtype_x',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'vlan_id_0',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'vlan_id_x',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'dmac',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '6' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ip_proto',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '7' => {
                                                            'bitfield' => '1',
                                                            'name' => 'udp_dport',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '8' => {
                                                            'bitfield' => '1',
                                                            'name' => 'tcp_dport',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '9' => {
                                                            'bitfield' => '1',
                                                            'name' => 'udp_sport',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-classification.h-64',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '45' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '45045' => {
                                       'Header' => 'classification.h',
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bit',
                                                            'offset' => '0',
                                                            'type' => '44766'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'union odp_cls_pmr_terms_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '45080' => {
                                       'BaseType' => '45045',
                                       'Header' => 'classification.h',
                                       'Line' => '108',
                                       'Name' => 'odp_cls_pmr_terms_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '45091' => {
                                       'Header' => 'classification.h',
                                       'Line' => '114',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'supported_terms',
                                                            'offset' => '0',
                                                            'type' => '45080'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_pmr_terms',
                                                            'offset' => '8',
                                                            'type' => '98'
                                                          },
                                                   '2' => {
                                                            'name' => 'available_pmr_terms',
                                                            'offset' => '12',
                                                            'type' => '98'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_cos',
                                                            'offset' => '16',
                                                            'type' => '98'
                                                          },
                                                   '4' => {
                                                            'name' => 'pmr_range_supported',
                                                            'offset' => '20',
                                                            'type' => '43823'
                                                          }
                                                 },
                                       'Name' => 'struct odp_cls_capability_t',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '45164' => {
                                       'BaseType' => '45091',
                                       'Header' => 'classification.h',
                                       'Line' => '131',
                                       'Name' => 'odp_cls_capability_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '45196' => {
                                       'Header' => 'classification.h',
                                       'Line' => '139',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_COS_DROP_POOL',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_COS_DROP_NEVER',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_cls_drop_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '45207' => {
                                       'Header' => 'classification.h',
                                       'Line' => '166',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'queue',
                                                            'offset' => '0',
                                                            'type' => '44749'
                                                          },
                                                   '1' => {
                                                            'name' => 'pool',
                                                            'offset' => '8',
                                                            'type' => '38721'
                                                          },
                                                   '2' => {
                                                            'name' => 'drop_policy',
                                                            'offset' => '16',
                                                            'type' => '45196'
                                                          }
                                                 },
                                       'Name' => 'struct odp_cls_cos_param',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '45256' => {
                                       'BaseType' => '45207',
                                       'Header' => 'classification.h',
                                       'Line' => '170',
                                       'Name' => 'odp_cls_cos_param_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '45391' => {
                                       'Header' => 'classification.h',
                                       'Line' => '358',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PMR_LEN',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PMR_ETHTYPE_0',
                                                            'value' => '1'
                                                          },
                                                   '10' => {
                                                             'name' => 'ODP_PMR_TCP_SPORT',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'ODP_PMR_SIP_ADDR',
                                                             'value' => '11'
                                                           },
                                                   '12' => {
                                                             'name' => 'ODP_PMR_DIP_ADDR',
                                                             'value' => '12'
                                                           },
                                                   '13' => {
                                                             'name' => 'ODP_PMR_SIP6_ADDR',
                                                             'value' => '13'
                                                           },
                                                   '14' => {
                                                             'name' => 'ODP_PMR_DIP6_ADDR',
                                                             'value' => '14'
                                                           },
                                                   '15' => {
                                                             'name' => 'ODP_PMR_IPSEC_SPI',
                                                             'value' => '15'
                                                           },
                                                   '16' => {
                                                             'name' => 'ODP_PMR_LD_VNI',
                                                             'value' => '16'
                                                           },
                                                   '17' => {
                                                             'name' => 'ODP_PMR_CUSTOM_FRAME',
                                                             'value' => '17'
                                                           },
                                                   '18' => {
                                                             'name' => 'ODP_PMR_INNER_HDR_OFF',
                                                             'value' => '32'
                                                           },
                                                   '2' => {
                                                            'name' => 'ODP_PMR_ETHTYPE_X',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_PMR_VLAN_ID_0',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'ODP_PMR_VLAN_ID_X',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'ODP_PMR_DMAC',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'ODP_PMR_IPPROTO',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'ODP_PMR_UDP_DPORT',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'ODP_PMR_TCP_DPORT',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'ODP_PMR_UDP_SPORT',
                                                            'value' => '9'
                                                          }
                                                 },
                                       'Name' => 'enum odp_cls_pmr_term_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '45403' => {
                                       'Header' => 'classification.h',
                                       'Line' => '372',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '29259'
                                                          },
                                                   '1' => {
                                                            'name' => 'mask',
                                                            'offset' => '8',
                                                            'type' => '29259'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-classification.h-372',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '45446' => {
                                       'Header' => 'classification.h',
                                       'Line' => '381',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'val_start',
                                                            'offset' => '0',
                                                            'type' => '29259'
                                                          },
                                                   '1' => {
                                                            'name' => 'val_end',
                                                            'offset' => '8',
                                                            'type' => '29259'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-classification.h-381',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '45482' => {
                                       'Header' => 'classification.h',
                                       'Line' => '370',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'match',
                                                            'offset' => '0',
                                                            'type' => '45403'
                                                          },
                                                   '1' => {
                                                            'name' => 'range',
                                                            'offset' => '0',
                                                            'type' => '45446'
                                                          }
                                                 },
                                       'Name' => 'anon-union-classification.h-370',
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '45516' => {
                                       'Header' => 'classification.h',
                                       'Line' => '363',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'term',
                                                            'offset' => '0',
                                                            'type' => '45391'
                                                          },
                                                   '1' => {
                                                            'name' => 'range_term',
                                                            'offset' => '4',
                                                            'type' => '43823'
                                                          },
                                                   '2' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '45482'
                                                          },
                                                   '3' => {
                                                            'name' => 'val_sz',
                                                            'offset' => '24',
                                                            'type' => '10614'
                                                          },
                                                   '4' => {
                                                            'name' => 'offset',
                                                            'offset' => '28',
                                                            'type' => '10614'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pmr_param_t',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '45588' => {
                                       'BaseType' => '45516',
                                       'Header' => 'classification.h',
                                       'Line' => '395',
                                       'Name' => 'odp_pmr_param_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '45600' => {
                                       'BaseType' => '59',
                                       'Header' => 'schedule_types.h',
                                       'Line' => '28',
                                       'Name' => 'odp_schedule_prio_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '45611' => {
                                       'BaseType' => '59',
                                       'Header' => 'schedule_types.h',
                                       'Line' => '38',
                                       'Name' => 'odp_schedule_sync_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '45622' => {
                                       'BaseType' => '59',
                                       'Header' => 'schedule_types.h',
                                       'Line' => '44',
                                       'Name' => 'odp_schedule_group_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '45633' => {
                                       'Header' => 'schedule_types.h',
                                       'Line' => '130',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'prio',
                                                            'offset' => '0',
                                                            'type' => '45600'
                                                          },
                                                   '1' => {
                                                            'name' => 'sync',
                                                            'offset' => '4',
                                                            'type' => '45611'
                                                          },
                                                   '2' => {
                                                            'name' => 'group',
                                                            'offset' => '8',
                                                            'type' => '45622'
                                                          },
                                                   '3' => {
                                                            'name' => 'lock_count',
                                                            'offset' => '12',
                                                            'type' => '98'
                                                          }
                                                 },
                                       'Name' => 'struct odp_schedule_param_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '45694' => {
                                       'BaseType' => '45633',
                                       'Header' => 'schedule_types.h',
                                       'Line' => '150',
                                       'Name' => 'odp_schedule_param_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '45705' => {
                                       'Header' => 'queue.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_QUEUE_TYPE_PLAIN',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_QUEUE_TYPE_SCHED',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_queue_type_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '45730' => {
                                       'BaseType' => '45705',
                                       'Header' => 'queue.h',
                                       'Line' => '66',
                                       'Name' => 'odp_queue_type_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '45741' => {
                                       'Header' => 'queue.h',
                                       'Line' => '71',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_QUEUE_OP_MT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_QUEUE_OP_MT_UNSAFE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_QUEUE_OP_DISABLED',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum odp_queue_op_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '45772' => {
                                       'BaseType' => '45741',
                                       'Header' => 'queue.h',
                                       'Line' => '97',
                                       'Name' => 'odp_queue_op_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '45783' => {
                                       'Header' => 'queue.h',
                                       'Line' => '148',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '45730'
                                                          },
                                                   '1' => {
                                                            'name' => 'enq_mode',
                                                            'offset' => '4',
                                                            'type' => '45772'
                                                          },
                                                   '2' => {
                                                            'name' => 'deq_mode',
                                                            'offset' => '8',
                                                            'type' => '45772'
                                                          },
                                                   '3' => {
                                                            'name' => 'sched',
                                                            'offset' => '12',
                                                            'type' => '45694'
                                                          },
                                                   '4' => {
                                                            'name' => 'context',
                                                            'offset' => '32',
                                                            'type' => '402'
                                                          },
                                                   '5' => {
                                                            'name' => 'context_len',
                                                            'offset' => '40',
                                                            'type' => '10614'
                                                          },
                                                   '6' => {
                                                            'name' => 'size',
                                                            'offset' => '44',
                                                            'type' => '10614'
                                                          }
                                                 },
                                       'Name' => 'struct odp_queue_param_t',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '45882' => {
                                       'BaseType' => '45783',
                                       'Header' => 'queue.h',
                                       'Line' => '205',
                                       'Name' => 'odp_queue_param_t',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '460828' => {
                                        'Header' => 'shared_memory.h',
                                        'Line' => '83',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_blocks',
                                                             'offset' => '0',
                                                             'type' => '98'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_size',
                                                             'offset' => '8',
                                                             'type' => '105'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_align',
                                                             'offset' => '16',
                                                             'type' => '105'
                                                           }
                                                  },
                                        'Name' => 'struct odp_shm_capability_t',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '460877' => {
                                        'BaseType' => '460828',
                                        'Header' => 'shared_memory.h',
                                        'Line' => '102',
                                        'Name' => 'odp_shm_capability_t',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '461287' => {
                                        'BaseType' => '460877',
                                        'Name' => 'odp_shm_capability_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '466600' => {
                                        'Header' => 'spinlock_recursive_types.h',
                                        'Line' => '24',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'lock',
                                                             'offset' => '0',
                                                             'type' => '155'
                                                           },
                                                    '1' => {
                                                             'name' => 'owner',
                                                             'offset' => '4',
                                                             'type' => '59'
                                                           },
                                                    '2' => {
                                                             'name' => 'cnt',
                                                             'offset' => '8',
                                                             'type' => '10614'
                                                           }
                                                  },
                                        'Name' => 'struct odp_spinlock_recursive_s',
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '466649' => {
                                        'BaseType' => '466600',
                                        'Header' => 'spinlock_recursive_types.h',
                                        'Line' => '30',
                                        'Name' => 'odp_spinlock_recursive_t',
                                        'Size' => '12',
                                        'Type' => 'Typedef'
                                      },
                          '466725' => {
                                        'BaseType' => '466649',
                                        'Name' => 'odp_spinlock_recursive_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '47657' => {
                                       'Header' => 'packet_io_stats.h',
                                       'Line' => '34',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in_octets',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_ucast_pkts',
                                                            'offset' => '8',
                                                            'type' => '105'
                                                          },
                                                   '2' => {
                                                            'name' => 'in_discards',
                                                            'offset' => '16',
                                                            'type' => '105'
                                                          },
                                                   '3' => {
                                                            'name' => 'in_errors',
                                                            'offset' => '24',
                                                            'type' => '105'
                                                          },
                                                   '4' => {
                                                            'name' => 'in_unknown_protos',
                                                            'offset' => '32',
                                                            'type' => '105'
                                                          },
                                                   '5' => {
                                                            'name' => 'out_octets',
                                                            'offset' => '40',
                                                            'type' => '105'
                                                          },
                                                   '6' => {
                                                            'name' => 'out_ucast_pkts',
                                                            'offset' => '48',
                                                            'type' => '105'
                                                          },
                                                   '7' => {
                                                            'name' => 'out_discards',
                                                            'offset' => '56',
                                                            'type' => '105'
                                                          },
                                                   '8' => {
                                                            'name' => 'out_errors',
                                                            'offset' => '64',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_stats_t',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '47778' => {
                                       'BaseType' => '47657',
                                       'Header' => 'packet_io_stats.h',
                                       'Line' => '107',
                                       'Name' => 'odp_pktio_stats_t',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '47789' => {
                                       'Header' => 'time_types.h',
                                       'Line' => '30',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'u64',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '1' => {
                                                            'name' => 'nsec',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '2' => {
                                                            'name' => 'count',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'anon-union-time_types.h-30',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '47831' => {
                                       'Header' => 'time_types.h',
                                       'Line' => '28',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '47789'
                                                          }
                                                 },
                                       'Name' => 'struct odp_time_t',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '47850' => {
                                       'BaseType' => '47831',
                                       'Header' => 'time_types.h',
                                       'Line' => '41',
                                       'Name' => 'odp_time_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '47861' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '82',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PKTIN_MODE_DIRECT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PKTIN_MODE_SCHED',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_PKTIN_MODE_QUEUE',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_PKTIN_MODE_DISABLED',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum odp_pktin_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '47898' => {
                                       'BaseType' => '47861',
                                       'Header' => 'packet_io.h',
                                       'Line' => '91',
                                       'Name' => 'odp_pktin_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '47909' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '96',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PKTOUT_MODE_DIRECT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PKTOUT_MODE_QUEUE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_PKTOUT_MODE_TM',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_PKTOUT_MODE_DISABLED',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum odp_pktout_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '47946' => {
                                       'BaseType' => '47909',
                                       'Header' => 'packet_io.h',
                                       'Line' => '105',
                                       'Name' => 'odp_pktout_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '47957' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '115',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4_udp',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '1' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4_tcp',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv6_udp',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv6_tcp',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv6',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_io.h-115',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '48056' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '113',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'proto',
                                                            'offset' => '0',
                                                            'type' => '47957'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          }
                                                 },
                                       'Name' => 'union odp_pktin_hash_proto_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '48091' => {
                                       'BaseType' => '48056',
                                       'Header' => 'packet_io.h',
                                       'Line' => '132',
                                       'Name' => 'odp_pktin_hash_proto_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '48102' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '137',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PKTIO_OP_MT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PKTIO_OP_MT_UNSAFE',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_pktio_op_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '48127' => {
                                       'BaseType' => '48102',
                                       'Header' => 'packet_io.h',
                                       'Line' => '153',
                                       'Name' => 'odp_pktio_op_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '48138' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '158',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'op_mode',
                                                            'offset' => '0',
                                                            'type' => '48127'
                                                          },
                                                   '1' => {
                                                            'name' => 'classifier_enable',
                                                            'offset' => '4',
                                                            'type' => '43823'
                                                          },
                                                   '2' => {
                                                            'name' => 'hash_enable',
                                                            'offset' => '8',
                                                            'type' => '43823'
                                                          },
                                                   '3' => {
                                                            'name' => 'hash_proto',
                                                            'offset' => '12',
                                                            'type' => '48091'
                                                          },
                                                   '4' => {
                                                            'name' => 'num_queues',
                                                            'offset' => '16',
                                                            'type' => '98'
                                                          },
                                                   '5' => {
                                                            'name' => 'queue_param',
                                                            'offset' => '24',
                                                            'type' => '45882'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktin_queue_param_t',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '48223' => {
                                       'BaseType' => '48138',
                                       'Header' => 'packet_io.h',
                                       'Line' => '210',
                                       'Name' => 'odp_pktin_queue_param_t',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '48234' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '218',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'op_mode',
                                                            'offset' => '0',
                                                            'type' => '48127'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_queues',
                                                            'offset' => '4',
                                                            'type' => '98'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktout_queue_param_t',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '48271' => {
                                       'BaseType' => '48234',
                                       'Header' => 'packet_io.h',
                                       'Line' => '230',
                                       'Name' => 'odp_pktout_queue_param_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '48282' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '238',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in_mode',
                                                            'offset' => '0',
                                                            'type' => '47898'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_mode',
                                                            'offset' => '4',
                                                            'type' => '47946'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_param_t',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '48319' => {
                                       'BaseType' => '48282',
                                       'Header' => 'packet_io.h',
                                       'Line' => '249',
                                       'Name' => 'odp_pktio_param_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '48330' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '267',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ts_all',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '1' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ts_ptp',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '10' => {
                                                             'bitfield' => '1',
                                                             'name' => 'drop_sctp_err',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'udp_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'tcp_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'sctp_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '6' => {
                                                            'bitfield' => '1',
                                                            'name' => 'drop_ipv4_err',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '7' => {
                                                            'bitfield' => '1',
                                                            'name' => 'drop_ipv6_err',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '8' => {
                                                            'bitfield' => '1',
                                                            'name' => 'drop_udp_err',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '9' => {
                                                            'bitfield' => '1',
                                                            'name' => 'drop_tcp_err',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_io.h-267',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '48516' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '265',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bit',
                                                            'offset' => '0',
                                                            'type' => '48330'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'union odp_pktin_config_opt_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '48554' => {
                                       'BaseType' => '48516',
                                       'Header' => 'packet_io.h',
                                       'Line' => '309',
                                       'Name' => 'odp_pktin_config_opt_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '48566' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '327',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '1' => {
                                                            'bitfield' => '1',
                                                            'name' => 'udp_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'tcp_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'sctp_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_io.h-327',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '48640' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '325',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bit',
                                                            'offset' => '0',
                                                            'type' => '48566'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'union odp_pktout_config_opt_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '48678' => {
                                       'BaseType' => '48640',
                                       'Header' => 'packet_io.h',
                                       'Line' => '347',
                                       'Name' => 'odp_pktout_config_opt_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '48690' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '352',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PKTIO_PARSER_LAYER_NONE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PKTIO_PARSER_LAYER_L2',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_PKTIO_PARSER_LAYER_L3',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_PKTIO_PARSER_LAYER_L4',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'ODP_PKTIO_PARSER_LAYER_ALL',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum odp_pktio_parser_layer_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '48734' => {
                                       'BaseType' => '48690',
                                       'Header' => 'packet_io.h',
                                       'Line' => '368',
                                       'Name' => 'odp_pktio_parser_layer_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '48746' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '373',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'layer',
                                                            'offset' => '0',
                                                            'type' => '48734'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_parser_config_t',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '48773' => {
                                       'BaseType' => '48746',
                                       'Header' => 'packet_io.h',
                                       'Line' => '380',
                                       'Name' => 'odp_pktio_parser_config_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '48785' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '389',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pktin',
                                                            'offset' => '0',
                                                            'type' => '48554'
                                                          },
                                                   '1' => {
                                                            'name' => 'pktout',
                                                            'offset' => '8',
                                                            'type' => '48678'
                                                          },
                                                   '2' => {
                                                            'name' => 'parser',
                                                            'offset' => '16',
                                                            'type' => '48773'
                                                          },
                                                   '3' => {
                                                            'name' => 'enable_loop',
                                                            'offset' => '20',
                                                            'type' => '43823'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_config_t',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '48851' => {
                                       'BaseType' => '48785',
                                       'Header' => 'packet_io.h',
                                       'Line' => '411',
                                       'Name' => 'odp_pktio_config_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '48863' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '420',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'promisc_mode',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_io.h-420',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '48889' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '418',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'op',
                                                            'offset' => '0',
                                                            'type' => '48863'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          }
                                                 },
                                       'Name' => 'union odp_pktio_set_op_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '488956' => {
                                        'BaseType' => '402',
                                        'Header' => 'types.h',
                                        'Line' => '150',
                                        'Name' => '__timer_t',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '489050' => {
                                        'BaseType' => '488956',
                                        'Header' => 'time.h',
                                        'Line' => '103',
                                        'Name' => 'timer_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '489179' => {
                                        'BaseType' => '116',
                                        'Header' => 'pthreadtypes.h',
                                        'Line' => '60',
                                        'Name' => 'pthread_t',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '48926' => {
                                       'BaseType' => '48889',
                                       'Header' => 'packet_io.h',
                                       'Line' => '428',
                                       'Name' => 'odp_pktio_set_op_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '48938' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '433',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_input_queues',
                                                            'offset' => '0',
                                                            'type' => '98'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_output_queues',
                                                            'offset' => '4',
                                                            'type' => '98'
                                                          },
                                                   '2' => {
                                                            'name' => 'config',
                                                            'offset' => '8',
                                                            'type' => '48851'
                                                          },
                                                   '3' => {
                                                            'name' => 'set_op',
                                                            'offset' => '32',
                                                            'type' => '48926'
                                                          },
                                                   '4' => {
                                                            'name' => '_deprecated_loop_supported',
                                                            'offset' => '36',
                                                            'type' => '43823'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_capability_t',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '49017' => {
                                       'BaseType' => '48938',
                                       'Header' => 'packet_io.h',
                                       'Line' => '451',
                                       'Name' => 'odp_pktio_capability_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '493103' => {
                                        'BaseType' => '493114',
                                        'Header' => 'timer_types.h',
                                        'Line' => '29',
                                        'Name' => 'odp_timer_pool_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '493114' => {
                                        'BaseType' => '493120',
                                        'Name' => 'struct timer_pool_s*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '493120' => {
                                        'Line' => '169',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cur_tick',
                                                             'offset' => '0',
                                                             'type' => '31722'
                                                           },
                                                    '1' => {
                                                             'name' => 'min_rel_tck',
                                                             'offset' => '8',
                                                             'type' => '105'
                                                           },
                                                    '10' => {
                                                              'name' => 'param',
                                                              'offset' => '64',
                                                              'type' => '493571'
                                                            },
                                                    '11' => {
                                                              'name' => 'name',
                                                              'offset' => '104',
                                                              'type' => '39593'
                                                            },
                                                    '12' => {
                                                              'name' => 'shm',
                                                              'offset' => '136',
                                                              'type' => '38770'
                                                            },
                                                    '13' => {
                                                              'name' => 'timerid',
                                                              'offset' => '144',
                                                              'type' => '489050'
                                                            },
                                                    '14' => {
                                                              'name' => 'notify_overrun',
                                                              'offset' => '152',
                                                              'type' => '59'
                                                            },
                                                    '15' => {
                                                              'name' => 'timer_thread',
                                                              'offset' => '160',
                                                              'type' => '489179'
                                                            },
                                                    '16' => {
                                                              'name' => 'timer_thread_id',
                                                              'offset' => '168',
                                                              'type' => '933'
                                                            },
                                                    '17' => {
                                                              'name' => 'timer_thread_exit',
                                                              'offset' => '172',
                                                              'type' => '59'
                                                            },
                                                    '2' => {
                                                             'name' => 'max_rel_tck',
                                                             'offset' => '16',
                                                             'type' => '105'
                                                           },
                                                    '3' => {
                                                             'name' => 'tick_buf',
                                                             'offset' => '24',
                                                             'type' => '493814'
                                                           },
                                                    '4' => {
                                                             'name' => 'timers',
                                                             'offset' => '32',
                                                             'type' => '493820'
                                                           },
                                                    '5' => {
                                                             'name' => 'high_wm',
                                                             'offset' => '40',
                                                             'type' => '31733'
                                                           },
                                                    '6' => {
                                                             'name' => 'lock',
                                                             'offset' => '44',
                                                             'type' => '155'
                                                           },
                                                    '7' => {
                                                             'name' => 'num_alloc',
                                                             'offset' => '48',
                                                             'type' => '10614'
                                                           },
                                                    '8' => {
                                                             'name' => 'first_free',
                                                             'offset' => '52',
                                                             'type' => '10614'
                                                           },
                                                    '9' => {
                                                             'name' => 'tp_idx',
                                                             'offset' => '56',
                                                             'type' => '10614'
                                                           }
                                                  },
                                        'Name' => 'struct timer_pool_s',
                                        'PrivateABI' => 1,
                                        'Size' => '176',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Struct'
                                      },
                          '493349' => {
                                        'Header' => 'timer_types.h',
                                        'Line' => '35',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'unused_dummy_var',
                                                             'offset' => '0',
                                                             'type' => '73'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-timer_types.h-35',
                                        'Size' => '1',
                                        'Type' => 'Struct'
                                      },
                          '493370' => {
                                        'BaseType' => '493381',
                                        'Header' => 'timer_types.h',
                                        'Line' => '35',
                                        'Name' => 'odp_timer_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '493381' => {
                                        'BaseType' => '493349',
                                        'Name' => 'anon-struct-timer_types.h-35*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '493446' => {
                                        'Header' => 'timer.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_CLOCK_CPU',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_CLOCK_EXT',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum odp_timer_clk_src_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '493571' => {
                                        'Header' => 'timer.h',
                                        'Line' => '132',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'res_ns',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                    '1' => {
                                                             'name' => 'min_tmo',
                                                             'offset' => '8',
                                                             'type' => '105'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_tmo',
                                                             'offset' => '16',
                                                             'type' => '105'
                                                           },
                                                    '3' => {
                                                             'name' => 'num_timers',
                                                             'offset' => '24',
                                                             'type' => '10614'
                                                           },
                                                    '4' => {
                                                             'name' => 'priv',
                                                             'offset' => '28',
                                                             'type' => '59'
                                                           },
                                                    '5' => {
                                                             'name' => 'clk_src',
                                                             'offset' => '32',
                                                             'type' => '493446'
                                                           }
                                                  },
                                        'Name' => 'struct odp_timer_pool_param_t',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '493639' => {
                                        'Header' => 'timer.h',
                                        'Line' => '208',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'param',
                                                             'offset' => '0',
                                                             'type' => '493571'
                                                           },
                                                    '1' => {
                                                             'name' => 'cur_timers',
                                                             'offset' => '40',
                                                             'type' => '10614'
                                                           },
                                                    '2' => {
                                                             'name' => 'hwm_timers',
                                                             'offset' => '44',
                                                             'type' => '10614'
                                                           },
                                                    '3' => {
                                                             'name' => 'name',
                                                             'offset' => '48',
                                                             'type' => '313'
                                                           }
                                                  },
                                        'Name' => 'struct odp_timer_pool_info_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '493722' => {
                                        'Line' => '94',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'exp_tck',
                                                             'offset' => '0',
                                                             'type' => '31722'
                                                           },
                                                    '1' => {
                                                             'name' => 'tmo_buf',
                                                             'offset' => '8',
                                                             'type' => '38672'
                                                           }
                                                  },
                                        'Name' => 'struct tick_buf_s',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Struct'
                                      },
                          '493759' => {
                                        'BaseType' => '493722',
                                        'Line' => '108',
                                        'Name' => 'tick_buf_t',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Typedef'
                                      },
                          '493803' => {
                                        'Line' => '122',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'user_ptr',
                                                             'offset' => '0',
                                                             'type' => '402'
                                                           },
                                                    '1' => {
                                                             'name' => 'queue',
                                                             'offset' => '8',
                                                             'type' => '44749'
                                                           }
                                                  },
                                        'Name' => 'struct _odp_timer_t',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Struct'
                                      },
                          '493814' => {
                                        'BaseType' => '493759',
                                        'Name' => 'tick_buf_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '493820' => {
                                        'BaseType' => '493803',
                                        'Name' => '_odp_timer_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '499957' => {
                                        'BaseType' => '499963',
                                        'Name' => 'odp_timer_pool_param_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '499963' => {
                                        'BaseType' => '493571',
                                        'Name' => 'odp_timer_pool_param_t const',
                                        'Size' => '40',
                                        'Type' => 'Const'
                                      },
                          '500228' => {
                                        'BaseType' => '493639',
                                        'Name' => 'odp_timer_pool_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '50688' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '424',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_NONE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_DATA_SIZE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_KEY_SIZE',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_ICV_CHECK',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_IV_INVALID',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum odp_crypto_alg_err_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '507190' => {
                                        'BaseType' => '38519',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '110',
                                        'Name' => 'odp_tm_percent_t',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '507201' => {
                                        'BaseType' => '105',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '115',
                                        'Name' => 'odp_tm_handle_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '507212' => {
                                        'BaseType' => '507201',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '138',
                                        'Name' => 'odp_tm_shaper_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '507223' => {
                                        'BaseType' => '507201',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '144',
                                        'Name' => 'odp_tm_sched_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '507234' => {
                                        'BaseType' => '507201',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '151',
                                        'Name' => 'odp_tm_threshold_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '507245' => {
                                        'BaseType' => '507201',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '157',
                                        'Name' => 'odp_tm_wred_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '50728' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '436',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_CRYPTO_HW_ERR_NONE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_CRYPTO_HW_ERR_DMA',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_CRYPTO_HW_ERR_BP_DEPLETED',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum odp_crypto_hw_err_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '50740' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '441',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'alg_err',
                                                            'offset' => '0',
                                                            'type' => '50688'
                                                          },
                                                   '1' => {
                                                            'name' => 'hw_err',
                                                            'offset' => '4',
                                                            'type' => '50728'
                                                          }
                                                 },
                                       'Name' => 'struct odp_crypto_compl_status',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '507569' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '247',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_num_tm_nodes',
                                                             'offset' => '0',
                                                             'type' => '10614'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_fanin_per_node',
                                                             'offset' => '4',
                                                             'type' => '10614'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_priority',
                                                             'offset' => '8',
                                                             'type' => '73'
                                                           },
                                                    '3' => {
                                                             'name' => 'min_weight',
                                                             'offset' => '9',
                                                             'type' => '73'
                                                           },
                                                    '4' => {
                                                             'name' => 'max_weight',
                                                             'offset' => '10',
                                                             'type' => '73'
                                                           },
                                                    '5' => {
                                                             'name' => 'tm_node_shaper_supported',
                                                             'offset' => '12',
                                                             'type' => '43823'
                                                           },
                                                    '6' => {
                                                             'name' => 'tm_node_wred_supported',
                                                             'offset' => '16',
                                                             'type' => '43823'
                                                           },
                                                    '7' => {
                                                             'name' => 'tm_node_dual_slope_supported',
                                                             'offset' => '20',
                                                             'type' => '43823'
                                                           },
                                                    '8' => {
                                                             'name' => 'fair_queuing_supported',
                                                             'offset' => '24',
                                                             'type' => '43823'
                                                           },
                                                    '9' => {
                                                             'name' => 'weights_supported',
                                                             'offset' => '28',
                                                             'type' => '43823'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_level_capabilities_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '507746' => {
                                        'BaseType' => '43823',
                                        'Name' => 'odp_bool_t[3]',
                                        'Size' => '12',
                                        'Type' => 'Array'
                                      },
                          '507762' => {
                                        'BaseType' => '507569',
                                        'Name' => 'odp_tm_level_capabilities_t[8]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '507778' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '334',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '415'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_tm_queues',
                                                             'offset' => '8',
                                                             'type' => '10614'
                                                           },
                                                    '10' => {
                                                              'name' => 'marking_colors_supported',
                                                              'offset' => '44',
                                                              'type' => '507746'
                                                            },
                                                    '11' => {
                                                              'name' => 'per_level',
                                                              'offset' => '56',
                                                              'type' => '507762'
                                                            },
                                                    '2' => {
                                                             'name' => 'max_levels',
                                                             'offset' => '12',
                                                             'type' => '73'
                                                           },
                                                    '3' => {
                                                             'name' => 'egress_fcn_supported',
                                                             'offset' => '16',
                                                             'type' => '43823'
                                                           },
                                                    '4' => {
                                                             'name' => 'tm_queue_shaper_supported',
                                                             'offset' => '20',
                                                             'type' => '43823'
                                                           },
                                                    '5' => {
                                                             'name' => 'tm_queue_wred_supported',
                                                             'offset' => '24',
                                                             'type' => '43823'
                                                           },
                                                    '6' => {
                                                             'name' => 'tm_queue_dual_slope_supported',
                                                             'offset' => '28',
                                                             'type' => '43823'
                                                           },
                                                    '7' => {
                                                             'name' => 'vlan_marking_supported',
                                                             'offset' => '32',
                                                             'type' => '43823'
                                                           },
                                                    '8' => {
                                                             'name' => 'ecn_marking_supported',
                                                             'offset' => '36',
                                                             'type' => '43823'
                                                           },
                                                    '9' => {
                                                             'name' => 'drop_prec_marking_supported',
                                                             'offset' => '40',
                                                             'type' => '43823'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_capabilities_t',
                                        'Size' => '312',
                                        'Type' => 'Struct'
                                      },
                          '50780' => {
                                       'BaseType' => '50740',
                                       'Header' => 'crypto.h',
                                       'Line' => '448',
                                       'Name' => 'odp_crypto_compl_status_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '50792' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '453',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ok',
                                                            'offset' => '0',
                                                            'type' => '43823'
                                                          },
                                                   '1' => {
                                                            'name' => 'ctx',
                                                            'offset' => '8',
                                                            'type' => '402'
                                                          },
                                                   '2' => {
                                                            'name' => 'pkt',
                                                            'offset' => '16',
                                                            'type' => '44074'
                                                          },
                                                   '3' => {
                                                            'name' => 'cipher_status',
                                                            'offset' => '24',
                                                            'type' => '50780'
                                                          },
                                                   '4' => {
                                                            'name' => 'auth_status',
                                                            'offset' => '32',
                                                            'type' => '50780'
                                                          }
                                                 },
                                       'Name' => 'struct odp_crypto_op_result',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '507930' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '391',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_num_tm_nodes',
                                                             'offset' => '0',
                                                             'type' => '10614'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_fanin_per_node',
                                                             'offset' => '4',
                                                             'type' => '10614'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_priority',
                                                             'offset' => '8',
                                                             'type' => '73'
                                                           },
                                                    '3' => {
                                                             'name' => 'min_weight',
                                                             'offset' => '9',
                                                             'type' => '73'
                                                           },
                                                    '4' => {
                                                             'name' => 'max_weight',
                                                             'offset' => '10',
                                                             'type' => '73'
                                                           },
                                                    '5' => {
                                                             'name' => 'tm_node_shaper_needed',
                                                             'offset' => '12',
                                                             'type' => '43823'
                                                           },
                                                    '6' => {
                                                             'name' => 'tm_node_wred_needed',
                                                             'offset' => '16',
                                                             'type' => '43823'
                                                           },
                                                    '7' => {
                                                             'name' => 'tm_node_dual_slope_needed',
                                                             'offset' => '20',
                                                             'type' => '43823'
                                                           },
                                                    '8' => {
                                                             'name' => 'fair_queuing_needed',
                                                             'offset' => '24',
                                                             'type' => '43823'
                                                           },
                                                    '9' => {
                                                             'name' => 'weights_needed',
                                                             'offset' => '28',
                                                             'type' => '43823'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_level_requirements_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '508083' => {
                                        'BaseType' => '507930',
                                        'Name' => 'odp_tm_level_requirements_t[8]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '508099' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '449',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_tm_queues',
                                                             'offset' => '0',
                                                             'type' => '10614'
                                                           },
                                                    '1' => {
                                                             'name' => 'num_levels',
                                                             'offset' => '4',
                                                             'type' => '73'
                                                           },
                                                    '2' => {
                                                             'name' => 'tm_queue_shaper_needed',
                                                             'offset' => '8',
                                                             'type' => '43823'
                                                           },
                                                    '3' => {
                                                             'name' => 'tm_queue_wred_needed',
                                                             'offset' => '12',
                                                             'type' => '43823'
                                                           },
                                                    '4' => {
                                                             'name' => 'tm_queue_dual_slope_needed',
                                                             'offset' => '16',
                                                             'type' => '43823'
                                                           },
                                                    '5' => {
                                                             'name' => 'vlan_marking_needed',
                                                             'offset' => '20',
                                                             'type' => '43823'
                                                           },
                                                    '6' => {
                                                             'name' => 'ecn_marking_needed',
                                                             'offset' => '24',
                                                             'type' => '43823'
                                                           },
                                                    '7' => {
                                                             'name' => 'drop_prec_marking_needed',
                                                             'offset' => '28',
                                                             'type' => '43823'
                                                           },
                                                    '8' => {
                                                             'name' => 'marking_colors_needed',
                                                             'offset' => '32',
                                                             'type' => '507746'
                                                           },
                                                    '9' => {
                                                             'name' => 'per_level',
                                                             'offset' => '44',
                                                             'type' => '508083'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_requirements_t',
                                        'Size' => '300',
                                        'Type' => 'Struct'
                                      },
                          '508111' => {
                                        'BaseType' => '508123',
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '455',
                                        'Name' => 'odp_tm_egress_fcn_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '508123' => {
                                        'Name' => 'void(*)(odp_packet_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '44074'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '508162' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '466',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_TM_EGRESS_PKT_IO',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_TM_EGRESS_FN',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum odp_tm_egress_kind_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '508174' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '475',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pktio',
                                                             'offset' => '0',
                                                             'type' => '44604'
                                                           },
                                                    '1' => {
                                                             'name' => 'egress_fcn',
                                                             'offset' => '0',
                                                             'type' => '508111'
                                                           }
                                                  },
                                        'Name' => 'anon-union-traffic_mngr.h-475',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '508237' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '479',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'egress_kind',
                                                             'offset' => '0',
                                                             'type' => '508162'
                                                           },
                                                    '1' => {
                                                             'name' => 'unnamed0',
                                                             'offset' => '8',
                                                             'type' => '508174'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_egress_t',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '508271' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '873',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_TM_BYTE_BASED_WEIGHTS',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_TM_FRAME_BASED_WEIGHTS',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum odp_tm_sched_mode_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '508283' => {
                                        'BaseType' => '508271',
                                        'Name' => 'odp_tm_sched_mode_t[16]',
                                        'Size' => '64',
                                        'Type' => 'Array'
                                      },
                          '50870' => {
                                       'BaseType' => '50792',
                                       'Header' => 'crypto.h',
                                       'Line' => '469',
                                       'Name' => 'odp_crypto_op_result_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '5110' => {
                                      'BaseType' => '105',
                                      'Name' => 'uint64_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '51520' => {
                                       'BaseType' => '73',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '522197' => {
                                        'BaseType' => '507201',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '122',
                                        'Name' => 'odp_tm_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '522208' => {
                                        'BaseType' => '507201',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '127',
                                        'Name' => 'odp_tm_queue_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '522219' => {
                                        'BaseType' => '507201',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '132',
                                        'Name' => 'odp_tm_node_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '523211' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '783',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'commit_bps',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                    '1' => {
                                                             'name' => 'peak_bps',
                                                             'offset' => '8',
                                                             'type' => '105'
                                                           },
                                                    '2' => {
                                                             'name' => 'commit_burst',
                                                             'offset' => '16',
                                                             'type' => '10614'
                                                           },
                                                    '3' => {
                                                             'name' => 'peak_burst',
                                                             'offset' => '20',
                                                             'type' => '10614'
                                                           },
                                                    '4' => {
                                                             'name' => 'shaper_len_adjust',
                                                             'offset' => '24',
                                                             'type' => '38462'
                                                           },
                                                    '5' => {
                                                             'name' => 'dual_rate',
                                                             'offset' => '28',
                                                             'type' => '43823'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_shaper_params_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '523325' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '894',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'sched_modes',
                                                             'offset' => '0',
                                                             'type' => '508283'
                                                           },
                                                    '1' => {
                                                             'name' => 'sched_weights',
                                                             'offset' => '64',
                                                             'type' => '51520'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_sched_params_t',
                                        'Size' => '80',
                                        'Type' => 'Struct'
                                      },
                          '523399' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '983',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_pkts',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_bytes',
                                                             'offset' => '8',
                                                             'type' => '105'
                                                           },
                                                    '2' => {
                                                             'name' => 'enable_max_pkts',
                                                             'offset' => '16',
                                                             'type' => '43823'
                                                           },
                                                    '3' => {
                                                             'name' => 'enable_max_bytes',
                                                             'offset' => '20',
                                                             'type' => '43823'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_threshold_params_t',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '523499' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1119',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'min_threshold',
                                                             'offset' => '0',
                                                             'type' => '507190'
                                                           },
                                                    '1' => {
                                                             'name' => 'med_threshold',
                                                             'offset' => '2',
                                                             'type' => '507190'
                                                           },
                                                    '2' => {
                                                             'name' => 'med_drop_prob',
                                                             'offset' => '4',
                                                             'type' => '507190'
                                                           },
                                                    '3' => {
                                                             'name' => 'max_drop_prob',
                                                             'offset' => '6',
                                                             'type' => '507190'
                                                           },
                                                    '4' => {
                                                             'name' => 'enable_wred',
                                                             'offset' => '8',
                                                             'type' => '43823'
                                                           },
                                                    '5' => {
                                                             'name' => 'use_byte_fullness',
                                                             'offset' => '12',
                                                             'type' => '43823'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_wred_params_t',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '523599' => {
                                        'BaseType' => '507245',
                                        'Name' => 'odp_tm_wred_t[3]',
                                        'Size' => '24',
                                        'Type' => 'Array'
                                      },
                          '523615' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1235',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'user_context',
                                                             'offset' => '0',
                                                             'type' => '402'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_fanin',
                                                             'offset' => '8',
                                                             'type' => '10614'
                                                           },
                                                    '2' => {
                                                             'name' => 'shaper_profile',
                                                             'offset' => '16',
                                                             'type' => '507212'
                                                           },
                                                    '3' => {
                                                             'name' => 'threshold_profile',
                                                             'offset' => '24',
                                                             'type' => '507234'
                                                           },
                                                    '4' => {
                                                             'name' => 'wred_profile',
                                                             'offset' => '32',
                                                             'type' => '523599'
                                                           },
                                                    '5' => {
                                                             'name' => 'level',
                                                             'offset' => '56',
                                                             'type' => '73'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_node_params_t',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '523702' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1404',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'user_context',
                                                             'offset' => '0',
                                                             'type' => '402'
                                                           },
                                                    '1' => {
                                                             'name' => 'shaper_profile',
                                                             'offset' => '8',
                                                             'type' => '507212'
                                                           },
                                                    '2' => {
                                                             'name' => 'threshold_profile',
                                                             'offset' => '16',
                                                             'type' => '507234'
                                                           },
                                                    '3' => {
                                                             'name' => 'wred_profile',
                                                             'offset' => '24',
                                                             'type' => '523599'
                                                           },
                                                    '4' => {
                                                             'name' => 'priority',
                                                             'offset' => '48',
                                                             'type' => '73'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_queue_params_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '523815' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1652',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'shaper_profile',
                                                             'offset' => '0',
                                                             'type' => '507212'
                                                           },
                                                    '1' => {
                                                             'name' => 'threshold_profile',
                                                             'offset' => '8',
                                                             'type' => '507234'
                                                           },
                                                    '2' => {
                                                             'name' => 'wred_profile',
                                                             'offset' => '16',
                                                             'type' => '523599'
                                                           },
                                                    '3' => {
                                                             'name' => 'tm_queue_fanin',
                                                             'offset' => '40',
                                                             'type' => '10614'
                                                           },
                                                    '4' => {
                                                             'name' => 'tm_node_fanin',
                                                             'offset' => '44',
                                                             'type' => '10614'
                                                           },
                                                    '5' => {
                                                             'name' => 'next_tm_node',
                                                             'offset' => '48',
                                                             'type' => '522219'
                                                           },
                                                    '6' => {
                                                             'name' => 'level',
                                                             'offset' => '56',
                                                             'type' => '73'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_node_info_t',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '523889' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1690',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'sched_profile',
                                                             'offset' => '0',
                                                             'type' => '507223'
                                                           },
                                                    '1' => {
                                                             'name' => 'tm_queue',
                                                             'offset' => '8',
                                                             'type' => '522208'
                                                           },
                                                    '2' => {
                                                             'name' => 'tm_node',
                                                             'offset' => '16',
                                                             'type' => '522219'
                                                           },
                                                    '3' => {
                                                             'name' => 'is_last',
                                                             'offset' => '24',
                                                             'type' => '43823'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_node_fanin_info_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '523976' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1757',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'shaper_profile',
                                                             'offset' => '0',
                                                             'type' => '507212'
                                                           },
                                                    '1' => {
                                                             'name' => 'threshold_profile',
                                                             'offset' => '8',
                                                             'type' => '507234'
                                                           },
                                                    '2' => {
                                                             'name' => 'wred_profile',
                                                             'offset' => '16',
                                                             'type' => '523599'
                                                           },
                                                    '3' => {
                                                             'name' => 'next_tm_node',
                                                             'offset' => '40',
                                                             'type' => '522219'
                                                           },
                                                    '4' => {
                                                             'name' => 'active_pkt',
                                                             'offset' => '48',
                                                             'type' => '44074'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_queue_info_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '524115' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1839',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'total_pkt_cnt',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_pkt_cnt',
                                                             'offset' => '8',
                                                             'type' => '105'
                                                           },
                                                    '2' => {
                                                             'name' => 'total_byte_cnt',
                                                             'offset' => '16',
                                                             'type' => '105'
                                                           },
                                                    '3' => {
                                                             'name' => 'max_byte_cnt',
                                                             'offset' => '24',
                                                             'type' => '105'
                                                           },
                                                    '4' => {
                                                             'name' => 'total_pkt_cnt_valid',
                                                             'offset' => '32',
                                                             'type' => '43823'
                                                           },
                                                    '5' => {
                                                             'name' => 'max_pkt_cnt_valid',
                                                             'offset' => '36',
                                                             'type' => '43823'
                                                           },
                                                    '6' => {
                                                             'name' => 'total_byte_cnt_valid',
                                                             'offset' => '40',
                                                             'type' => '43823'
                                                           },
                                                    '7' => {
                                                             'name' => 'max_byte_cnt_valid',
                                                             'offset' => '44',
                                                             'type' => '43823'
                                                           },
                                                    '8' => {
                                                             'name' => 'approx_byte_cnt',
                                                             'offset' => '48',
                                                             'type' => '43823'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_query_info_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '532002' => {
                                        'BaseType' => '523211',
                                        'Name' => 'odp_tm_shaper_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '533813' => {
                                        'BaseType' => '523325',
                                        'Name' => 'odp_tm_sched_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '534001' => {
                                        'BaseType' => '523499',
                                        'Name' => 'odp_tm_wred_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '534793' => {
                                        'BaseType' => '507778',
                                        'Name' => 'odp_tm_capabilities_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '534799' => {
                                        'BaseType' => '508099',
                                        'Name' => 'odp_tm_requirements_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '537494' => {
                                        'BaseType' => '524115',
                                        'Name' => 'odp_tm_query_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '550825' => {
                                        'BaseType' => '508237',
                                        'Name' => 'odp_tm_egress_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '554567' => {
                                        'BaseType' => '523399',
                                        'Name' => 'odp_tm_threshold_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '555899' => {
                                        'BaseType' => '523615',
                                        'Name' => 'odp_tm_node_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '558294' => {
                                        'BaseType' => '523702',
                                        'Name' => 'odp_tm_queue_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '56065' => {
                                       'BaseType' => '47778',
                                       'Name' => 'odp_pktio_stats_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '561291' => {
                                        'BaseType' => '523815',
                                        'Name' => 'odp_tm_node_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '561454' => {
                                        'BaseType' => '523889',
                                        'Name' => 'odp_tm_node_fanin_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '56154' => {
                                       'BaseType' => '44074',
                                       'Name' => 'odp_packet_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '561653' => {
                                        'BaseType' => '523976',
                                        'Name' => 'odp_tm_queue_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '56196' => {
                                       'BaseType' => '56202',
                                       'Name' => 'odp_packet_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56202' => {
                                       'BaseType' => '44074',
                                       'Name' => 'odp_packet_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '56306' => {
                                       'BaseType' => '49017',
                                       'Name' => 'odp_pktio_capability_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56338' => {
                                       'BaseType' => '56344',
                                       'Name' => 'odp_pktio_config_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56344' => {
                                       'BaseType' => '48851',
                                       'Name' => 'odp_pktio_config_t const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '56375' => {
                                       'BaseType' => '56381',
                                       'Name' => 'odp_pktin_queue_param_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56381' => {
                                       'BaseType' => '48223',
                                       'Name' => 'odp_pktin_queue_param_t const',
                                       'Size' => '72',
                                       'Type' => 'Const'
                                     },
                          '56412' => {
                                       'BaseType' => '56418',
                                       'Name' => 'odp_pktout_queue_param_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56418' => {
                                       'BaseType' => '48271',
                                       'Name' => 'odp_pktout_queue_param_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '59' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '59239' => {
                                       'BaseType' => '59245',
                                       'Name' => 'odp_pmr_param_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59245' => {
                                       'BaseType' => '45588',
                                       'Name' => 'odp_pmr_param_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '64764' => {
                                       'BaseType' => '45256',
                                       'Name' => 'odp_cls_cos_param_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '64856' => {
                                       'BaseType' => '45588',
                                       'Name' => 'odp_pmr_param_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '64943' => {
                                       'BaseType' => '45164',
                                       'Name' => 'odp_cls_capability_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '67964' => {
                                       'BaseType' => '43997',
                                       'Name' => 'odp_cos_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71476' => {
                                       'BaseType' => '59',
                                       'Header' => 'stdint.h',
                                       'Line' => '38',
                                       'Name' => 'int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '71572' => {
                                       'Header' => 'feature.h',
                                       'Line' => '36',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'cls',
                                                            'offset' => '0',
                                                            'type' => '10614'
                                                          },
                                                   '1' => {
