$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.4',
          'Headers' => {
                         'atomic.h' => 1,
                         'atomic_inlines.h' => 1,
                         'atomic_types.h' => 1,
                         'barrier.h' => 1,
                         'barrier_types.h' => 1,
                         'buffer.h' => 1,
                         'byteorder_inlines.h' => 1,
                         'byteorder_types.h' => 1,
                         'chksum.h' => 1,
                         'classification.h' => 1,
                         'cpu.h' => 1,
                         'cpumask.h' => 1,
                         'cpumask_types.h' => 1,
                         'crypto.h' => 1,
                         'errno.h' => 1,
                         'event.h' => 1,
                         'hash.h' => 1,
                         'init.h' => 1,
                         'init_types.h' => 1,
                         'packet.h' => 1,
                         'packet_flag_inlines.h' => 1,
                         'packet_flag_inlines_api.h' => 1,
                         'packet_flags.h' => 1,
                         'packet_inlines_api.h' => 1,
                         'packet_io.h' => 1,
                         'packet_io_stats.h' => 1,
                         'packet_io_types.h' => 1,
                         'packet_types.h' => 1,

                                                        'odp_tm_queue_wred_config' => 1,
                                                        'odp_tm_requirements_init' => 1,
                                                        'odp_tm_sched_create' => 1,
                                                        'odp_tm_sched_destroy' => 1,
                                                        'odp_tm_sched_lookup' => 1,
                                                        'odp_tm_sched_params_init' => 1,
                                                        'odp_tm_sched_params_read' => 1,
                                                        'odp_tm_sched_params_update' => 1,
                                                        'odp_tm_shaper_create' => 1,
                                                        'odp_tm_shaper_destroy' => 1,
                                                        'odp_tm_shaper_lookup' => 1,
                                                        'odp_tm_shaper_params_init' => 1,
                                                        'odp_tm_shaper_params_read' => 1,
                                                        'odp_tm_shaper_params_update' => 1,
                                                        'odp_tm_stats_print' => 1,
                                                        'odp_tm_threshold_create' => 1,
                                                        'odp_tm_threshold_destroy' => 1,
                                                        'odp_tm_threshold_params_init' => 1,
                                                        'odp_tm_thresholds_lookup' => 1,
                                                        'odp_tm_thresholds_params_read' => 1,
                                                        'odp_tm_thresholds_params_update' => 1,
                                                        'odp_tm_total_query' => 1,
                                                        'odp_tm_total_threshold_config' => 1,
                                                        'odp_tm_vlan_marking' => 1,
                                                        'odp_tm_wred_create' => 1,
                                                        'odp_tm_wred_destroy' => 1,
                                                        'odp_tm_wred_lookup' => 1,
                                                        'odp_tm_wred_params_init' => 1,
                                                        'odp_tm_wred_params_read' => 1,
                                                        'odp_tm_wred_params_update' => 1,
                                                        'odp_version_api_str' => 1,
                                                        'odp_version_impl_name' => 1,
                                                        'odp_version_impl_str' => 1
                                                      }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '100893' => {
                                        'BaseType' => '105',
                                        'Header' => 'init_types.h',
                                        'Line' => '22',
                                        'Name' => 'odp_instance_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '100904' => {
                                        'Header' => 'init_types.h',
                                        'Line' => '27',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ipc_ns',
                                                             'offset' => '0',
                                                             'type' => '59'
                                                           }
                                                  },
                                        'Name' => 'struct odp_platform_init_t',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '100929' => {
                                        'BaseType' => '100904',
                                        'Header' => 'init_types.h',
                                        'Line' => '29',
                                        'Name' => 'odp_platform_init_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '100940' => {
                                        'Header' => 'thread.h',
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_THREAD_WORKER',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_THREAD_CONTROL',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum odp_thread_type_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '100965' => {
                                        'BaseType' => '100940',
                                        'Header' => 'thread.h',
                                        'Line' => '58',
                                        'Name' => 'odp_thread_type_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '10194' => {
                                       'BaseType' => '98',
                                       'Header' => 'stdint.h',
                                       'Line' => '51',
                                       'Name' => 'uint32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '104253' => {
                                        'BaseType' => '391',
                                        'Name' => 'void**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '105' => {
                                     'BaseType' => '116',
                                     'Header' => 'stdint.h',
                                     'Line' => '55',
                                     'Name' => 'uint64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '108306' => {
                                        'BaseType' => '100893',
                                        'Name' => 'odp_instance_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '108323' => {
                                        'BaseType' => '108329',
                                        'Name' => 'odp_platform_init_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '108329' => {
                                        'BaseType' => '100929',
                                        'Name' => 'odp_platform_init_t const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '116' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '118860' => {
                                        'Header' => 'packet_types.h',
                                        'Line' => '71',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'data',
                                                             'offset' => '0',
                                                             'type' => '347'
                                                           },
                                                    '1' => {
                                                             'name' => 'seg_len',
                                                             'offset' => '8',
                                                             'type' => '347'
                                                           },
                                                    '10' => {
                                                              'name' => 'user_area_size',
                                                              'offset' => '80',
                                                              'type' => '347'
                                                            },
                                                    '11' => {
                                                              'name' => 'flow_hash',
                                                              'offset' => '88',
                                                              'type' => '347'
                                                            },
                                                    '12' => {
                                                              'name' => 'timestamp',
                                                              'offset' => '96',
                                                              'type' => '347'
                                                            },
                                                    '13' => {
                                                              'name' => 'input_flags',
                                                              'offset' => '104',
                                                              'type' => '347'
                                                            },
                                                    '2' => {
                                                             'name' => 'frame_len',
                                                             'offset' => '16',
                                                             'type' => '347'
                                                           },
                                                    '3' => {
                                                             'name' => 'headroom',
                                                             'offset' => '24',
                                                             'type' => '347'
                                                           },
                                                    '4' => {
                                                             'name' => 'tailroom',
                                                             'offset' => '32',
                                                             'type' => '347'
                                                           },
                                                    '5' => {
                                                             'name' => 'pool',
                                                             'offset' => '40',
                                                             'type' => '347'
                                                           },
                                                    '6' => {
                                                             'name' => 'input',
                                                             'offset' => '48',
                                                             'type' => '347'
                                                           },
                                                    '7' => {
                                                             'name' => 'segcount',
                                                             'offset' => '56',
                                                             'type' => '347'
                                                           },
                                                    '8' => {
                                                             'name' => 'user_ptr',
                                                             'offset' => '64',
                                                             'type' => '347'
                                                           },
                                                    '9' => {
                                                             'name' => 'user_area',
                                                             'offset' => '72',
                                                             'type' => '347'
                                                           }
                                                  },
                                        'Name' => 'struct _odp_packet_inline_offset_t',
                                        'Size' => '112',
                                        'Type' => 'Struct'
                                      },
                          '119041' => {
                                        'BaseType' => '118860',
                                        'Header' => 'packet_types.h',
                                        'Line' => '101',
                                        'Name' => '_odp_packet_inline_offset_t',
                                        'Size' => '112',
                                        'Type' => 'Typedef'
                                      },
                          '123' => {
                                     'Header' => 'spinlock_types.h',
                                     'Line' => '24',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'lock',
                                                          'offset' => '0',
                                                          'type' => '148'
                                                        }
                                               },
                                     'Name' => 'struct odp_spinlock_s',
                                     'Size' => '1',
                                     'Type' => 'Struct'
                                   },
                          '148' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '153102' => {
                                        'BaseType' => '119041',
                                        'Name' => '_odp_packet_inline_offset_t const',
                                        'Size' => '112',
                                        'Type' => 'Const'
                                      },
                          '153190' => {
                                        'BaseType' => '153196',
                                        'Name' => 'odp_buffer_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '153196' => {
                                        'BaseType' => '36490',
                                        'Name' => 'odp_buffer_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '153237' => {
                                        'BaseType' => '36490',
                                        'Name' => 'odp_buffer_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '153809' => {
                                        'Header' => 'packet.h',
                                        'Line' => '38',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_PACKET_GREEN',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_PACKET_YELLOW',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'ODP_PACKET_RED',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'ODP_PACKET_ALL_COLORS',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum odp_packet_color_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '155' => {
                                     'BaseType' => '123',
                                     'Header' => 'spinlock_types.h',
                                     'Line' => '28',
                                     'Name' => 'odp_spinlock_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '165396' => {
                                        'Header' => 'packet_io.h',
                                        'Line' => '1057',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '313'
                                                           },
                                                    '1' => {
                                                             'name' => 'drv_name',
                                                             'offset' => '8',
                                                             'type' => '313'
                                                           },
                                                    '2' => {
                                                             'name' => 'pool',
                                                             'offset' => '16',
                                                             'type' => '36539'
                                                           },
                                                    '3' => {
                                                             'name' => 'param',
                                                             'offset' => '24',
                                                             'type' => '46659'
                                                           }
                                                  },
                                        'Name' => 'struct odp_pktio_info_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '165462' => {
                                        'BaseType' => '165396',
                                        'Header' => 'packet_io.h',
                                        'Line' => '1062',
                                        'Name' => 'odp_pktio_info_t',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '166' => {
                                     'Header' => 'cpumask_types.h',
                                     'Line' => '37',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_u8',
                                                          'offset' => '0',
                                                          'type' => '191'
                                                        }
                                               },
                                     'Name' => 'struct odp_cpumask_t',
                                     'Size' => '128',
                                     'Type' => 'Struct'
                                   },
                          '167638' => {
                                        'BaseType' => '43103',
                                        'Name' => 'odp_queue_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '180686' => {
                                        'BaseType' => '46659',
                                        'Name' => 'odp_pktio_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '180812' => {
                                        'BaseType' => '46563',
                                        'Name' => 'odp_pktin_queue_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '180863' => {
                                        'BaseType' => '46611',
                                        'Name' => 'odp_pktout_queue_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '180958' => {
                                        'BaseType' => '47191',
                                        'Name' => 'odp_pktio_config_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '181673' => {
                                        'BaseType' => '181679',
                                        'Name' => 'odp_pktio_param_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '181679' => {
                                        'BaseType' => '46659',
                                        'Name' => 'odp_pktio_param_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '182225' => {
                                        'BaseType' => '165462',
                                        'Name' => 'odp_pktio_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '184450' => {
                                        'BaseType' => '43012',
                                        'Name' => 'odp_pktin_queue_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '184938' => {
                                        'BaseType' => '43060',
                                        'Name' => 'odp_pktout_queue_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '189545' => {
                                        'BaseType' => '189551',
                                        'Name' => 'odp_pktin_queue_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '189551' => {
                                        'BaseType' => '43012',
                                        'Name' => 'odp_pktin_queue_t const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '191' => {
                                     'BaseType' => '73',
                                     'Name' => 'uint8_t[128]',
                                     'Size' => '128',
                                     'Type' => 'Array'
                                   },
                          '195064' => {
                                        'BaseType' => '44285',
                                        'Name' => 'odp_queue_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '195618' => {
                                        'BaseType' => '195624',
                                        'Name' => 'odp_queue_param_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '195624' => {
                                        'BaseType' => '44285',
                                        'Name' => 'odp_queue_param_t const',
                                        'Size' => '48',
                                        'Type' => 'Const'
                                      },
                          '214' => {
                                     'BaseType' => '166',
                                     'Header' => 'cpumask_types.h',
                                     'Line' => '44',
                                     'Name' => 'odp_cpumask_t',
                                     'Size' => '128',
                                     'Type' => 'Typedef'
                                   },
                          '214179' => {
                                        'Header' => 'shared_memory.h',
                                        'Line' => '72',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '313'
                                                           },
                                                    '1' => {
                                                             'name' => 'addr',
                                                             'offset' => '8',
                                                             'type' => '391'
                                                           },
                                                    '2' => {
                                                             'name' => 'size',
                                                             'offset' => '16',
                                                             'type' => '105'
                                                           },
                                                    '3' => {
                                                             'name' => 'page_size',
                                                             'offset' => '24',
                                                             'type' => '105'
                                                           },
                                                    '4' => {
                                                             'name' => 'flags',
                                                             'offset' => '32',
                                                             'type' => '10194'
                                                           }
                                                  },
                                        'Name' => 'struct odp_shm_info_t',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '214252' => {
                                        'BaseType' => '214179',
                                        'Header' => 'shared_memory.h',
                                        'Line' => '78',
                                        'Name' => 'odp_shm_info_t',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '233826' => {
                                        'BaseType' => '214252',
                                        'Name' => 'odp_shm_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '264' => {
                                     'Header' => 'init.h',
                                     'Line' => '54',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'ODP_LOG_DBG',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'ODP_LOG_ERR',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'ODP_LOG_UNIMPLEMENTED',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'ODP_LOG_ABORT',
                                                          'value' => '3'
                                                        },
                                                 '4' => {
                                                          'name' => 'ODP_LOG_PRINT',
                                                          'value' => '4'
                                                        }
                                               },
                                     'Name' => 'enum odp_log_level_t',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '27099' => {
                                       'BaseType' => '27105',
                                       'Name' => 'void const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '27105' => {
                                       'BaseType' => '1',
                                       'Name' => 'void const',
                                       'Type' => 'Const'
                                     },
                          '275' => {
                                     'BaseType' => '286',
                                     'Header' => 'init.h',
                                     'Line' => '103',
                                     'Name' => 'odp_log_func_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '286' => {
                                     'Name' => 'int(*)(odp_log_level_t, char const*, ...)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '264'
                                                         },
                                                  '1' => {
                                                           'type' => '313'
                                                         },
                                                  '2' => {
                                                           'type' => '-1'
                                                         }
                                                },
                                     'Return' => '59',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '29516' => {
                                       'Header' => 'atomic_types.h',
                                       'Line' => '27',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'v',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'struct odp_atomic_u64_s',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '29539' => {
                                       'Header' => 'atomic_types.h',
                                       'Line' => '40',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'v',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          }
                                                 },
                                       'Name' => 'struct odp_atomic_u32_s',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '29562' => {
                                       'BaseType' => '29516',
                                       'Header' => 'atomic_types.h',
                                       'Line' => '80',
                                       'Name' => 'odp_atomic_u64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '29573' => {
                                       'BaseType' => '29539',
                                       'Header' => 'atomic_types.h',
                                       'Line' => '82',
                                       'Name' => 'odp_atomic_u32_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '29584' => {
                                       'Header' => 'atomic.h',
                                       'Line' => '578',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'init',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '1' => {
                                                            'bitfield' => '1',
                                                            'name' => 'load',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '10' => {
                                                             'bitfield' => '1',
                                                             'name' => 'dec',
                                                             'offset' => '0',
                                                             'type' => '10194'
                                                           },
                                                   '11' => {
                                                             'bitfield' => '1',
                                                             'name' => 'min',
                                                             'offset' => '0',
                                                             'type' => '10194'
                                                           },
                                                   '12' => {
                                                             'bitfield' => '1',
                                                             'name' => 'max',
                                                             'offset' => '0',
                                                             'type' => '10194'
                                                           },
                                                   '13' => {
                                                             'bitfield' => '1',
                                                             'name' => 'cas',
                                                             'offset' => '0',
                                                             'type' => '10194'
                                                           },
                                                   '14' => {
                                                             'bitfield' => '1',
                                                             'name' => 'xchg',
                                                             'offset' => '0',
                                                             'type' => '10194'
                                                           },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'store',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'fetch_add',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'add',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'fetch_sub',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '6' => {
                                                            'bitfield' => '1',
                                                            'name' => 'sub',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '7' => {
                                                            'bitfield' => '1',
                                                            'name' => 'fetch_inc',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '8' => {
                                                            'bitfield' => '1',
                                                            'name' => 'inc',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '9' => {
                                                            'bitfield' => '1',
                                                            'name' => 'fetch_dec',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-atomic.h-578',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '29834' => {
                                       'Header' => 'atomic.h',
                                       'Line' => '576',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'op',
                                                            'offset' => '0',
                                                            'type' => '29584'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          }
                                                 },
                                       'Name' => 'union odp_atomic_op_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '29871' => {
                                       'BaseType' => '29834',
                                       'Header' => 'atomic.h',
                                       'Line' => '601',
                                       'Name' => 'odp_atomic_op_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '29939' => {
                                       'BaseType' => '29573',
                                       'Name' => 'odp_atomic_u32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '30535' => {
                                       'BaseType' => '10194',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '30917' => {
                                       'BaseType' => '29562',
                                       'Name' => 'odp_atomic_u64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '313' => {
                                     'BaseType' => '319',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '319' => {
                                     'BaseType' => '148',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '324' => {
                                     'BaseType' => '335',
                                     'Header' => 'init.h',
                                     'Line' => '106',
                                     'Name' => 'odp_abort_func_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '32812' => {
                                       'BaseType' => '29871',
                                       'Name' => 'odp_atomic_op_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '32972' => {
                                       'Header' => 'barrier_types.h',
                                       'Line' => '27',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'count',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '1' => {
                                                            'name' => 'bar',
                                                            'offset' => '4',
                                                            'type' => '29573'
                                                          }
                                                 },
                                       'Name' => 'struct odp_barrier_s',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '33009' => {
                                       'BaseType' => '32972',
                                       'Header' => 'barrier_types.h',
                                       'Line' => '32',
                                       'Name' => 'odp_barrier_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '33116' => {
                                       'BaseType' => '33009',
                                       'Name' => 'odp_barrier_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '335' => {
                                     'BaseType' => '341',
                                     'Name' => 'void() volatile*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '33572' => {
                                       'BaseType' => '98',
                                       'Name' => 'unsigned int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '341' => {
                                     'BaseType' => '346',
                                     'Name' => 'void() volatile',
                                     'Type' => 'Volatile'
                                   },
                          '342220' => {
                                        'Header' => 'rwlock_types.h',
                                        'Line' => '24',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cnt',
                                                             'offset' => '0',
                                                             'type' => '29573'
                                                           }
                                                  },
                                        'Name' => 'struct odp_rwlock_s',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '342245' => {
                                        'BaseType' => '342220',
                                        'Header' => 'rwlock_types.h',
                                        'Line' => '31',
                                        'Name' => 'odp_rwlock_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '346' => {
                                     'Name' => 'void()',
                                     'Return' => '1',
                                     'Type' => 'Func'
                                   },
                          '347' => {
                                     'BaseType' => '116',
                                     'Header' => 'stddef.h',
                                     'Line' => '212',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '347650' => {
                                        'BaseType' => '342245',
                                        'Name' => 'odp_rwlock_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '352442' => {
                                        'Header' => 'pool.h',
                                        'Line' => '52',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_pools',
                                                             'offset' => '0',
                                                             'type' => '98'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_align',
                                                             'offset' => '4',
                                                             'type' => '10194'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_size',
                                                             'offset' => '8',
                                                             'type' => '10194'
                                                           },
                                                    '3' => {
                                                             'name' => 'max_num',
                                                             'offset' => '12',
                                                             'type' => '10194'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-pool.h-52',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '352499' => {
                                        'Header' => 'pool.h',
                                        'Line' => '73',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_pools',
                                                             'offset' => '0',
                                                             'type' => '98'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_len',
                                                             'offset' => '4',
                                                             'type' => '10194'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_num',
                                                             'offset' => '8',
                                                             'type' => '10194'
                                                           },
                                                    '3' => {
                                                             'name' => 'min_headroom',
                                                             'offset' => '12',
                                                             'type' => '10194'
                                                           },
                                                    '4' => {
                                                             'name' => 'min_tailroom',
                                                             'offset' => '16',
                                                             'type' => '10194'
                                                           },
                                                    '5' => {
                                                             'name' => 'max_segs_per_pkt',
                                                             'offset' => '20',
                                                             'type' => '10194'
                                                           },
                                                    '6' => {
                                                             'name' => 'min_seg_len',
                                                             'offset' => '24',
                                                             'type' => '10194'
                                                           },
                                                    '7' => {
                                                             'name' => 'max_seg_len',
                                                             'offset' => '28',
                                                             'type' => '10194'
                                                           },
                                                    '8' => {
                                                             'name' => 'max_uarea_size',
                                                             'offset' => '32',
                                                             'type' => '10194'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-pool.h-73',
                                        'Size' => '36',
                                        'Type' => 'Struct'
                                      },
                          '352616' => {
                                        'Header' => 'pool.h',
                                        'Line' => '133',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_pools',
                                                             'offset' => '0',
                                                             'type' => '98'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_num',
                                                             'offset' => '4',
                                                             'type' => '10194'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-pool.h-133',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '352649' => {
                                        'Header' => 'pool.h',
                                        'Line' => '47',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_pools',
                                                             'offset' => '0',
                                                             'type' => '98'
                                                           },
                                                    '1' => {
                                                             'name' => 'buf',
                                                             'offset' => '4',
                                                             'type' => '352442'
                                                           },
                                                    '2' => {
                                                             'name' => 'pkt',
                                                             'offset' => '20',
                                                             'type' => '352499'
                                                           },
                                                    '3' => {
                                                             'name' => 'tmo',
                                                             'offset' => '56',
                                                             'type' => '352616'
                                                           }
                                                  },
                                        'Name' => 'struct odp_pool_capability_t',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '352710' => {
                                        'BaseType' => '352649',
                                        'Header' => 'pool.h',
                                        'Line' => '144',
                                        'Name' => 'odp_pool_capability_t',
                                        'Size' => '64',
                                        'Type' => 'Typedef'
                                      },
                          '352940' => {
                                        'Header' => 'pool.h',
                                        'Line' => '280',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '313'
                                                           },
                                                    '1' => {
                                                             'name' => 'params',
                                                             'offset' => '8',
                                                             'type' => '37078'
                                                           }
                                                  },
                                        'Name' => 'struct odp_pool_info_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '352991' => {
                                        'BaseType' => '352940',
                                        'Header' => 'pool.h',
                                        'Line' => '283',
                                        'Name' => 'odp_pool_info_t',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '361216' => {
                                        'BaseType' => '37078',
                                        'Name' => 'odp_pool_param_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '36291' => {
                                       'BaseType' => '45',
                                       'Header' => 'stdint.h',
                                       'Line' => '36',
                                       'Name' => 'int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '363903' => {
                                        'BaseType' => '352991',
                                        'Name' => 'odp_pool_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '36430' => {
                                       'Header' => 'event.h',
                                       'Line' => '17',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_event_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '36441' => {
                                       'BaseType' => '36452',
                                       'Header' => 'event.h',
                                       'Line' => '23',
                                       'Name' => 'odp_event_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '36452' => {
                                       'BaseType' => '36430',
                                       'Name' => '_odp_abi_event_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '36479' => {
                                       'Header' => 'buffer.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_buffer_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '36490' => {
                                       'BaseType' => '36501',
                                       'Header' => 'buffer.h',
                                       'Line' => '24',
                                       'Name' => 'odp_buffer_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '36501' => {
                                       'BaseType' => '36479',
                                       'Name' => '_odp_abi_buffer_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '36528' => {
                                       'Header' => 'pool.h',
                                       'Line' => '17',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_pool_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '36539' => {
                                       'BaseType' => '36550',
                                       'Header' => 'pool.h',
                                       'Line' => '23',
                                       'Name' => 'odp_pool_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '36550' => {
                                       'BaseType' => '36528',
                                       'Name' => '_odp_abi_pool_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '36577' => {
                                       'Header' => 'shared_memory.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_shm_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '36588' => {
                                       'BaseType' => '36599',
                                       'Header' => 'shared_memory.h',
                                       'Line' => '21',
                                       'Name' => 'odp_shm_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '36599' => {
                                       'BaseType' => '36577',
                                       'Name' => '_odp_abi_shm_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '366662' => {
                                        'BaseType' => '352710',
                                        'Name' => 'odp_pool_capability_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '36822' => {
                                       'Header' => 'ticketlock_types.h',
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_ticket',
                                                            'offset' => '0',
                                                            'type' => '29573'
                                                          },
                                                   '1' => {
                                                            'name' => 'cur_ticket',
                                                            'offset' => '4',
                                                            'type' => '29573'
                                                          }
                                                 },
                                       'Name' => 'struct odp_ticketlock_s',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '36859' => {
                                       'BaseType' => '36822',
                                       'Header' => 'ticketlock_types.h',
                                       'Line' => '29',
                                       'Name' => 'odp_ticketlock_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '36870' => {
                                       'Header' => 'pool.h',
                                       'Line' => '172',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'num',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '10194'
                                                          },
                                                   '2' => {
                                                            'name' => 'align',
                                                            'offset' => '8',
                                                            'type' => '10194'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-pool.h-172',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '36915' => {
                                       'Header' => 'pool.h',
                                       'Line' => '187',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'num',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '1' => {
                                                            'name' => 'len',
                                                            'offset' => '4',
                                                            'type' => '10194'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_len',
                                                            'offset' => '8',
                                                            'type' => '10194'
                                                          },
                                                   '3' => {
                                                            'name' => 'seg_len',
                                                            'offset' => '12',
                                                            'type' => '10194'
                                                          },
                                                   '4' => {
                                                            'name' => 'uarea_size',
                                                            'offset' => '16',
                                                            'type' => '10194'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-pool.h-187',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '36984' => {
                                       'Header' => 'pool.h',
                                       'Line' => '220',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'num',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-pool.h-220',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '37005' => {
                                       'Header' => 'pool.h',
                                       'Line' => '170',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'buf',
                                                            'offset' => '0',
                                                            'type' => '36870'
                                                          },
                                                   '1' => {
                                                            'name' => 'pkt',
                                                            'offset' => '0',
                                                            'type' => '36915'
                                                          },
                                                   '2' => {
                                                            'name' => 'tmo',
                                                            'offset' => '0',
                                                            'type' => '36984'
                                                          }
                                                 },
                                       'Name' => 'anon-union-pool.h-170',
                                       'Size' => '20',
                                       'Type' => 'Union'
                                     },
                          '37047' => {
                                       'Header' => 'pool.h',
                                       'Line' => '165',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '59'
                                                          },
                                                   '1' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '4',
                                                            'type' => '37005'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pool_param_t',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '37078' => {
                                       'BaseType' => '37047',
                                       'Header' => 'pool.h',
                                       'Line' => '225',
                                       'Name' => 'odp_pool_param_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '370841' => {
                                        'Header' => 'queue.h',
                                        'Line' => '118',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_num',
                                                             'offset' => '0',
                                                             'type' => '10194'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_size',
                                                             'offset' => '4',
                                                             'type' => '10194'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-queue.h-118',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '370874' => {
                                        'Header' => 'queue.h',
                                        'Line' => '131',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_num',
                                                             'offset' => '0',
                                                             'type' => '10194'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_size',
                                                             'offset' => '4',
                                                             'type' => '10194'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-queue.h-131',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '370907' => {
                                        'Header' => 'queue.h',
                                        'Line' => '102',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_queues',
                                                             'offset' => '0',
                                                             'type' => '10194'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_ordered_locks',
                                                             'offset' => '4',
                                                             'type' => '98'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_sched_groups',
                                                             'offset' => '8',
                                                             'type' => '98'
                                                           },
                                                    '3' => {
                                                             'name' => 'sched_prios',
                                                             'offset' => '12',
                                                             'type' => '98'
                                                           },
                                                    '4' => {
                                                             'name' => 'plain',
                                                             'offset' => '16',
                                                             'type' => '370841'
                                                           },
                                                    '5' => {
                                                             'name' => 'sched',
                                                             'offset' => '24',
                                                             'type' => '370874'
                                                           }
                                                  },
                                        'Name' => 'struct odp_queue_capability_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '370992' => {
                                        'BaseType' => '370907',
                                        'Header' => 'queue.h',
                                        'Line' => '143',
                                        'Name' => 'odp_queue_capability_t',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '371113' => {
                                        'Header' => 'queue.h',
                                        'Line' => '429',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '313'
                                                           },
                                                    '1' => {
                                                             'name' => 'param',
                                                             'offset' => '8',
                                                             'type' => '44285'
                                                           }
                                                  },
                                        'Name' => 'struct odp_queue_info_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '371164' => {
                                        'BaseType' => '371113',
                                        'Header' => 'queue.h',
                                        'Line' => '432',
                                        'Name' => 'odp_queue_info_t',
                                        'Size' => '56',
                                        'Type' => 'Typedef'
                                      },
                          '372161' => {
                                        'BaseType' => '36441',
                                        'Name' => 'odp_event_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '37509' => {
                                       'BaseType' => '73',
                                       'Name' => 'uint8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '379990' => {
                                        'BaseType' => '370992',
                                        'Name' => 'odp_queue_capability_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '380' => {
                                     'BaseType' => '59',
                                     'Header' => 'types.h',
                                     'Line' => '133',
                                     'Name' => '__pid_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '383902' => {
                                        'BaseType' => '383908',
                                        'Name' => 'odp_event_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '383908' => {
                                        'BaseType' => '36441',
                                        'Name' => 'odp_event_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '388414' => {
                                        'BaseType' => '371164',
                                        'Name' => 'odp_queue_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '390244' => {
                                        'Header' => 'rwlock_recursive_types.h',
                                        'Line' => '25',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'lock',
                                                             'offset' => '0',
                                                             'type' => '342245'
                                                           },
                                                    '1' => {
                                                             'name' => 'wr_owner',
                                                             'offset' => '4',
                                                             'type' => '59'
                                                           },
                                                    '2' => {
                                                             'name' => 'wr_cnt',
                                                             'offset' => '8',
                                                             'type' => '10194'
                                                           },
                                                    '3' => {
                                                             'name' => 'rd_cnt',
                                                             'offset' => '12',
                                                             'type' => '191'
                                                           }
                                                  },
                                        'Name' => 'struct odp_rwlock_recursive_s',
                                        'Size' => '140',
                                        'Type' => 'Struct'
                                      },
                          '390328' => {
                                        'BaseType' => '390244',
                                        'Header' => 'rwlock_recursive_types.h',
                                        'Line' => '32',
                                        'Name' => 'odp_rwlock_recursive_t',
                                        'Size' => '140',
                                        'Type' => 'Typedef'
                                      },
                          '390523' => {
                                        'BaseType' => '390328',
                                        'Name' => 'odp_rwlock_recursive_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '391' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '392029' => {
                                        'Header' => 'thrmask_types.h',
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'm',
                                                             'offset' => '0',
                                                             'type' => '214'
                                                           }
                                                  },
                                        'Name' => 'struct odp_thrmask_t',
                                        'Size' => '128',
                                        'Type' => 'Struct'
                                      },
                          '392052' => {
                                        'BaseType' => '392029',
                                        'Header' => 'thrmask_types.h',
                                        'Line' => '38',
                                        'Name' => 'odp_thrmask_t',
                                        'Size' => '128',
                                        'Type' => 'Typedef'
                                      },
                          '392063' => {
                                        'Header' => 'schedule.h',
                                        'Line' => '305',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '313'
                                                           },
                                                    '1' => {
                                                             'name' => 'thrmask',
                                                             'offset' => '8',
                                                             'type' => '392052'
                                                           }
                                                  },
                                        'Name' => 'struct odp_schedule_group_info_t',
                                        'Size' => '136',
                                        'Type' => 'Struct'
                                      },
                          '392103' => {
                                        'BaseType' => '392063',
                                        'Header' => 'schedule.h',
                                        'Line' => '308',
                                        'Name' => 'odp_schedule_group_info_t',
                                        'Size' => '136',
                                        'Type' => 'Typedef'
                                      },
                          '394467' => {
                                        'BaseType' => '394473',
                                        'Name' => 'odp_thrmask_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '394473' => {
                                        'BaseType' => '392052',
                                        'Name' => 'odp_thrmask_t const',
                                        'Size' => '128',
                                        'Type' => 'Const'
                                      },
                          '394572' => {
                                        'BaseType' => '392052',
                                        'Name' => 'odp_thrmask_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '394604' => {
                                        'BaseType' => '392103',
                                        'Name' => 'odp_schedule_group_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '404' => {
                                     'BaseType' => '148',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '41335' => {
                                       'BaseType' => '91',
                                       'Header' => 'stdint.h',
                                       'Line' => '49',
                                       'Name' => 'uint16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '41389' => {
                                       'BaseType' => '41335',
                                       'Header' => 'byteorder_types.h',
                                       'Line' => '64',
                                       'Name' => 'odp_u16le_t',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '41400' => {
                                       'BaseType' => '41335',
                                       'Header' => 'byteorder_types.h',
                                       'Line' => '65',
                                       'Name' => 'odp_u16be_t',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '41411' => {
                                       'BaseType' => '10194',
                                       'Header' => 'byteorder_types.h',
                                       'Line' => '67',
                                       'Name' => 'odp_u32le_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '41422' => {
                                       'BaseType' => '10194',
                                       'Header' => 'byteorder_types.h',
                                       'Line' => '68',
                                       'Name' => 'odp_u32be_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '41433' => {
                                       'BaseType' => '105',
                                       'Header' => 'byteorder_types.h',
                                       'Line' => '70',
                                       'Name' => 'odp_u64le_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '41444' => {
                                       'BaseType' => '105',
                                       'Header' => 'byteorder_types.h',
                                       'Line' => '71',
                                       'Name' => 'odp_u64be_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '42183' => {
                                       'BaseType' => '59',
                                       'Header' => 'std_types.h',
                                       'Line' => '30',
                                       'Name' => 'odp_bool_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '42201' => {
                                       'Header' => 'event.h',
                                       'Line' => '27',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_EVENT_BUFFER',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_EVENT_PACKET',
                                                            'value' => '2'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_EVENT_TIMEOUT',
                                                            'value' => '3'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_EVENT_CRYPTO_COMPL',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum odp_event_type_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '42308' => {
                                       'Header' => 'classification.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_cos_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '42340' => {
                                       'Header' => 'classification.h',
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_pmr_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '42351' => {
                                       'BaseType' => '42362',
                                       'Header' => 'classification.h',
                                       'Line' => '24',
                                       'Name' => 'odp_cos_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '42362' => {
                                       'BaseType' => '42308',
                                       'Name' => '_odp_abi_cos_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42368' => {
                                       'BaseType' => '42379',
                                       'Header' => 'classification.h',
                                       'Line' => '25',
                                       'Name' => 'odp_pmr_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '42379' => {
                                       'BaseType' => '42340',
                                       'Name' => '_odp_abi_pmr_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42417' => {
                                       'Header' => 'packet.h',
                                       'Line' => '17',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_packet_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '42428' => {
                                       'BaseType' => '42439',
                                       'Header' => 'packet.h',
                                       'Line' => '26',
                                       'Name' => 'odp_packet_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '42439' => {
                                       'BaseType' => '42417',
                                       'Name' => '_odp_abi_packet_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42937' => {
                                       'Header' => 'packet_io_types.h',
                                       'Line' => '29',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unused_dummy_var',
                                                            'offset' => '0',
                                                            'type' => '73'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_io_types.h-29',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '42958' => {
                                       'BaseType' => '42969',
                                       'Header' => 'packet_io_types.h',
                                       'Line' => '29',
                                       'Name' => 'odp_pktio_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '42969' => {
                                       'BaseType' => '42937',
                                       'Name' => 'anon-struct-packet_io_types.h-29*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42975' => {
                                       'Header' => 'packet_io_types.h',
                                       'Line' => '32',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pktio',
                                                            'offset' => '0',
                                                            'type' => '42958'
                                                          },
                                                   '1' => {
                                                            'name' => 'index',
                                                            'offset' => '8',
                                                            'type' => '59'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktin_queue_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '43012' => {
                                       'BaseType' => '42975',
                                       'Header' => 'packet_io_types.h',
                                       'Line' => '35',
                                       'Name' => 'odp_pktin_queue_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '43023' => {
                                       'Header' => 'packet_io_types.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pktio',
                                                            'offset' => '0',
                                                            'type' => '42958'
                                                          },
                                                   '1' => {
                                                            'name' => 'index',
                                                            'offset' => '8',
                                                            'type' => '59'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktout_queue_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '43060' => {
                                       'BaseType' => '43023',
                                       'Header' => 'packet_io_types.h',
                                       'Line' => '41',
                                       'Name' => 'odp_pktout_queue_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '43092' => {
                                       'Header' => 'queue.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dummy',
                                                            'offset' => '0',
                                                            'type' => '148'
                                                          }
                                                 },
                                       'Name' => 'struct _odp_abi_queue_t',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '43103' => {
                                       'BaseType' => '43114',
                                       'Header' => 'queue.h',
                                       'Line' => '21',
                                       'Name' => 'odp_queue_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '43114' => {
                                       'BaseType' => '43092',
                                       'Name' => '_odp_abi_queue_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43120' => {
                                       'Header' => 'classification.h',
                                       'Line' => '64',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'len',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '1' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ethtype_0',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '10' => {
                                                             'bitfield' => '1',
                                                             'name' => 'tcp_sport',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '11' => {
                                                             'bitfield' => '1',
                                                             'name' => 'sip_addr',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '12' => {
                                                             'bitfield' => '1',
                                                             'name' => 'dip_addr',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '13' => {
                                                             'bitfield' => '1',
                                                             'name' => 'sip6_addr',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '14' => {
                                                             'bitfield' => '1',
                                                             'name' => 'dip6_addr',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '15' => {
                                                             'bitfield' => '1',
                                                             'name' => 'ipsec_spi',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '16' => {
                                                             'bitfield' => '1',
                                                             'name' => 'ld_vni',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '17' => {
                                                             'bitfield' => '1',
                                                             'name' => 'custom_frame',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ethtype_x',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'vlan_id_0',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'vlan_id_x',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'dmac',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '6' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ip_proto',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '7' => {
                                                            'bitfield' => '1',
                                                            'name' => 'udp_dport',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '8' => {
                                                            'bitfield' => '1',
                                                            'name' => 'tcp_dport',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '9' => {
                                                            'bitfield' => '1',
                                                            'name' => 'udp_sport',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-classification.h-64',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '43399' => {
                                       'Header' => 'classification.h',
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bit',
                                                            'offset' => '0',
                                                            'type' => '43120'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'union odp_cls_pmr_terms_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '43434' => {
                                       'BaseType' => '43399',
                                       'Header' => 'classification.h',
                                       'Line' => '108',
                                       'Name' => 'odp_cls_pmr_terms_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '43445' => {
                                       'Header' => 'classification.h',
                                       'Line' => '114',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'supported_terms',
                                                            'offset' => '0',
                                                            'type' => '43434'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_pmr_terms',
                                                            'offset' => '8',
                                                            'type' => '98'
                                                          },
                                                   '2' => {
                                                            'name' => 'available_pmr_terms',
                                                            'offset' => '12',
                                                            'type' => '98'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_cos',
                                                            'offset' => '16',
                                                            'type' => '98'
                                                          },
                                                   '4' => {
                                                            'name' => 'pmr_range_supported',
                                                            'offset' => '20',
                                                            'type' => '42183'
                                                          }
                                                 },
                                       'Name' => 'struct odp_cls_capability_t',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '43518' => {
                                       'BaseType' => '43445',
                                       'Header' => 'classification.h',
                                       'Line' => '131',
                                       'Name' => 'odp_cls_capability_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '43550' => {
                                       'Header' => 'classification.h',
                                       'Line' => '139',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_COS_DROP_POOL',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_COS_DROP_NEVER',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_cls_drop_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '43561' => {
                                       'Header' => 'classification.h',
                                       'Line' => '166',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'queue',
                                                            'offset' => '0',
                                                            'type' => '43103'
                                                          },
                                                   '1' => {
                                                            'name' => 'pool',
                                                            'offset' => '8',
                                                            'type' => '36539'
                                                          },
                                                   '2' => {
                                                            'name' => 'drop_policy',
                                                            'offset' => '16',
                                                            'type' => '43550'
                                                          }
                                                 },
                                       'Name' => 'struct odp_cls_cos_param',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '43610' => {
                                       'BaseType' => '43561',
                                       'Header' => 'classification.h',
                                       'Line' => '170',
                                       'Name' => 'odp_cls_cos_param_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '43745' => {
                                       'Header' => 'classification.h',
                                       'Line' => '358',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PMR_LEN',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PMR_ETHTYPE_0',
                                                            'value' => '1'
                                                          },
                                                   '10' => {
                                                             'name' => 'ODP_PMR_TCP_SPORT',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'ODP_PMR_SIP_ADDR',
                                                             'value' => '11'
                                                           },
                                                   '12' => {
                                                             'name' => 'ODP_PMR_DIP_ADDR',
                                                             'value' => '12'
                                                           },
                                                   '13' => {
                                                             'name' => 'ODP_PMR_SIP6_ADDR',
                                                             'value' => '13'
                                                           },
                                                   '14' => {
                                                             'name' => 'ODP_PMR_DIP6_ADDR',
                                                             'value' => '14'
                                                           },
                                                   '15' => {
                                                             'name' => 'ODP_PMR_IPSEC_SPI',
                                                             'value' => '15'
                                                           },
                                                   '16' => {
                                                             'name' => 'ODP_PMR_LD_VNI',
                                                             'value' => '16'
                                                           },
                                                   '17' => {
                                                             'name' => 'ODP_PMR_CUSTOM_FRAME',
                                                             'value' => '17'
                                                           },
                                                   '18' => {
                                                             'name' => 'ODP_PMR_INNER_HDR_OFF',
                                                             'value' => '32'
                                                           },
                                                   '2' => {
                                                            'name' => 'ODP_PMR_ETHTYPE_X',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_PMR_VLAN_ID_0',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'ODP_PMR_VLAN_ID_X',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'ODP_PMR_DMAC',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'ODP_PMR_IPPROTO',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'ODP_PMR_UDP_DPORT',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'ODP_PMR_TCP_DPORT',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'ODP_PMR_UDP_SPORT',
                                                            'value' => '9'
                                                          }
                                                 },
                                       'Name' => 'enum odp_cls_pmr_term_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '43757' => {
                                       'Header' => 'classification.h',
                                       'Line' => '372',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '27099'
                                                          },
                                                   '1' => {
                                                            'name' => 'mask',
                                                            'offset' => '8',
                                                            'type' => '27099'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-classification.h-372',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '43800' => {
                                       'Header' => 'classification.h',
                                       'Line' => '381',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'val_start',
                                                            'offset' => '0',
                                                            'type' => '27099'
                                                          },
                                                   '1' => {
                                                            'name' => 'val_end',
                                                            'offset' => '8',
                                                            'type' => '27099'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-classification.h-381',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '43836' => {
                                       'Header' => 'classification.h',
                                       'Line' => '370',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'match',
                                                            'offset' => '0',
                                                            'type' => '43757'
                                                          },
                                                   '1' => {
                                                            'name' => 'range',
                                                            'offset' => '0',
                                                            'type' => '43800'
                                                          }
                                                 },
                                       'Name' => 'anon-union-classification.h-370',
                                       'Size' => '16',
                                       'Type' => 'Union'
                                     },
                          '43870' => {
                                       'Header' => 'classification.h',
                                       'Line' => '363',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'term',
                                                            'offset' => '0',
                                                            'type' => '43745'
                                                          },
                                                   '1' => {
                                                            'name' => 'range_term',
                                                            'offset' => '4',
                                                            'type' => '42183'
                                                          },
                                                   '2' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '43836'
                                                          },
                                                   '3' => {
                                                            'name' => 'val_sz',
                                                            'offset' => '24',
                                                            'type' => '10194'
                                                          },
                                                   '4' => {
                                                            'name' => 'offset',
                                                            'offset' => '28',
                                                            'type' => '10194'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pmr_param_t',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '43942' => {
                                       'BaseType' => '43870',
                                       'Header' => 'classification.h',
                                       'Line' => '395',
                                       'Name' => 'odp_pmr_param_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '44003' => {
                                       'BaseType' => '59',
                                       'Header' => 'schedule_types.h',
                                       'Line' => '28',
                                       'Name' => 'odp_schedule_prio_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '44014' => {
                                       'BaseType' => '59',
                                       'Header' => 'schedule_types.h',
                                       'Line' => '38',
                                       'Name' => 'odp_schedule_sync_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '44025' => {
                                       'BaseType' => '59',
                                       'Header' => 'schedule_types.h',
                                       'Line' => '44',
                                       'Name' => 'odp_schedule_group_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '44036' => {
                                       'Header' => 'schedule_types.h',
                                       'Line' => '130',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'prio',
                                                            'offset' => '0',
                                                            'type' => '44003'
                                                          },
                                                   '1' => {
                                                            'name' => 'sync',
                                                            'offset' => '4',
                                                            'type' => '44014'
                                                          },
                                                   '2' => {
                                                            'name' => 'group',
                                                            'offset' => '8',
                                                            'type' => '44025'
                                                          },
                                                   '3' => {
                                                            'name' => 'lock_count',
                                                            'offset' => '12',
                                                            'type' => '98'
                                                          }
                                                 },
                                       'Name' => 'struct odp_schedule_param_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '44097' => {
                                       'BaseType' => '44036',
                                       'Header' => 'schedule_types.h',
                                       'Line' => '150',
                                       'Name' => 'odp_schedule_param_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '44108' => {
                                       'Header' => 'queue.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_QUEUE_TYPE_PLAIN',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_QUEUE_TYPE_SCHED',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_queue_type_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '44133' => {
                                       'BaseType' => '44108',
                                       'Header' => 'queue.h',
                                       'Line' => '66',
                                       'Name' => 'odp_queue_type_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '44144' => {
                                       'Header' => 'queue.h',
                                       'Line' => '71',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_QUEUE_OP_MT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_QUEUE_OP_MT_UNSAFE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_QUEUE_OP_DISABLED',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum odp_queue_op_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '44175' => {
                                       'BaseType' => '44144',
                                       'Header' => 'queue.h',
                                       'Line' => '97',
                                       'Name' => 'odp_queue_op_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '44186' => {
                                       'Header' => 'queue.h',
                                       'Line' => '148',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '44133'
                                                          },
                                                   '1' => {
                                                            'name' => 'enq_mode',
                                                            'offset' => '4',
                                                            'type' => '44175'
                                                          },
                                                   '2' => {
                                                            'name' => 'deq_mode',
                                                            'offset' => '8',
                                                            'type' => '44175'
                                                          },
                                                   '3' => {
                                                            'name' => 'sched',
                                                            'offset' => '12',
                                                            'type' => '44097'
                                                          },
                                                   '4' => {
                                                            'name' => 'context',
                                                            'offset' => '32',
                                                            'type' => '391'
                                                          },
                                                   '5' => {
                                                            'name' => 'context_len',
                                                            'offset' => '40',
                                                            'type' => '10194'
                                                          },
                                                   '6' => {
                                                            'name' => 'size',
                                                            'offset' => '44',
                                                            'type' => '10194'
                                                          }
                                                 },
                                       'Name' => 'struct odp_queue_param_t',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '44285' => {
                                       'BaseType' => '44186',
                                       'Header' => 'queue.h',
                                       'Line' => '205',
                                       'Name' => 'odp_queue_param_t',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '45' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '451997' => {
                                        'Header' => 'shared_memory.h',
                                        'Line' => '83',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_blocks',
                                                             'offset' => '0',
                                                             'type' => '98'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_size',
                                                             'offset' => '8',
                                                             'type' => '105'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_align',
                                                             'offset' => '16',
                                                             'type' => '105'
                                                           }
                                                  },
                                        'Name' => 'struct odp_shm_capability_t',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '452046' => {
                                        'BaseType' => '451997',
                                        'Header' => 'shared_memory.h',
                                        'Line' => '102',
                                        'Name' => 'odp_shm_capability_t',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '452442' => {
                                        'BaseType' => '452046',
                                        'Name' => 'odp_shm_capability_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '457625' => {
                                        'Header' => 'spinlock_recursive_types.h',
                                        'Line' => '24',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'lock',
                                                             'offset' => '0',
                                                             'type' => '155'
                                                           },
                                                    '1' => {
                                                             'name' => 'owner',
                                                             'offset' => '4',
                                                             'type' => '59'
                                                           },
                                                    '2' => {
                                                             'name' => 'cnt',
                                                             'offset' => '8',
                                                             'type' => '10194'
                                                           }
                                                  },
                                        'Name' => 'struct odp_spinlock_recursive_s',
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '457674' => {
                                        'BaseType' => '457625',
                                        'Header' => 'spinlock_recursive_types.h',
                                        'Line' => '30',
                                        'Name' => 'odp_spinlock_recursive_t',
                                        'Size' => '12',
                                        'Type' => 'Typedef'
                                      },
                          '457750' => {
                                        'BaseType' => '457674',
                                        'Name' => 'odp_spinlock_recursive_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '45997' => {
                                       'Header' => 'packet_io_stats.h',
                                       'Line' => '34',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in_octets',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '1' => {
                                                            'name' => 'in_ucast_pkts',
                                                            'offset' => '8',
                                                            'type' => '105'
                                                          },
                                                   '2' => {
                                                            'name' => 'in_discards',
                                                            'offset' => '16',
                                                            'type' => '105'
                                                          },
                                                   '3' => {
                                                            'name' => 'in_errors',
                                                            'offset' => '24',
                                                            'type' => '105'
                                                          },
                                                   '4' => {
                                                            'name' => 'in_unknown_protos',
                                                            'offset' => '32',
                                                            'type' => '105'
                                                          },
                                                   '5' => {
                                                            'name' => 'out_octets',
                                                            'offset' => '40',
                                                            'type' => '105'
                                                          },
                                                   '6' => {
                                                            'name' => 'out_ucast_pkts',
                                                            'offset' => '48',
                                                            'type' => '105'
                                                          },
                                                   '7' => {
                                                            'name' => 'out_discards',
                                                            'offset' => '56',
                                                            'type' => '105'
                                                          },
                                                   '8' => {
                                                            'name' => 'out_errors',
                                                            'offset' => '64',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_stats_t',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '46118' => {
                                       'BaseType' => '45997',
                                       'Header' => 'packet_io_stats.h',
                                       'Line' => '107',
                                       'Name' => 'odp_pktio_stats_t',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '46129' => {
                                       'Header' => 'time_types.h',
                                       'Line' => '30',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'u64',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '1' => {
                                                            'name' => 'nsec',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '2' => {
                                                            'name' => 'count',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'anon-union-time_types.h-30',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '46171' => {
                                       'Header' => 'time_types.h',
                                       'Line' => '28',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '0',
                                                            'type' => '46129'
                                                          }
                                                 },
                                       'Name' => 'struct odp_time_t',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '46190' => {
                                       'BaseType' => '46171',
                                       'Header' => 'time_types.h',
                                       'Line' => '41',
                                       'Name' => 'odp_time_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46201' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '81',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PKTIN_MODE_DIRECT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PKTIN_MODE_SCHED',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_PKTIN_MODE_QUEUE',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_PKTIN_MODE_DISABLED',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum odp_pktin_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '46238' => {
                                       'BaseType' => '46201',
                                       'Header' => 'packet_io.h',
                                       'Line' => '90',
                                       'Name' => 'odp_pktin_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '46249' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '95',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PKTOUT_MODE_DIRECT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PKTOUT_MODE_QUEUE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_PKTOUT_MODE_TM',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_PKTOUT_MODE_DISABLED',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum odp_pktout_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '46286' => {
                                       'BaseType' => '46249',
                                       'Header' => 'packet_io.h',
                                       'Line' => '104',
                                       'Name' => 'odp_pktout_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '46297' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '114',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4_udp',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '1' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4_tcp',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv6_udp',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv6_tcp',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv6',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_io.h-114',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '46396' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '112',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'proto',
                                                            'offset' => '0',
                                                            'type' => '46297'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          }
                                                 },
                                       'Name' => 'union odp_pktin_hash_proto_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '46431' => {
                                       'BaseType' => '46396',
                                       'Header' => 'packet_io.h',
                                       'Line' => '131',
                                       'Name' => 'odp_pktin_hash_proto_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '46442' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '136',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PKTIO_OP_MT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PKTIO_OP_MT_UNSAFE',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum odp_pktio_op_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '46467' => {
                                       'BaseType' => '46442',
                                       'Header' => 'packet_io.h',
                                       'Line' => '152',
                                       'Name' => 'odp_pktio_op_mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '46478' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '157',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'op_mode',
                                                            'offset' => '0',
                                                            'type' => '46467'
                                                          },
                                                   '1' => {
                                                            'name' => 'classifier_enable',
                                                            'offset' => '4',
                                                            'type' => '42183'
                                                          },
                                                   '2' => {
                                                            'name' => 'hash_enable',
                                                            'offset' => '8',
                                                            'type' => '42183'
                                                          },
                                                   '3' => {
                                                            'name' => 'hash_proto',
                                                            'offset' => '12',
                                                            'type' => '46431'
                                                          },
                                                   '4' => {
                                                            'name' => 'num_queues',
                                                            'offset' => '16',
                                                            'type' => '98'
                                                          },
                                                   '5' => {
                                                            'name' => 'queue_param',
                                                            'offset' => '24',
                                                            'type' => '44285'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktin_queue_param_t',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '46563' => {
                                       'BaseType' => '46478',
                                       'Header' => 'packet_io.h',
                                       'Line' => '209',
                                       'Name' => 'odp_pktin_queue_param_t',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '46574' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '217',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'op_mode',
                                                            'offset' => '0',
                                                            'type' => '46467'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_queues',
                                                            'offset' => '4',
                                                            'type' => '98'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktout_queue_param_t',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '46611' => {
                                       'BaseType' => '46574',
                                       'Header' => 'packet_io.h',
                                       'Line' => '229',
                                       'Name' => 'odp_pktout_queue_param_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46622' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '237',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in_mode',
                                                            'offset' => '0',
                                                            'type' => '46238'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_mode',
                                                            'offset' => '4',
                                                            'type' => '46286'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_param_t',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '46659' => {
                                       'BaseType' => '46622',
                                       'Header' => 'packet_io.h',
                                       'Line' => '248',
                                       'Name' => 'odp_pktio_param_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46670' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '266',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ts_all',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '1' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ts_ptp',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '10' => {
                                                             'bitfield' => '1',
                                                             'name' => 'drop_sctp_err',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'udp_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'tcp_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'sctp_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '6' => {
                                                            'bitfield' => '1',
                                                            'name' => 'drop_ipv4_err',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '7' => {
                                                            'bitfield' => '1',
                                                            'name' => 'drop_ipv6_err',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '8' => {
                                                            'bitfield' => '1',
                                                            'name' => 'drop_udp_err',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '9' => {
                                                            'bitfield' => '1',
                                                            'name' => 'drop_tcp_err',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_io.h-266',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '46856' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '264',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bit',
                                                            'offset' => '0',
                                                            'type' => '46670'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'union odp_pktin_config_opt_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '46894' => {
                                       'BaseType' => '46856',
                                       'Header' => 'packet_io.h',
                                       'Line' => '308',
                                       'Name' => 'odp_pktin_config_opt_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46906' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '326',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ipv4_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '1' => {
                                                            'bitfield' => '1',
                                                            'name' => 'udp_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'tcp_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'sctp_chksum',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_io.h-326',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '46980' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '324',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bit',
                                                            'offset' => '0',
                                                            'type' => '46906'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          }
                                                 },
                                       'Name' => 'union odp_pktout_config_opt_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '47018' => {
                                       'BaseType' => '46980',
                                       'Header' => 'packet_io.h',
                                       'Line' => '346',
                                       'Name' => 'odp_pktout_config_opt_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '47030' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '351',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_PKTIO_PARSER_LAYER_NONE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_PKTIO_PARSER_LAYER_L2',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_PKTIO_PARSER_LAYER_L3',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_PKTIO_PARSER_LAYER_L4',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'ODP_PKTIO_PARSER_LAYER_ALL',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum odp_pktio_parser_layer_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '47074' => {
                                       'BaseType' => '47030',
                                       'Header' => 'packet_io.h',
                                       'Line' => '367',
                                       'Name' => 'odp_pktio_parser_layer_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '47086' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '372',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'layer',
                                                            'offset' => '0',
                                                            'type' => '47074'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_parser_config_t',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '47113' => {
                                       'BaseType' => '47086',
                                       'Header' => 'packet_io.h',
                                       'Line' => '379',
                                       'Name' => 'odp_pktio_parser_config_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '47125' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '388',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pktin',
                                                            'offset' => '0',
                                                            'type' => '46894'
                                                          },
                                                   '1' => {
                                                            'name' => 'pktout',
                                                            'offset' => '8',
                                                            'type' => '47018'
                                                          },
                                                   '2' => {
                                                            'name' => 'parser',
                                                            'offset' => '16',
                                                            'type' => '47113'
                                                          },
                                                   '3' => {
                                                            'name' => 'enable_loop',
                                                            'offset' => '20',
                                                            'type' => '42183'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_config_t',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '47191' => {
                                       'BaseType' => '47125',
                                       'Header' => 'packet_io.h',
                                       'Line' => '410',
                                       'Name' => 'odp_pktio_config_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '47203' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '419',
                                       'Memb' => {
                                                   '0' => {
                                                            'bitfield' => '1',
                                                            'name' => 'promisc_mode',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-packet_io.h-419',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '47229' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '417',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'op',
                                                            'offset' => '0',
                                                            'type' => '47203'
                                                          },
                                                   '1' => {
                                                            'name' => 'all_bits',
                                                            'offset' => '0',
                                                            'type' => '10194'
                                                          }
                                                 },
                                       'Name' => 'union odp_pktio_set_op_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '47266' => {
                                       'BaseType' => '47229',
                                       'Header' => 'packet_io.h',
                                       'Line' => '427',
                                       'Name' => 'odp_pktio_set_op_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '47278' => {
                                       'Header' => 'packet_io.h',
                                       'Line' => '432',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_input_queues',
                                                            'offset' => '0',
                                                            'type' => '98'
                                                          },
                                                   '1' => {
                                                            'name' => 'max_output_queues',
                                                            'offset' => '4',
                                                            'type' => '98'
                                                          },
                                                   '2' => {
                                                            'name' => 'config',
                                                            'offset' => '8',
                                                            'type' => '47191'
                                                          },
                                                   '3' => {
                                                            'name' => 'set_op',
                                                            'offset' => '32',
                                                            'type' => '47266'
                                                          },
                                                   '4' => {
                                                            'name' => 'loop_supported',
                                                            'offset' => '36',
                                                            'type' => '42183'
                                                          }
                                                 },
                                       'Name' => 'struct odp_pktio_capability_t',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '47357' => {
                                       'BaseType' => '47278',
                                       'Header' => 'packet_io.h',
                                       'Line' => '453',
                                       'Name' => 'odp_pktio_capability_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '479955' => {
                                        'BaseType' => '391',
                                        'Header' => 'types.h',
                                        'Line' => '150',
                                        'Name' => '__timer_t',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '480049' => {
                                        'BaseType' => '479955',
                                        'Header' => 'time.h',
                                        'Line' => '103',
                                        'Name' => 'timer_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '480178' => {
                                        'BaseType' => '116',
                                        'Header' => 'pthreadtypes.h',
                                        'Line' => '60',
                                        'Name' => 'pthread_t',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '484003' => {
                                        'BaseType' => '484014',
                                        'Header' => 'timer_types.h',
                                        'Line' => '29',
                                        'Name' => 'odp_timer_pool_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '484014' => {
                                        'BaseType' => '484020',
                                        'Name' => 'struct odp_timer_pool_s*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '484020' => {
                                        'Line' => '167',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cur_tick',
                                                             'offset' => '0',
                                                             'type' => '29562'
                                                           },
                                                    '1' => {
                                                             'name' => 'min_rel_tck',
                                                             'offset' => '8',
                                                             'type' => '105'
                                                           },
                                                    '10' => {
                                                              'name' => 'param',
                                                              'offset' => '64',
                                                              'type' => '484471'
                                                            },
                                                    '11' => {
                                                              'name' => 'name',
                                                              'offset' => '104',
                                                              'type' => '947'
                                                            },
                                                    '12' => {
                                                              'name' => 'shm',
                                                              'offset' => '136',
                                                              'type' => '36588'
                                                            },
                                                    '13' => {
                                                              'name' => 'timerid',
                                                              'offset' => '144',
                                                              'type' => '480049'
                                                            },
                                                    '14' => {
                                                              'name' => 'notify_overrun',
                                                              'offset' => '152',
                                                              'type' => '59'
                                                            },
                                                    '15' => {
                                                              'name' => 'timer_thread',
                                                              'offset' => '160',
                                                              'type' => '480178'
                                                            },
                                                    '16' => {
                                                              'name' => 'timer_thread_id',
                                                              'offset' => '168',
                                                              'type' => '922'
                                                            },
                                                    '17' => {
                                                              'name' => 'timer_thread_exit',
                                                              'offset' => '172',
                                                              'type' => '59'
                                                            },
                                                    '2' => {
                                                             'name' => 'max_rel_tck',
                                                             'offset' => '16',
                                                             'type' => '105'
                                                           },
                                                    '3' => {
                                                             'name' => 'tick_buf',
                                                             'offset' => '24',
                                                             'type' => '484718'
                                                           },
                                                    '4' => {
                                                             'name' => 'timers',
                                                             'offset' => '32',
                                                             'type' => '484724'
                                                           },
                                                    '5' => {
                                                             'name' => 'high_wm',
                                                             'offset' => '40',
                                                             'type' => '29573'
                                                           },
                                                    '6' => {
                                                             'name' => 'lock',
                                                             'offset' => '44',
                                                             'type' => '155'
                                                           },
                                                    '7' => {
                                                             'name' => 'num_alloc',
                                                             'offset' => '48',
                                                             'type' => '10194'
                                                           },
                                                    '8' => {
                                                             'name' => 'first_free',
                                                             'offset' => '52',
                                                             'type' => '10194'
                                                           },
                                                    '9' => {
                                                             'name' => 'tp_idx',
                                                             'offset' => '56',
                                                             'type' => '10194'
                                                           }
                                                  },
                                        'Name' => 'struct odp_timer_pool_s',
                                        'PrivateABI' => 1,
                                        'Size' => '176',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Struct'
                                      },
                          '484249' => {
                                        'Header' => 'timer_types.h',
                                        'Line' => '35',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'unused_dummy_var',
                                                             'offset' => '0',
                                                             'type' => '73'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-timer_types.h-35',
                                        'Size' => '1',
                                        'Type' => 'Struct'
                                      },
                          '484270' => {
                                        'BaseType' => '484281',
                                        'Header' => 'timer_types.h',
                                        'Line' => '35',
                                        'Name' => 'odp_timer_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '484281' => {
                                        'BaseType' => '484249',
                                        'Name' => 'anon-struct-timer_types.h-35*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '484346' => {
                                        'Header' => 'timer.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_CLOCK_CPU',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_CLOCK_EXT',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum odp_timer_clk_src_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '484471' => {
                                        'Header' => 'timer.h',
                                        'Line' => '108',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'res_ns',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                    '1' => {
                                                             'name' => 'min_tmo',
                                                             'offset' => '8',
                                                             'type' => '105'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_tmo',
                                                             'offset' => '16',
                                                             'type' => '105'
                                                           },
                                                    '3' => {
                                                             'name' => 'num_timers',
                                                             'offset' => '24',
                                                             'type' => '10194'
                                                           },
                                                    '4' => {
                                                             'name' => 'priv',
                                                             'offset' => '28',
                                                             'type' => '59'
                                                           },
                                                    '5' => {
                                                             'name' => 'clk_src',
                                                             'offset' => '32',
                                                             'type' => '484346'
                                                           }
                                                  },
                                        'Name' => 'struct odp_timer_pool_param_t',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '484539' => {
                                        'Header' => 'timer.h',
                                        'Line' => '184',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'param',
                                                             'offset' => '0',
                                                             'type' => '484471'
                                                           },
                                                    '1' => {
                                                             'name' => 'cur_timers',
                                                             'offset' => '40',
                                                             'type' => '10194'
                                                           },
                                                    '2' => {
                                                             'name' => 'hwm_timers',
                                                             'offset' => '44',
                                                             'type' => '10194'
                                                           },
                                                    '3' => {
                                                             'name' => 'name',
                                                             'offset' => '48',
                                                             'type' => '313'
                                                           }
                                                  },
                                        'Name' => 'struct odp_timer_pool_info_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '484622' => {
                                        'Line' => '92',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'exp_tck',
                                                             'offset' => '0',
                                                             'type' => '29562'
                                                           },
                                                    '1' => {
                                                             'name' => 'tmo_buf',
                                                             'offset' => '8',
                                                             'type' => '36490'
                                                           }
                                                  },
                                        'Name' => 'struct tick_buf_s',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Struct'
                                      },
                          '484659' => {
                                        'BaseType' => '484622',
                                        'Line' => '106',
                                        'Name' => 'tick_buf_t',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Typedef'
                                      },
                          '484670' => {
                                        'Line' => '117',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'user_ptr',
                                                             'offset' => '0',
                                                             'type' => '391'
                                                           },
                                                    '1' => {
                                                             'name' => 'queue',
                                                             'offset' => '8',
                                                             'type' => '43103'
                                                           }
                                                  },
                                        'Name' => 'struct odp_timer_s',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Struct'
                                      },
                          '484707' => {
                                        'BaseType' => '484670',
                                        'Line' => '120',
                                        'Name' => 'odp_timer',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'odp_timer.c',
                                        'Type' => 'Typedef'
                                      },
                          '484718' => {
                                        'BaseType' => '484659',
                                        'Name' => 'tick_buf_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '484724' => {
                                        'BaseType' => '484707',
                                        'Name' => 'odp_timer*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '48844' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '424',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_NONE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_DATA_SIZE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_KEY_SIZE',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_ICV_CHECK',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'ODP_CRYPTO_ALG_ERR_IV_INVALID',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum odp_crypto_alg_err_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '48884' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '436',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ODP_CRYPTO_HW_ERR_NONE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ODP_CRYPTO_HW_ERR_DMA',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'ODP_CRYPTO_HW_ERR_BP_DEPLETED',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum odp_crypto_hw_err_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '48896' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '441',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'alg_err',
                                                            'offset' => '0',
                                                            'type' => '48844'
                                                          },
                                                   '1' => {
                                                            'name' => 'hw_err',
                                                            'offset' => '4',
                                                            'type' => '48884'
                                                          }
                                                 },
                                       'Name' => 'struct odp_crypto_compl_status',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '48936' => {
                                       'BaseType' => '48896',
                                       'Header' => 'crypto.h',
                                       'Line' => '448',
                                       'Name' => 'odp_crypto_compl_status_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '48948' => {
                                       'Header' => 'crypto.h',
                                       'Line' => '453',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ok',
                                                            'offset' => '0',
                                                            'type' => '42183'
                                                          },
                                                   '1' => {
                                                            'name' => 'ctx',
                                                            'offset' => '8',
                                                            'type' => '391'
                                                          },
                                                   '2' => {
                                                            'name' => 'pkt',
                                                            'offset' => '16',
                                                            'type' => '42428'
                                                          },
                                                   '3' => {
                                                            'name' => 'cipher_status',
                                                            'offset' => '24',
                                                            'type' => '48936'
                                                          },
                                                   '4' => {
                                                            'name' => 'auth_status',
                                                            'offset' => '32',
                                                            'type' => '48936'
                                                          }
                                                 },
                                       'Name' => 'struct odp_crypto_op_result',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '49026' => {
                                       'BaseType' => '48948',
                                       'Header' => 'crypto.h',
                                       'Line' => '469',
                                       'Name' => 'odp_crypto_op_result_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '490757' => {
                                        'BaseType' => '490763',
                                        'Name' => 'odp_timer_pool_param_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '490763' => {
                                        'BaseType' => '484471',
                                        'Name' => 'odp_timer_pool_param_t const',
                                        'Size' => '40',
                                        'Type' => 'Const'
                                      },
                          '491012' => {
                                        'BaseType' => '484539',
                                        'Name' => 'odp_timer_pool_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '49676' => {
                                       'BaseType' => '73',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '497631' => {
                                        'BaseType' => '41335',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '110',
                                        'Name' => 'odp_tm_percent_t',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '497642' => {
                                        'BaseType' => '105',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '115',
                                        'Name' => 'odp_tm_handle_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '497653' => {
                                        'BaseType' => '497642',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '138',
                                        'Name' => 'odp_tm_shaper_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '497664' => {
                                        'BaseType' => '497642',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '144',
                                        'Name' => 'odp_tm_sched_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '497675' => {
                                        'BaseType' => '497642',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '151',
                                        'Name' => 'odp_tm_threshold_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '497686' => {
                                        'BaseType' => '497642',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '157',
                                        'Name' => 'odp_tm_wred_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '498447' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '247',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_num_tm_nodes',
                                                             'offset' => '0',
                                                             'type' => '10194'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_fanin_per_node',
                                                             'offset' => '4',
                                                             'type' => '10194'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_priority',
                                                             'offset' => '8',
                                                             'type' => '73'
                                                           },
                                                    '3' => {
                                                             'name' => 'min_weight',
                                                             'offset' => '9',
                                                             'type' => '73'
                                                           },
                                                    '4' => {
                                                             'name' => 'max_weight',
                                                             'offset' => '10',
                                                             'type' => '73'
                                                           },
                                                    '5' => {
                                                             'name' => 'tm_node_shaper_supported',
                                                             'offset' => '12',
                                                             'type' => '42183'
                                                           },
                                                    '6' => {
                                                             'name' => 'tm_node_wred_supported',
                                                             'offset' => '16',
                                                             'type' => '42183'
                                                           },
                                                    '7' => {
                                                             'name' => 'tm_node_dual_slope_supported',
                                                             'offset' => '20',
                                                             'type' => '42183'
                                                           },
                                                    '8' => {
                                                             'name' => 'fair_queuing_supported',
                                                             'offset' => '24',
                                                             'type' => '42183'
                                                           },
                                                    '9' => {
                                                             'name' => 'weights_supported',
                                                             'offset' => '28',
                                                             'type' => '42183'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_level_capabilities_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '498624' => {
                                        'BaseType' => '42183',
                                        'Name' => 'odp_bool_t[3]',
                                        'Size' => '12',
                                        'Type' => 'Array'
                                      },
                          '498640' => {
                                        'BaseType' => '498447',
                                        'Name' => 'odp_tm_level_capabilities_t[8]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '498656' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '334',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '404'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_tm_queues',
                                                             'offset' => '8',
                                                             'type' => '10194'
                                                           },
                                                    '10' => {
                                                              'name' => 'marking_colors_supported',
                                                              'offset' => '44',
                                                              'type' => '498624'
                                                            },
                                                    '11' => {
                                                              'name' => 'per_level',
                                                              'offset' => '56',
                                                              'type' => '498640'
                                                            },
                                                    '2' => {
                                                             'name' => 'max_levels',
                                                             'offset' => '12',
                                                             'type' => '73'
                                                           },
                                                    '3' => {
                                                             'name' => 'egress_fcn_supported',
                                                             'offset' => '16',
                                                             'type' => '42183'
                                                           },
                                                    '4' => {
                                                             'name' => 'tm_queue_shaper_supported',
                                                             'offset' => '20',
                                                             'type' => '42183'
                                                           },
                                                    '5' => {
                                                             'name' => 'tm_queue_wred_supported',
                                                             'offset' => '24',
                                                             'type' => '42183'
                                                           },
                                                    '6' => {
                                                             'name' => 'tm_queue_dual_slope_supported',
                                                             'offset' => '28',
                                                             'type' => '42183'
                                                           },
                                                    '7' => {
                                                             'name' => 'vlan_marking_supported',
                                                             'offset' => '32',
                                                             'type' => '42183'
                                                           },
                                                    '8' => {
                                                             'name' => 'ecn_marking_supported',
                                                             'offset' => '36',
                                                             'type' => '42183'
                                                           },
                                                    '9' => {
                                                             'name' => 'drop_prec_marking_supported',
                                                             'offset' => '40',
                                                             'type' => '42183'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_capabilities_t',
                                        'Size' => '312',
                                        'Type' => 'Struct'
                                      },
                          '498808' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '391',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_num_tm_nodes',
                                                             'offset' => '0',
                                                             'type' => '10194'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_fanin_per_node',
                                                             'offset' => '4',
                                                             'type' => '10194'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_priority',
                                                             'offset' => '8',
                                                             'type' => '73'
                                                           },
                                                    '3' => {
                                                             'name' => 'min_weight',
                                                             'offset' => '9',
                                                             'type' => '73'
                                                           },
                                                    '4' => {
                                                             'name' => 'max_weight',
                                                             'offset' => '10',
                                                             'type' => '73'
                                                           },
                                                    '5' => {
                                                             'name' => 'tm_node_shaper_needed',
                                                             'offset' => '12',
                                                             'type' => '42183'
                                                           },
                                                    '6' => {
                                                             'name' => 'tm_node_wred_needed',
                                                             'offset' => '16',
                                                             'type' => '42183'
                                                           },
                                                    '7' => {
                                                             'name' => 'tm_node_dual_slope_needed',
                                                             'offset' => '20',
                                                             'type' => '42183'
                                                           },
                                                    '8' => {
                                                             'name' => 'fair_queuing_needed',
                                                             'offset' => '24',
                                                             'type' => '42183'
                                                           },
                                                    '9' => {
                                                             'name' => 'weights_needed',
                                                             'offset' => '28',
                                                             'type' => '42183'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_level_requirements_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '498961' => {
                                        'BaseType' => '498808',
                                        'Name' => 'odp_tm_level_requirements_t[8]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '498977' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '449',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_tm_queues',
                                                             'offset' => '0',
                                                             'type' => '10194'
                                                           },
                                                    '1' => {
                                                             'name' => 'num_levels',
                                                             'offset' => '4',
                                                             'type' => '73'
                                                           },
                                                    '2' => {
                                                             'name' => 'tm_queue_shaper_needed',
                                                             'offset' => '8',
                                                             'type' => '42183'
                                                           },
                                                    '3' => {
                                                             'name' => 'tm_queue_wred_needed',
                                                             'offset' => '12',
                                                             'type' => '42183'
                                                           },
                                                    '4' => {
                                                             'name' => 'tm_queue_dual_slope_needed',
                                                             'offset' => '16',
                                                             'type' => '42183'
                                                           },
                                                    '5' => {
                                                             'name' => 'vlan_marking_needed',
                                                             'offset' => '20',
                                                             'type' => '42183'
                                                           },
                                                    '6' => {
                                                             'name' => 'ecn_marking_needed',
                                                             'offset' => '24',
                                                             'type' => '42183'
                                                           },
                                                    '7' => {
                                                             'name' => 'drop_prec_marking_needed',
                                                             'offset' => '28',
                                                             'type' => '42183'
                                                           },
                                                    '8' => {
                                                             'name' => 'marking_colors_needed',
                                                             'offset' => '32',
                                                             'type' => '498624'
                                                           },
                                                    '9' => {
                                                             'name' => 'per_level',
                                                             'offset' => '44',
                                                             'type' => '498961'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_requirements_t',
                                        'Size' => '300',
                                        'Type' => 'Struct'
                                      },
                          '498989' => {
                                        'BaseType' => '499001',
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '455',
                                        'Name' => 'odp_tm_egress_fcn_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '499001' => {
                                        'Name' => 'void(*)(odp_packet_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '42428'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '499040' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '466',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_TM_EGRESS_PKT_IO',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_TM_EGRESS_FN',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum odp_tm_egress_kind_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '499052' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '475',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pktio',
                                                             'offset' => '0',
                                                             'type' => '42958'
                                                           },
                                                    '1' => {
                                                             'name' => 'egress_fcn',
                                                             'offset' => '0',
                                                             'type' => '498989'
                                                           }
                                                  },
                                        'Name' => 'anon-union-traffic_mngr.h-475',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '499115' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '479',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'egress_kind',
                                                             'offset' => '0',
                                                             'type' => '499040'
                                                           },
                                                    '1' => {
                                                             'name' => 'unnamed0',
                                                             'offset' => '8',
                                                             'type' => '499052'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_egress_t',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '499149' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '873',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ODP_TM_BYTE_BASED_WEIGHTS',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ODP_TM_FRAME_BASED_WEIGHTS',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum odp_tm_sched_mode_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '499161' => {
                                        'BaseType' => '499149',
                                        'Name' => 'odp_tm_sched_mode_t[16]',
                                        'Size' => '64',
                                        'Type' => 'Array'
                                      },
                          '5043' => {
                                      'BaseType' => '105',
                                      'Name' => 'uint64_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '513670' => {
                                        'BaseType' => '497642',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '122',
                                        'Name' => 'odp_tm_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '513681' => {
                                        'BaseType' => '497642',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '127',
                                        'Name' => 'odp_tm_queue_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '513692' => {
                                        'BaseType' => '497642',
                                        'Header' => 'traffic_mngr_types.h',
                                        'Line' => '132',
                                        'Name' => 'odp_tm_node_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '514684' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '783',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'commit_bps',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                    '1' => {
                                                             'name' => 'peak_bps',
                                                             'offset' => '8',
                                                             'type' => '105'
                                                           },
                                                    '2' => {
                                                             'name' => 'commit_burst',
                                                             'offset' => '16',
                                                             'type' => '10194'
                                                           },
                                                    '3' => {
                                                             'name' => 'peak_burst',
                                                             'offset' => '20',
                                                             'type' => '10194'
                                                           },
                                                    '4' => {
                                                             'name' => 'shaper_len_adjust',
                                                             'offset' => '24',
                                                             'type' => '36291'
                                                           },
                                                    '5' => {
                                                             'name' => 'dual_rate',
                                                             'offset' => '28',
                                                             'type' => '42183'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_shaper_params_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '514798' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '894',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'sched_modes',
                                                             'offset' => '0',
                                                             'type' => '499161'
                                                           },
                                                    '1' => {
                                                             'name' => 'sched_weights',
                                                             'offset' => '64',
                                                             'type' => '49676'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_sched_params_t',
                                        'Size' => '80',
                                        'Type' => 'Struct'
                                      },
                          '514872' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '983',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'max_pkts',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_bytes',
                                                             'offset' => '8',
                                                             'type' => '105'
                                                           },
                                                    '2' => {
                                                             'name' => 'enable_max_pkts',
                                                             'offset' => '16',
                                                             'type' => '42183'
                                                           },
                                                    '3' => {
                                                             'name' => 'enable_max_bytes',
                                                             'offset' => '20',
                                                             'type' => '42183'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_threshold_params_t',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '514972' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1119',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'min_threshold',
                                                             'offset' => '0',
                                                             'type' => '497631'
                                                           },
                                                    '1' => {
                                                             'name' => 'med_threshold',
                                                             'offset' => '2',
                                                             'type' => '497631'
                                                           },
                                                    '2' => {
                                                             'name' => 'med_drop_prob',
                                                             'offset' => '4',
                                                             'type' => '497631'
                                                           },
                                                    '3' => {
                                                             'name' => 'max_drop_prob',
                                                             'offset' => '6',
                                                             'type' => '497631'
                                                           },
                                                    '4' => {
                                                             'name' => 'enable_wred',
                                                             'offset' => '8',
                                                             'type' => '42183'
                                                           },
                                                    '5' => {
                                                             'name' => 'use_byte_fullness',
                                                             'offset' => '12',
                                                             'type' => '42183'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_wred_params_t',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '515072' => {
                                        'BaseType' => '497686',
                                        'Name' => 'odp_tm_wred_t[3]',
                                        'Size' => '24',
                                        'Type' => 'Array'
                                      },
                          '515088' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1235',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'user_context',
                                                             'offset' => '0',
                                                             'type' => '391'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_fanin',
                                                             'offset' => '8',
                                                             'type' => '10194'
                                                           },
                                                    '2' => {
                                                             'name' => 'shaper_profile',
                                                             'offset' => '16',
                                                             'type' => '497653'
                                                           },
                                                    '3' => {
                                                             'name' => 'threshold_profile',
                                                             'offset' => '24',
                                                             'type' => '497675'
                                                           },
                                                    '4' => {
                                                             'name' => 'wred_profile',
                                                             'offset' => '32',
                                                             'type' => '515072'
                                                           },
                                                    '5' => {
                                                             'name' => 'level',
                                                             'offset' => '56',
                                                             'type' => '73'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_node_params_t',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '515175' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1404',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'user_context',
                                                             'offset' => '0',
                                                             'type' => '391'
                                                           },
                                                    '1' => {
                                                             'name' => 'shaper_profile',
                                                             'offset' => '8',
                                                             'type' => '497653'
                                                           },
                                                    '2' => {
                                                             'name' => 'threshold_profile',
                                                             'offset' => '16',
                                                             'type' => '497675'
                                                           },
                                                    '3' => {
                                                             'name' => 'wred_profile',
                                                             'offset' => '24',
                                                             'type' => '515072'
                                                           },
                                                    '4' => {
                                                             'name' => 'priority',
                                                             'offset' => '48',
                                                             'type' => '73'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_queue_params_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '515288' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1652',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'shaper_profile',
                                                             'offset' => '0',
                                                             'type' => '497653'
                                                           },
                                                    '1' => {
                                                             'name' => 'threshold_profile',
                                                             'offset' => '8',
                                                             'type' => '497675'
                                                           },
                                                    '2' => {
                                                             'name' => 'wred_profile',
                                                             'offset' => '16',
                                                             'type' => '515072'
                                                           },
                                                    '3' => {
                                                             'name' => 'tm_queue_fanin',
                                                             'offset' => '40',
                                                             'type' => '10194'
                                                           },
                                                    '4' => {
                                                             'name' => 'tm_node_fanin',
                                                             'offset' => '44',
                                                             'type' => '10194'
                                                           },
                                                    '5' => {
                                                             'name' => 'next_tm_node',
                                                             'offset' => '48',
                                                             'type' => '513692'
                                                           },
                                                    '6' => {
                                                             'name' => 'level',
                                                             'offset' => '56',
                                                             'type' => '73'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_node_info_t',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '515362' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1690',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'sched_profile',
                                                             'offset' => '0',
                                                             'type' => '497664'
                                                           },
                                                    '1' => {
                                                             'name' => 'tm_queue',
                                                             'offset' => '8',
                                                             'type' => '513681'
                                                           },
                                                    '2' => {
                                                             'name' => 'tm_node',
                                                             'offset' => '16',
                                                             'type' => '513692'
                                                           },
                                                    '3' => {
                                                             'name' => 'is_last',
                                                             'offset' => '24',
                                                             'type' => '42183'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_node_fanin_info_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '515449' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1757',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'shaper_profile',
                                                             'offset' => '0',
                                                             'type' => '497653'
                                                           },
                                                    '1' => {
                                                             'name' => 'threshold_profile',
                                                             'offset' => '8',
                                                             'type' => '497675'
                                                           },
                                                    '2' => {
                                                             'name' => 'wred_profile',
                                                             'offset' => '16',
                                                             'type' => '515072'
                                                           },
                                                    '3' => {
                                                             'name' => 'next_tm_node',
                                                             'offset' => '40',
                                                             'type' => '513692'
                                                           },
                                                    '4' => {
                                                             'name' => 'active_pkt',
                                                             'offset' => '48',
                                                             'type' => '42428'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_queue_info_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '515588' => {
                                        'Header' => 'traffic_mngr.h',
                                        'Line' => '1839',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'total_pkt_cnt',
                                                             'offset' => '0',
                                                             'type' => '105'
                                                           },
                                                    '1' => {
                                                             'name' => 'max_pkt_cnt',
                                                             'offset' => '8',
                                                             'type' => '105'
                                                           },
                                                    '2' => {
                                                             'name' => 'total_byte_cnt',
                                                             'offset' => '16',
                                                             'type' => '105'
                                                           },
                                                    '3' => {
                                                             'name' => 'max_byte_cnt',
                                                             'offset' => '24',
                                                             'type' => '105'
                                                           },
                                                    '4' => {
                                                             'name' => 'total_pkt_cnt_valid',
                                                             'offset' => '32',
                                                             'type' => '42183'
                                                           },
                                                    '5' => {
                                                             'name' => 'max_pkt_cnt_valid',
                                                             'offset' => '36',
                                                             'type' => '42183'
                                                           },
                                                    '6' => {
                                                             'name' => 'total_byte_cnt_valid',
                                                             'offset' => '40',
                                                             'type' => '42183'
                                                           },
                                                    '7' => {
                                                             'name' => 'max_byte_cnt_valid',
                                                             'offset' => '44',
                                                             'type' => '42183'
                                                           },
                                                    '8' => {
                                                             'name' => 'approx_byte_cnt',
                                                             'offset' => '48',
                                                             'type' => '42183'
                                                           }
                                                  },
                                        'Name' => 'struct odp_tm_query_info_t',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '523229' => {
                                        'BaseType' => '514684',
                                        'Name' => 'odp_tm_shaper_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '525040' => {
                                        'BaseType' => '514798',
                                        'Name' => 'odp_tm_sched_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '525228' => {
                                        'BaseType' => '514972',
                                        'Name' => 'odp_tm_wred_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '526020' => {
                                        'BaseType' => '498656',
                                        'Name' => 'odp_tm_capabilities_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '526026' => {
                                        'BaseType' => '498977',
                                        'Name' => 'odp_tm_requirements_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '528721' => {
                                        'BaseType' => '515588',
                                        'Name' => 'odp_tm_query_info_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '541716' => {
                                        'BaseType' => '499115',
                                        'Name' => 'odp_tm_egress_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '54248' => {
                                       'BaseType' => '46118',
                                       'Name' => 'odp_pktio_stats_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54337' => {
                                       'BaseType' => '42428',
                                       'Name' => 'odp_packet_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54379' => {
                                       'BaseType' => '54385',
                                       'Name' => 'odp_packet_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54385' => {
                                       'BaseType' => '42428',
                                       'Name' => 'odp_packet_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '54489' => {
                                       'BaseType' => '47357',
                                       'Name' => 'odp_pktio_capability_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54521' => {
                                       'BaseType' => '54527',
                                       'Name' => 'odp_pktio_config_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54527' => {
                                       'BaseType' => '47191',
                                       'Name' => 'odp_pktio_config_t const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '545458' => {
                                        'BaseType' => '514872',
                                        'Name' => 'odp_tm_threshold_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '54558' => {
                                       'BaseType' => '54564',
                                       'Name' => 'odp_pktin_queue_param_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54564' => {
                                       'BaseType' => '46563',
                                       'Name' => 'odp_pktin_queue_param_t const',
                                       'Size' => '72',
                                       'Type' => 'Const'
                                     },
                          '54595' => {
                                       'BaseType' => '54601',
                                       'Name' => 'odp_pktout_queue_param_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54601' => {
                                       'BaseType' => '46611',
                                       'Name' => 'odp_pktout_queue_param_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '546790' => {
                                        'BaseType' => '515088',
                                        'Name' => 'odp_tm_node_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '549185' => {
                                        'BaseType' => '515175',
                                        'Name' => 'odp_tm_queue_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '552015' => {
